<!doctype html>



  


<html class="theme-next pisces use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="&amp;#x597D;&amp;#x591A;&amp;#x5E74;&amp;#x6CA1;&amp;#x6709;&amp;#x66F4;&amp;#x65B0;&amp;#x4E86;&amp;#xFF0C;&amp;#x6BCF;&amp;#x6B21;&amp;#x60F3;&amp;#x5199;&amp;#x4E00;&amp;#x4E9B;&amp;#x4EC0;&amp;#x4E48;&amp;#xFF0C;&amp;#x4F46;&amp;#x662F;&amp;#x56E0;&amp;#x4E3A;&amp;#x79CD;&amp;#x79CD;&amp;#x539F;">
<meta property="og:type" content="article">
<meta property="og:title" content="永远别让自己陷入怪圈">
<meta property="og:url" content="http://stareme.wang/2021/11/23/最近的怪圈/index.html">
<meta property="og:site_name" content="做另一面的自己">
<meta property="og:description" content="&amp;#x597D;&amp;#x591A;&amp;#x5E74;&amp;#x6CA1;&amp;#x6709;&amp;#x66F4;&amp;#x65B0;&amp;#x4E86;&amp;#xFF0C;&amp;#x6BCF;&amp;#x6B21;&amp;#x60F3;&amp;#x5199;&amp;#x4E00;&amp;#x4E9B;&amp;#x4EC0;&amp;#x4E48;&amp;#xFF0C;&amp;#x4F46;&amp;#x662F;&amp;#x56E0;&amp;#x4E3A;&amp;#x79CD;&amp;#x79CD;&amp;#x539F;">
<meta property="og:updated_time" content="2021-11-23T09:25:39.688Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="永远别让自己陷入怪圈">
<meta name="twitter:description" content="&amp;#x597D;&amp;#x591A;&amp;#x5E74;&amp;#x6CA1;&amp;#x6709;&amp;#x66F4;&amp;#x65B0;&amp;#x4E86;&amp;#xFF0C;&amp;#x6BCF;&amp;#x6B21;&amp;#x60F3;&amp;#x5199;&amp;#x4E00;&amp;#x4E9B;&amp;#x4EC0;&amp;#x4E48;&amp;#xFF0C;&amp;#x4F46;&amp;#x662F;&amp;#x56E0;&amp;#x4E3A;&amp;#x79CD;&amp;#x79CD;&amp;#x539F;">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://stareme.wang/2021/11/23/最近的怪圈/"/>





  <title> 永远别让自己陷入怪圈 | 做另一面的自己 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?1b404ff8751a05c0c72a0484de9977f5";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">做另一面的自己</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup">
 <span class="search-icon fa fa-search"></span>
 <input type="text" id="local-search-input">
 <div id="local-search-result"></div>
 <span class="popup-btn-close">close</span>
</div>


    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://stareme.wang/2021/11/23/最近的怪圈/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="stareme">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/uploads/me.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="做另一面的自己">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="做另一面的自己" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                永远别让自己陷入怪圈
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2021-11-23T17:20:51+08:00">
                2021-11-23
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
              <span class="post-meta-divider">|</span>
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/新加坡/" itemprop="url" rel="index">
                    <span itemprop="name">新加坡</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <a href="/2021/11/23/最近的怪圈/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2021/11/23/最近的怪圈/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x597D;&#x591A;&#x5E74;&#x6CA1;&#x6709;&#x66F4;&#x65B0;&#x4E86;&#xFF0C;&#x6BCF;&#x6B21;&#x60F3;&#x5199;&#x4E00;&#x4E9B;&#x4EC0;&#x4E48;&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x79CD;&#x79CD;&#x539F;&#x56E0;&#xFF0C;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x5199;&#xFF0C;&#x751F;&#x6D3B;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x603B;&#x7ED3;&#x7684;&#x3002;&#x6700;&#x8FD1;&#x9047;&#x4E0A;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x4E0A;&#x7684;&#x5947;&#x8469;&#x4E8B;&#xFF0C;&#x8BB0;&#x5F55;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x4E8B;&#x60C5;&#x7684;&#x7ECF;&#x8FC7;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x5728;&#x524D;&#x516C;&#x53F8;&#x6709;&#x6761;&#x4E0D;&#x7A33;&#x7684;&#x5DE5;&#x4F5C;&#x751F;&#x6D3B;&#x4E86;&#x4E24;&#x5E74;&#xFF0C;&#x6253;&#x5FC3;&#x5E95;&#x656C;&#x4F69;&#x524D;&#x8001;&#x677F;&#x7684;&#x5DE5;&#x4F5C;&#x7406;&#x5FF5;&#xFF0C;&#x6570;&#x636E;&#x9A71;&#x52A8;&#x4EA7;&#x54C1;&#x3002;&#x62B1;&#x7740;&#x5C1D;&#x8BD5;&#x548C;&#x63A5;&#x53D7;&#x65B0;&#x6311;&#x6218;&#x7684;&#x5FC3;&#x6001;&#x79BB;&#x5F00;&#x4E86;&#x539F;&#x516C;&#x53F8;&#xFF0C;&#x53BB;&#x4E86;&#x4E00;&#x5BB6;&#x505A;&#x8BED;&#x97F3;&#x76F4;&#x64AD;&#x7684;&#x6B66;&#x6C49;&#x516C;&#x53F8;&#xFF0C;&#x5728;&#x65B0;&#x52A0;&#x5761;&#x521A;&#x5EFA;&#x7ACB;&#x56E2;&#x961F;&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#x8FD8;&#x662F;&#x5F88;&#x62B1;&#x6709;&#x671F;&#x671B;&#x7684;&#xFF0C;&#x8FDB;&#x5165;&#x8FD9;&#x4E2A;&#x516C;&#x53F8;&#x53EF;&#x4EE5;&#x5927;&#x5C55;&#x62F3;&#x811A;&#x4E00;&#x7FFB;&#xFF0C;&#x4E5F;&#x4E0D;&#x8F9C;&#x8D1F;&#x81EA;&#x5DF1;&#x591A;&#x5E74;&#x4ECE;&#x4E8B;&#x793E;&#x4EA4;&#x9886;&#x57DF;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x867D;&#x7136;&#x9884;&#x6599;&#x5230;&#x4E86;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x5982;&#x610F;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6BD5;&#x7ADF;&#x521D;&#x521B;&#x516C;&#x53F8;&#x3002;</p>
<p>&#x4E8E;&#x662F;10.11&#x5C31;&#x7B2C;&#x4E00;&#x5929;&#x5165;&#x804C;&#x8FD9;&#x5BB6;&#x516C;&#x53F8;&#xFF0C;&#x529E;&#x516C;&#x533A;&#x57DF;&#x662F;&#x5408;&#x79DF;&#x7684;wework&#x65B9;&#x5F0F;&#xFF0C;&#x6211;&#x4E5F;&#x7B2C;&#x4E00;&#x6B21;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x529E;&#x516C;&#x6A21;&#x5F0F;&#xFF0C;&#x529E;&#x7406;&#x5165;&#x804C;&#x624B;&#x7EED;&#x5C0F;&#x59D0;&#x59D0;&#x8FD8;&#x662F;&#x5F88;&#x70ED;&#x60C5;&#x7684;&#xFF0C;&#x540E;&#x9762;&#x9886;&#x7535;&#x8111;&#xFF0C;&#x81EA;&#x5DF1;&#x5B89;&#x88C5;&#xFF0C;&#x5FC3;&#x91CC;&#x5F00;&#x59CB;&#x89C9;&#x5F97;&#x8FD9;&#x516C;&#x53F8;&#x8FDE;&#x4E2A;IT&#x90FD;&#x6CA1;&#x6709;&#x5417;&#xFF0C;&#x52A0;&#x4E0A;&#x6B66;&#x6C49;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x6240;&#x6709;&#x529E;&#x516C;&#x4E5F;&#x5FEB;&#x4E0A;&#x5343;&#x4EBA;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x5C0F;&#x516C;&#x53F8;&#x4E86;&#x3002;&#x540E;&#x9762;&#x518D;&#x62C9;&#x53D6;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x4E48;&#x5E9E;&#x5927;&#x7684;&#x5DE5;&#x7A0B;&#xFF0C;&#x7ADF;&#x7136;&#x4E00;&#x70B9;&#x6587;&#x6863;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x5FC3;&#x91CC;&#x8FD8;&#x6709;&#x70B9;&#x4E0D;&#x4E60;&#x60EF;&#x3002;&#x540E;&#x9762;&#x6162;&#x6162;&#x7684;&#x5446;&#x4E86;&#x51E0;&#x5929;&#xFF0C;&#x53D1;&#x73B0;&#x4E00;&#x5207;&#x548C;&#x81EA;&#x5DF1;&#x9884;&#x671F;&#x7684;&#x76F8;&#x5DEE;&#x592A;&#x8FDC;&#xFF0C;&#x8FD9;&#x8FB9;&#x867D;&#x7136;&#x5F00;&#x4E86;&#x4E00;&#x4E2A;&#x529E;&#x516C;&#x5BA4;&#xFF0C;&#x4F46;&#x529E;&#x516C;&#x548C;&#x6B66;&#x6C49;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x72EC;&#x7ACB;&#x5F00;&#x6765;&#xFF0C;&#x4E1A;&#x52A1;&#x4E0A;&#x548C;&#x4EE3;&#x7801;&#x5E93;&#x90FD;&#x662F;&#x5171;&#x7528;&#xFF0C;&#x5DE5;&#x4F5C;&#x4E0A;&#x4F1A;&#x5E26;&#x6765;&#x5F88;&#x591A;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x9EBB;&#x70E6;&#xFF1B;&#x6BCF;&#x5929;&#x7684;&#x534A;&#x4E2A;&#x591A;&#x5C0F;&#x65F6;&#x7684;&#x7AD9;&#x4F1A;&#xFF0C;&#x4E2D;&#x5348;&#x4E00;&#x70B9;&#x53BB;&#x5403;&#x996D;&#xFF0C;&#x4E24;&#x70B9;&#x4E0A;&#x73ED;&#xFF0C;&#x4E2D;&#x5348;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x5348;&#x7761;&#xFF0C;&#x90FD;&#x8BA9;&#x6211;&#x4E0D;&#x5F97;&#x4E0D;&#x91CD;&#x65B0;&#x9002;&#x5E94;&#xFF0C;&#x8FD9;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x597D;&#x62B1;&#x6028;&#x7684;&#xFF0C;&#x6BD5;&#x7ADF;&#x6BCF;&#x4E2A;&#x516C;&#x53F8;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5236;&#x5EA6;&#xFF1B;&#x4EA7;&#x54C1;&#x9700;&#x6C42;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x8BA8;&#x8BBA;&#xFF0C;&#x5FF5;&#x5B8C;&#x9700;&#x6C42;&#xFF0C;&#x5F00;&#x53D1;&#x81EA;&#x5DF1;&#x8BA4;&#x9886;&#xFF0C;&#x4E00;&#x671F;&#x4EFB;&#x52A1;&#x591A;&#x8FBE;40&#x4E2A;&#xFF0C;&#x591A;&#x4E9B;&#x662F;&#x8FD0;&#x8425;&#x4EFB;&#x52A1;&#xFF0C;&#x62FF;&#x5230;&#x4EFB;&#x52A1;&#x81EA;&#x5DF1;&#x548C;&#x4EA7;&#x54C1;&#x8BA8;&#x8BBA;&#x6709;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4E24;&#x5468;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x6D4B;&#x8BD5;&#x65F6;&#x95F4;&#xFF0C;&#x76F4;&#x63A5;&#x4E0A;&#x7EBF;&#xFF0C;&#x89C1;&#x8BC1;&#x4E86;&#x6D3B;&#x751F;&#x751F;&#x7684;&#x62FF;&#x7EBF;&#x4E0A;&#x7528;&#x6237;&#x5F53;&#x767D;&#x8001;&#x9F20;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x53EF;&#x60F3;&#x800C;&#x77E5;&#xFF0C;&#x4EA7;&#x54C1;&#x5728;&#x7EBF;&#x4E0A;&#x4E4B;&#x540E;&#x5230;&#x5904;&#x90FD;&#x662F;bug&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x5BF9;&#x81EA;&#x5DF1;&#x505A;&#x7684;&#x4EA7;&#x54C1;&#x6240;&#x4E0D;&#x80FD;&#x63A5;&#x53D7;&#x7684;&#xFF1B;&#x5DE5;&#x4F5C;&#x4EFB;&#x52A1;&#x7684;&#x5206;&#x914D;&#x7CBE;&#x786E;&#x5230;&#x5C0F;&#x65F6;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x6211;&#x6CA1;&#x6709;&#x9884;&#x6599;&#x5230;&#x7684;&#x3002;&#x8D8A;&#x60F3;&#x8D8A;&#x4E0D;&#x5BF9;&#x52B2;&#xFF0C;&#x672C;&#x6765;&#x60F3;&#x597D;&#x597D;&#x6765;&#x6253;&#x78E8;&#x4EA7;&#x54C1;&#x7684;&#xFF0C;&#x6700;&#x540E;&#x6CA1;&#x60F3;&#x5230;&#x7684;&#x662F;&#x7ADF;&#x7136;&#x662F;&#x505A;&#x8FD0;&#x8425;&#x6D3B;&#x52A8;&#xFF0C;&#x800C;&#x4E14;&#x6D41;&#x7A0B;&#x76F8;&#x5F53;&#x4E0D;&#x89C4;&#x8303;&#xFF0C;&#x8FD9;&#x79CD;&#x505A;&#x4EA7;&#x54C1;&#x7684;&#x65B9;&#x5F0F;&#x8DDF;&#x9886;&#x5BFC;&#x53CD;&#x9988;&#x4E4B;&#x540E;&#xFF0C;&#x4ED6;&#x4E5F;&#x53EA;&#x662F;&#x4E91;&#x6DE1;&#x98CE;&#x8F7B;&#x7684;&#x5E26;&#x8FC7;&#xFF0C;&#x6216;&#x8BB8;&#x53EA;&#x662F;&#x6211;&#x7684;&#x4E00;&#x53A2;&#x60C5;&#x613F;&#xFF0C;&#x8FD9;&#x6837;&#x5DE5;&#x4F5C;&#x5E76;&#x4E0D;&#x803D;&#x8BEF;&#x8D5A;&#x94B1;&#x3002;</p>
<p>&#x6211;&#x5F88;&#x65E0;&#x5948;&#xFF0C;&#x6211;&#x4E00;&#x8FB9;&#x60F3;&#x8981;&#x79BB;&#x5F00;&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x4F5C;&#x6A21;&#x5F0F;&#xFF0C;&#x4E00;&#x8FB9;&#x53C8;&#x5728;&#x60F3;&#x8981;&#x4E0D;&#x8981;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x9009;&#x62E9;&#x4E70;&#x5355;&#xFF0C;&#x505A;&#x4E0B;&#x53BB;&#xFF0C;&#x6BD5;&#x7ADF;&#x53C8;&#x4E0D;&#x662F;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x5728;&#x5DE5;&#x4F5C;&#x3002;&#x81EA;&#x5DF1;&#x4E5F;&#x5728;&#x52AA;&#x529B;&#x770B;&#x5176;&#x5B83;&#x4E4B;&#x524D;&#x62D2;&#x6389;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x771F;&#x7684;&#x5F88;&#x6323;&#x624E;&#xFF0C;&#x5728;&#x8D70;&#x4E0E;&#x4E0D;&#x8D70;&#x4E4B;&#x95F4;&#xFF0C;&#x8D70;&#x4E86;&#x53BB;&#x54EA;&#x91CC;&#xFF0C;&#x56DE;&#x539F;&#x516C;&#x53F8;&#x8FD8;&#x662F;&#x6362;&#x65B0;&#x516C;&#x53F8;&#xFF0C;&#x671F;&#x95F4;&#x548C;&#x5BB6;&#x91CC;&#x4EBA;&#x5435;&#x67B6;&#x548C;&#x9886;&#x5BFC;&#x4E5F;&#x5546;&#x8BA8;&#x8FC7;&#x3002;&#x56DE;&#x539F;&#x6765;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x4E9B;&#x4E0D;&#x7518;&#x5FC3;&#xFF0C;&#x867D;&#x7136;&#x9886;&#x5BFC;&#x548C;&#x540C;&#x4E8B;&#x90FD;&#x671F;&#x5F85;&#x7740;&#x6211;&#x56DE;&#x53BB;&#xFF0C;&#x4F46;&#x662F;&#x51FA;&#x6765;&#x662F;&#x5B66;&#x65B0;&#x6280;&#x672F;&#x548C;&#x4F53;&#x9A8C;&#x65B0;&#x7684;&#x6311;&#x6218;&#x7684;&#x3002;&#x5C31;&#x5728;&#x63A5;&#x4E86;&#x539F;&#x516C;&#x53F8;offer&#x51C6;&#x5907;&#x56DE;&#x53BB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5185;&#x5FC3;&#x5E76;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x72C2;&#x559C;&#xFF0C;&#x800C;&#x662F;&#x7126;&#x8651;&#xFF0C;&#x4E8E;&#x662F;&#x53C8;&#x679C;&#x65AD;&#x8DDF;&#x539F;&#x9886;&#x5BFC;&#x8054;&#x7CFB;&#xFF0C;&#x62D2;&#x4E86;offer&#xFF0C;&#x4E5F;&#x771F;&#x662F;&#x591F;&#x4E22;&#x8138;&#x7684;&#x3002;&#x8FD9;&#x65F6;&#x5FC3;&#x60C5;&#x624D;&#x5E73;&#x9759;&#x4E0B;&#x6765;&#xFF0C;&#x8981;&#x4E48;&#x5446;&#x4E0B;&#x53BB;&#xFF0C;&#x8981;&#x4E48;&#x53BB;&#x5BFB;&#x627E;&#x65B0;&#x7684;offer,&#x8FD9;&#x65F6;&#x5019;&#x4E5F;&#x6536;&#x5230;&#x4E86;&#x4EE5;&#x524D;&#x62D2;&#x6389;&#x516C;&#x53F8;&#x7684;offer, &#x5728;&#x548C;&#x524D;&#x540C;&#x4E8B;&#x6253;&#x542C;&#x4E86;&#x4E00;&#x6CE2;&#x91CC;&#x9762;&#x7684;&#x60C5;&#x51B5;&#x4E4B;&#x540E;&#xFF0C;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x51B3;&#x5B9A;&#x53BB;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x5C1D;&#x8BD5;&#x5C31;&#x610F;&#x5473;&#x7740;&#x6709;&#x65B0;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x4F46;&#x5E94;&#x8BE5;&#x89C9;&#x5F97;&#x6CA1;&#x5FC5;&#x8981;&#x5BB3;&#x6015;&#x548C;&#x80C6;&#x602F;&#xFF0C;&#x6211;&#x5E94;&#x8BE5;&#x91CD;&#x65B0;&#x627E;&#x56DE;&#x81EA;&#x5DF1;&#x7684;&#x81EA;&#x4FE1;&#x3002;&#x7ECF;&#x8FC7;&#x8FD9;&#x4EF6;&#x4E8B;&#xFF0C;&#x505A;&#x4E86;&#x5F88;&#x591A;&#x81EA;&#x5DF1;&#x4E0D;&#x6562;&#x60F3;&#x4E5F;&#x4E0D;&#x6562;&#x505A;&#x7684;&#x4E8B;&#xFF0C;&#x4E5F;&#x5BF9;&#x4E0D;&#x8D77;&#x5F88;&#x591A;&#x540C;&#x4E8B;&#xFF0C;&#x524D;&#x540C;&#x4E8B;&#x4E3A;&#x6211;&#x94FA;&#x597D;&#x4E86;&#x8DEF;&#xFF0C;&#x5FC3;&#x5FC3;&#x5FF5;&#x5FF5;&#x8BA9;&#x6211;&#x56DE;&#x53BB;&#xFF0C;&#x4F46;&#x6211;&#x5374;&#x5728;&#x6700;&#x540E;&#x53CD;&#x6094;&#x4E86;&#xFF0C;&#x5FC3;&#x91CC;&#x611F;&#x6069;&#x3002;&#x5728;&#x5DE5;&#x4F5C;&#x4E0A;&#x4E5F;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x4E8B;&#xFF0C;&#x4EE5;&#x524D;&#x53EA;&#x662F;&#x78B0;&#x5230;&#x522B;&#x4EBA;&#x4F1A;&#x8FD9;&#x6837;&#xFF0C;&#x5FC3;&#x91CC;&#x8FD8;&#x89C9;&#x5F97;&#x5F88;&#x5947;&#x602A;&#xFF0C;&#x603B;&#x662F;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5728;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x4E0A;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#x4E5F;&#x80FD;&#x575A;&#x6301;&#x51E0;&#x5E74;&#xFF0C;&#x6CA1;&#x60F3;&#x5230;&#x4EE5;&#x524D;&#x4E5F;&#x53EA;&#x662F;&#x81EA;&#x5DF1;&#x8FD0;&#x6C14;&#x597D;&#xFF0C;&#x53BB;&#x7684;&#x90FD;&#x662F;&#x4E0D;&#x9519;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x60F3;&#x5230;&#x81EA;&#x5DF1;&#x6709;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x53BB;&#x505A;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x575A;&#x6301;&#x65F6;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x9009;&#x62E9;&#x4E86;&#x65AD;&#x820D;&#x79BB;&#xFF0C;&#x53CA;&#x65F6;&#x6B62;&#x635F;&#x624D;&#x662F;&#x4EBA;&#x751F;&#x7684;&#x660E;&#x667A;&#x4E4B;&#x4E3E;&#x3002;</p>
<p>&#x5728;&#x90A3;&#x4E00;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4F53;&#x4F1A;&#x5230;&#x4E86;&#x5EA6;&#x65E5;&#x5982;&#x5E74;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x9677;&#x5165;&#x4E86;&#x602A;&#x5708;&#xFF0C;&#x6BCF;&#x5929;&#x72B9;&#x8C6B;&#x4E0D;&#x5B9A;&#xFF0C;&#x5929;&#x5929;&#x5931;&#x7720;&#x7126;&#x8651;&#xFF0C;&#x81EA;&#x4FE1;&#x5FC3;&#x4E22;&#x5931;&#xFF0C;&#x5BB6;&#x4EBA;&#x770B;&#x5230;&#x6211;&#x8FD9;&#x6837;&#x4E5F;&#x5BF9;&#x6211;&#x5FEB;&#x5931;&#x53BB;&#x8010;&#x6027;&#x3002;&#x73B0;&#x5728;&#x7EC8;&#x4E8E;&#x89E3;&#x8131;&#xFF0C;&#x6B63;&#x5E94;&#x4E86;&#x90A3;&#x53E5;&#x8BDD;&#xFF0C;&#x5728;&#x6240;&#x8C13;&#x201D;&#x4EBA;&#x4E16;&#x95F4;&#x201D;&#x6478;&#x722C;&#x6EDA;&#x6253;&#x81F3;&#x4ECA;&#xFF0C;&#x6211;&#x552F;&#x4E00;&#x613F;&#x610F;&#x89C6;&#x4E3A;&#x771F;&#x7406;&#x7684;&#xFF0C;&#x5C31;&#x53EA;&#x6709;&#x8FD9;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x4F1A;&#x8FC7;&#x53BB;&#x7684;&#x3002;&#x4E0D;&#x8981;&#x8BA9;&#x4EFB;&#x4F55;&#x4EBA;&#x4EFB;&#x4F55;&#x4E8B;&#x6253;&#x65AD;&#x4F60;&#x7684;&#x8282;&#x594F;&#x3002;&#x5E0C;&#x671B;&#x4EE5;&#x540E;&#x80FD;&#x52C7;&#x6562;&#x575A;&#x5B9A;&#x7684;&#x8D70;&#x4E0B;&#x53BB;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2018/12/22/工作中的负能量/" rel="next" title="工作中的负能量">
                <i class="fa fa-chevron-left"></i> 工作中的负能量
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2021/11/23/最近的怪圈/"
           data-title="永远别让自己陷入怪圈" data-url="http://stareme.wang/2021/11/23/最近的怪圈/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel sidebar-panel-active">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/uploads/me.png"
               alt="stareme" />
          <p class="site-author-name" itemprop="name">stareme</p>
          <p class="site-description motion-element" itemprop="description">敢问路在何方</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">16</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/wangbin0802" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/1646304090/profile?topnav=1&wvr=6" target="_blank" title="Weibo">
                  
                    <i class="fa fa-fw fa-weibo"></i>
                  
                  Weibo
                </a>
              </span>
            
          
        </div>

        
        

        
        

        


      </section>

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2021</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">stareme</span>
</div>


<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>


        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.1.0"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"staremewang"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  








  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
      search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();
    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';
      $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = $( "entry", xmlResponse ).map(function() {
            return {
              title: $( "title", this ).text(),
              content: $("content",this).text(),
              url: $( "url" , this).text()
            };
          }).get();
          var $input = document.getElementById(search_id);
          var $resultContent = document.getElementById(content_id);
          $input.addEventListener('input', function(){
            var matchcounts = 0;
            var str='<ul class=\"search-result-list\">';
            var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
            $resultContent.innerHTML = "";
            if (this.value.trim().length > 1) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var content_index = [];
                var data_title = data.title.trim().toLowerCase();
                var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                var data_url = decodeURIComponent(data.url);
                var index_title = -1;
                var index_content = -1;
                var first_occur = -1;
                // only match artiles with not empty titles and contents
                if(data_title != '') {
                  keywords.forEach(function(keyword, i) {
                    index_title = data_title.indexOf(keyword);
                    index_content = data_content.indexOf(keyword);
                    if( index_title >= 0 || index_content >= 0 ){
                      isMatch = true;
                      if (i == 0) {
                        first_occur = index_content;
                      }
                    }

                  });
                }
                // show search results
                if (isMatch) {
                  matchcounts += 1;
                  str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                  var content = data.content.trim().replace(/<[^>]+>/g,"");
                  if (first_occur >= 0) {
                    // cut out 100 characters
                    var start = first_occur - 20;
                    var end = first_occur + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if(start == 0){
                      end = 50;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    var match_content = content.substring(start, end);
                    // highlight all keywords
                    keywords.forEach(function(keyword){
                      var regS = new RegExp(keyword, "gi");
                      match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                    });

                    str += "<p class=\"search-result\">" + match_content +"...</p>"
                  }
                  str += "</li>";
                }
              })};
            str += "</ul>";
            if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
            if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
            $resultContent.innerHTML = str;
          });
          proceedsearch();
        }
      });}

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>


  

  

  

  


</body>
</html>
