<!doctype html>



  


<html class="theme-next pisces use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="敢问路在何方">
<meta property="og:type" content="website">
<meta property="og:title" content="做另一面的自己">
<meta property="og:url" content="http://stareme.wang/index.html">
<meta property="og:site_name" content="做另一面的自己">
<meta property="og:description" content="敢问路在何方">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="做另一面的自己">
<meta name="twitter:description" content="敢问路在何方">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://stareme.wang/"/>





  <title> 做另一面的自己 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?1b404ff8751a05c0c72a0484de9977f5";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left 
   page-home 
 ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">做另一面的自己</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup">
 <span class="search-icon fa fa-search"></span>
 <input type="text" id="local-search-input">
 <div id="local-search-result"></div>
 <span class="popup-btn-close">close</span>
</div>


    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            
  <section id="posts" class="posts-expand">
    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://stareme.wang/2021/11/23/最近的怪圈/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="stareme">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/uploads/me.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="做另一面的自己">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="做另一面的自己" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2021/11/23/最近的怪圈/" itemprop="url">
                  永远别让自己陷入怪圈
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2021-11-23T17:20:51+08:00">
                2021-11-23
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
              <span class="post-meta-divider">|</span>
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/新加坡/" itemprop="url" rel="index">
                    <span itemprop="name">新加坡</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <a href="/2021/11/23/最近的怪圈/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2021/11/23/最近的怪圈/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x597D;&#x591A;&#x5E74;&#x6CA1;&#x6709;&#x66F4;&#x65B0;&#x4E86;&#xFF0C;&#x6BCF;&#x6B21;&#x60F3;&#x5199;&#x4E00;&#x4E9B;&#x4EC0;&#x4E48;&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x79CD;&#x79CD;&#x539F;&#x56E0;&#xFF0C;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x5199;&#xFF0C;&#x751F;&#x6D3B;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x603B;&#x7ED3;&#x7684;&#x3002;&#x6700;&#x8FD1;&#x9047;&#x4E0A;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x4E0A;&#x7684;&#x5947;&#x8469;&#x4E8B;&#xFF0C;&#x8BB0;&#x5F55;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x4E8B;&#x60C5;&#x7684;&#x7ECF;&#x8FC7;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x5728;&#x524D;&#x516C;&#x53F8;&#x6709;&#x6761;&#x4E0D;&#x7A33;&#x7684;&#x5DE5;&#x4F5C;&#x751F;&#x6D3B;&#x4E86;&#x4E24;&#x5E74;&#xFF0C;&#x6253;&#x5FC3;&#x5E95;&#x656C;&#x4F69;&#x524D;&#x8001;&#x677F;&#x7684;&#x5DE5;&#x4F5C;&#x7406;&#x5FF5;&#xFF0C;&#x6570;&#x636E;&#x9A71;&#x52A8;&#x4EA7;&#x54C1;&#x3002;&#x62B1;&#x7740;&#x5C1D;&#x8BD5;&#x548C;&#x63A5;&#x53D7;&#x65B0;&#x6311;&#x6218;&#x7684;&#x5FC3;&#x6001;&#x79BB;&#x5F00;&#x4E86;&#x539F;&#x516C;&#x53F8;&#xFF0C;&#x53BB;&#x4E86;&#x4E00;&#x5BB6;&#x505A;&#x8BED;&#x97F3;&#x76F4;&#x64AD;&#x7684;&#x6B66;&#x6C49;&#x516C;&#x53F8;&#xFF0C;&#x5728;&#x65B0;&#x52A0;&#x5761;&#x521A;&#x5EFA;&#x7ACB;&#x56E2;&#x961F;&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#x8FD8;&#x662F;&#x5F88;&#x62B1;&#x6709;&#x671F;&#x671B;&#x7684;&#xFF0C;&#x8FDB;&#x5165;&#x8FD9;&#x4E2A;&#x516C;&#x53F8;&#x53EF;&#x4EE5;&#x5927;&#x5C55;&#x62F3;&#x811A;&#x4E00;&#x7FFB;&#xFF0C;&#x4E5F;&#x4E0D;&#x8F9C;&#x8D1F;&#x81EA;&#x5DF1;&#x591A;&#x5E74;&#x4ECE;&#x4E8B;&#x793E;&#x4EA4;&#x9886;&#x57DF;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x867D;&#x7136;&#x9884;&#x6599;&#x5230;&#x4E86;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x5982;&#x610F;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6BD5;&#x7ADF;&#x521D;&#x521B;&#x516C;&#x53F8;&#x3002;</p>
<p>&#x4E8E;&#x662F;10.11&#x5C31;&#x7B2C;&#x4E00;&#x5929;&#x5165;&#x804C;&#x8FD9;&#x5BB6;&#x516C;&#x53F8;&#xFF0C;&#x529E;&#x516C;&#x533A;&#x57DF;&#x662F;&#x5408;&#x79DF;&#x7684;wework&#x65B9;&#x5F0F;&#xFF0C;&#x6211;&#x4E5F;&#x7B2C;&#x4E00;&#x6B21;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x529E;&#x516C;&#x6A21;&#x5F0F;&#xFF0C;&#x529E;&#x7406;&#x5165;&#x804C;&#x624B;&#x7EED;&#x5C0F;&#x59D0;&#x59D0;&#x8FD8;&#x662F;&#x5F88;&#x70ED;&#x60C5;&#x7684;&#xFF0C;&#x540E;&#x9762;&#x9886;&#x7535;&#x8111;&#xFF0C;&#x81EA;&#x5DF1;&#x5B89;&#x88C5;&#xFF0C;&#x5FC3;&#x91CC;&#x5F00;&#x59CB;&#x89C9;&#x5F97;&#x8FD9;&#x516C;&#x53F8;&#x8FDE;&#x4E2A;IT&#x90FD;&#x6CA1;&#x6709;&#x5417;&#xFF0C;&#x52A0;&#x4E0A;&#x6B66;&#x6C49;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x6240;&#x6709;&#x529E;&#x516C;&#x4E5F;&#x5FEB;&#x4E0A;&#x5343;&#x4EBA;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x5C0F;&#x516C;&#x53F8;&#x4E86;&#x3002;&#x540E;&#x9762;&#x518D;&#x62C9;&#x53D6;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x4E48;&#x5E9E;&#x5927;&#x7684;&#x5DE5;&#x7A0B;&#xFF0C;&#x7ADF;&#x7136;&#x4E00;&#x70B9;&#x6587;&#x6863;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x5FC3;&#x91CC;&#x8FD8;&#x6709;&#x70B9;&#x4E0D;&#x4E60;&#x60EF;&#x3002;&#x540E;&#x9762;&#x6162;&#x6162;&#x7684;&#x5446;&#x4E86;&#x51E0;&#x5929;&#xFF0C;&#x53D1;&#x73B0;&#x4E00;&#x5207;&#x548C;&#x81EA;&#x5DF1;&#x9884;&#x671F;&#x7684;&#x76F8;&#x5DEE;&#x592A;&#x8FDC;&#xFF0C;&#x8FD9;&#x8FB9;&#x867D;&#x7136;&#x5F00;&#x4E86;&#x4E00;&#x4E2A;&#x529E;&#x516C;&#x5BA4;&#xFF0C;&#x4F46;&#x529E;&#x516C;&#x548C;&#x6B66;&#x6C49;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x72EC;&#x7ACB;&#x5F00;&#x6765;&#xFF0C;&#x4E1A;&#x52A1;&#x4E0A;&#x548C;&#x4EE3;&#x7801;&#x5E93;&#x90FD;&#x662F;&#x5171;&#x7528;&#xFF0C;&#x5DE5;&#x4F5C;&#x4E0A;&#x4F1A;&#x5E26;&#x6765;&#x5F88;&#x591A;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x9EBB;&#x70E6;&#xFF1B;&#x6BCF;&#x5929;&#x7684;&#x534A;&#x4E2A;&#x591A;&#x5C0F;&#x65F6;&#x7684;&#x7AD9;&#x4F1A;&#xFF0C;&#x4E2D;&#x5348;&#x4E00;&#x70B9;&#x53BB;&#x5403;&#x996D;&#xFF0C;&#x4E24;&#x70B9;&#x4E0A;&#x73ED;&#xFF0C;&#x4E2D;&#x5348;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x5348;&#x7761;&#xFF0C;&#x90FD;&#x8BA9;&#x6211;&#x4E0D;&#x5F97;&#x4E0D;&#x91CD;&#x65B0;&#x9002;&#x5E94;&#xFF0C;&#x8FD9;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x597D;&#x62B1;&#x6028;&#x7684;&#xFF0C;&#x6BD5;&#x7ADF;&#x6BCF;&#x4E2A;&#x516C;&#x53F8;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5236;&#x5EA6;&#xFF1B;&#x4EA7;&#x54C1;&#x9700;&#x6C42;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x8BA8;&#x8BBA;&#xFF0C;&#x5FF5;&#x5B8C;&#x9700;&#x6C42;&#xFF0C;&#x5F00;&#x53D1;&#x81EA;&#x5DF1;&#x8BA4;&#x9886;&#xFF0C;&#x4E00;&#x671F;&#x4EFB;&#x52A1;&#x591A;&#x8FBE;40&#x4E2A;&#xFF0C;&#x591A;&#x4E9B;&#x662F;&#x8FD0;&#x8425;&#x4EFB;&#x52A1;&#xFF0C;&#x62FF;&#x5230;&#x4EFB;&#x52A1;&#x81EA;&#x5DF1;&#x548C;&#x4EA7;&#x54C1;&#x8BA8;&#x8BBA;&#x6709;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4E24;&#x5468;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x6D4B;&#x8BD5;&#x65F6;&#x95F4;&#xFF0C;&#x76F4;&#x63A5;&#x4E0A;&#x7EBF;&#xFF0C;&#x89C1;&#x8BC1;&#x4E86;&#x6D3B;&#x751F;&#x751F;&#x7684;&#x62FF;&#x7EBF;&#x4E0A;&#x7528;&#x6237;&#x5F53;&#x767D;&#x8001;&#x9F20;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x53EF;&#x60F3;&#x800C;&#x77E5;&#xFF0C;&#x4EA7;&#x54C1;&#x5728;&#x7EBF;&#x4E0A;&#x4E4B;&#x540E;&#x5230;&#x5904;&#x90FD;&#x662F;bug&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x5BF9;&#x81EA;&#x5DF1;&#x505A;&#x7684;&#x4EA7;&#x54C1;&#x6240;&#x4E0D;&#x80FD;&#x63A5;&#x53D7;&#x7684;&#xFF1B;&#x5DE5;&#x4F5C;&#x4EFB;&#x52A1;&#x7684;&#x5206;&#x914D;&#x7CBE;&#x786E;&#x5230;&#x5C0F;&#x65F6;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x6211;&#x6CA1;&#x6709;&#x9884;&#x6599;&#x5230;&#x7684;&#x3002;&#x8D8A;&#x60F3;&#x8D8A;&#x4E0D;&#x5BF9;&#x52B2;&#xFF0C;&#x672C;&#x6765;&#x60F3;&#x597D;&#x597D;&#x6765;&#x6253;&#x78E8;&#x4EA7;&#x54C1;&#x7684;&#xFF0C;&#x6700;&#x540E;&#x6CA1;&#x60F3;&#x5230;&#x7684;&#x662F;&#x7ADF;&#x7136;&#x662F;&#x505A;&#x8FD0;&#x8425;&#x6D3B;&#x52A8;&#xFF0C;&#x800C;&#x4E14;&#x6D41;&#x7A0B;&#x76F8;&#x5F53;&#x4E0D;&#x89C4;&#x8303;&#xFF0C;&#x8FD9;&#x79CD;&#x505A;&#x4EA7;&#x54C1;&#x7684;&#x65B9;&#x5F0F;&#x8DDF;&#x9886;&#x5BFC;&#x53CD;&#x9988;&#x4E4B;&#x540E;&#xFF0C;&#x4ED6;&#x4E5F;&#x53EA;&#x662F;&#x4E91;&#x6DE1;&#x98CE;&#x8F7B;&#x7684;&#x5E26;&#x8FC7;&#xFF0C;&#x6216;&#x8BB8;&#x53EA;&#x662F;&#x6211;&#x7684;&#x4E00;&#x53A2;&#x60C5;&#x613F;&#xFF0C;&#x8FD9;&#x6837;&#x5DE5;&#x4F5C;&#x5E76;&#x4E0D;&#x803D;&#x8BEF;&#x8D5A;&#x94B1;&#x3002;</p>
<p>&#x6211;&#x5F88;&#x65E0;&#x5948;&#xFF0C;&#x6211;&#x4E00;&#x8FB9;&#x60F3;&#x8981;&#x79BB;&#x5F00;&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x4F5C;&#x6A21;&#x5F0F;&#xFF0C;&#x4E00;&#x8FB9;&#x53C8;&#x5728;&#x60F3;&#x8981;&#x4E0D;&#x8981;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x9009;&#x62E9;&#x4E70;&#x5355;&#xFF0C;&#x505A;&#x4E0B;&#x53BB;&#xFF0C;&#x6BD5;&#x7ADF;&#x53C8;&#x4E0D;&#x662F;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x5728;&#x5DE5;&#x4F5C;&#x3002;&#x81EA;&#x5DF1;&#x4E5F;&#x5728;&#x52AA;&#x529B;&#x770B;&#x5176;&#x5B83;&#x4E4B;&#x524D;&#x62D2;&#x6389;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x771F;&#x7684;&#x5F88;&#x6323;&#x624E;&#xFF0C;&#x5728;&#x8D70;&#x4E0E;&#x4E0D;&#x8D70;&#x4E4B;&#x95F4;&#xFF0C;&#x8D70;&#x4E86;&#x53BB;&#x54EA;&#x91CC;&#xFF0C;&#x56DE;&#x539F;&#x516C;&#x53F8;&#x8FD8;&#x662F;&#x6362;&#x65B0;&#x516C;&#x53F8;&#xFF0C;&#x671F;&#x95F4;&#x548C;&#x5BB6;&#x91CC;&#x4EBA;&#x5435;&#x67B6;&#x548C;&#x9886;&#x5BFC;&#x4E5F;&#x5546;&#x8BA8;&#x8FC7;&#x3002;&#x56DE;&#x539F;&#x6765;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x4E9B;&#x4E0D;&#x7518;&#x5FC3;&#xFF0C;&#x867D;&#x7136;&#x9886;&#x5BFC;&#x548C;&#x540C;&#x4E8B;&#x90FD;&#x671F;&#x5F85;&#x7740;&#x6211;&#x56DE;&#x53BB;&#xFF0C;&#x4F46;&#x662F;&#x51FA;&#x6765;&#x662F;&#x5B66;&#x65B0;&#x6280;&#x672F;&#x548C;&#x4F53;&#x9A8C;&#x65B0;&#x7684;&#x6311;&#x6218;&#x7684;&#x3002;&#x5C31;&#x5728;&#x63A5;&#x4E86;&#x539F;&#x516C;&#x53F8;offer&#x51C6;&#x5907;&#x56DE;&#x53BB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5185;&#x5FC3;&#x5E76;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x72C2;&#x559C;&#xFF0C;&#x800C;&#x662F;&#x7126;&#x8651;&#xFF0C;&#x4E8E;&#x662F;&#x53C8;&#x679C;&#x65AD;&#x8DDF;&#x539F;&#x9886;&#x5BFC;&#x8054;&#x7CFB;&#xFF0C;&#x62D2;&#x4E86;offer&#xFF0C;&#x4E5F;&#x771F;&#x662F;&#x591F;&#x4E22;&#x8138;&#x7684;&#x3002;&#x8FD9;&#x65F6;&#x5FC3;&#x60C5;&#x624D;&#x5E73;&#x9759;&#x4E0B;&#x6765;&#xFF0C;&#x8981;&#x4E48;&#x5446;&#x4E0B;&#x53BB;&#xFF0C;&#x8981;&#x4E48;&#x53BB;&#x5BFB;&#x627E;&#x65B0;&#x7684;offer,&#x8FD9;&#x65F6;&#x5019;&#x4E5F;&#x6536;&#x5230;&#x4E86;&#x4EE5;&#x524D;&#x62D2;&#x6389;&#x516C;&#x53F8;&#x7684;offer, &#x5728;&#x548C;&#x524D;&#x540C;&#x4E8B;&#x6253;&#x542C;&#x4E86;&#x4E00;&#x6CE2;&#x91CC;&#x9762;&#x7684;&#x60C5;&#x51B5;&#x4E4B;&#x540E;&#xFF0C;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x51B3;&#x5B9A;&#x53BB;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x5C1D;&#x8BD5;&#x5C31;&#x610F;&#x5473;&#x7740;&#x6709;&#x65B0;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x4F46;&#x5E94;&#x8BE5;&#x89C9;&#x5F97;&#x6CA1;&#x5FC5;&#x8981;&#x5BB3;&#x6015;&#x548C;&#x80C6;&#x602F;&#xFF0C;&#x6211;&#x5E94;&#x8BE5;&#x91CD;&#x65B0;&#x627E;&#x56DE;&#x81EA;&#x5DF1;&#x7684;&#x81EA;&#x4FE1;&#x3002;&#x7ECF;&#x8FC7;&#x8FD9;&#x4EF6;&#x4E8B;&#xFF0C;&#x505A;&#x4E86;&#x5F88;&#x591A;&#x81EA;&#x5DF1;&#x4E0D;&#x6562;&#x60F3;&#x4E5F;&#x4E0D;&#x6562;&#x505A;&#x7684;&#x4E8B;&#xFF0C;&#x4E5F;&#x5BF9;&#x4E0D;&#x8D77;&#x5F88;&#x591A;&#x540C;&#x4E8B;&#xFF0C;&#x524D;&#x540C;&#x4E8B;&#x4E3A;&#x6211;&#x94FA;&#x597D;&#x4E86;&#x8DEF;&#xFF0C;&#x5FC3;&#x5FC3;&#x5FF5;&#x5FF5;&#x8BA9;&#x6211;&#x56DE;&#x53BB;&#xFF0C;&#x4F46;&#x6211;&#x5374;&#x5728;&#x6700;&#x540E;&#x53CD;&#x6094;&#x4E86;&#xFF0C;&#x5FC3;&#x91CC;&#x611F;&#x6069;&#x3002;&#x5728;&#x5DE5;&#x4F5C;&#x4E0A;&#x4E5F;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x4E8B;&#xFF0C;&#x4EE5;&#x524D;&#x53EA;&#x662F;&#x78B0;&#x5230;&#x522B;&#x4EBA;&#x4F1A;&#x8FD9;&#x6837;&#xFF0C;&#x5FC3;&#x91CC;&#x8FD8;&#x89C9;&#x5F97;&#x5F88;&#x5947;&#x602A;&#xFF0C;&#x603B;&#x662F;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5728;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x4E0A;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#x4E5F;&#x80FD;&#x575A;&#x6301;&#x51E0;&#x5E74;&#xFF0C;&#x6CA1;&#x60F3;&#x5230;&#x4EE5;&#x524D;&#x4E5F;&#x53EA;&#x662F;&#x81EA;&#x5DF1;&#x8FD0;&#x6C14;&#x597D;&#xFF0C;&#x53BB;&#x7684;&#x90FD;&#x662F;&#x4E0D;&#x9519;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x60F3;&#x5230;&#x81EA;&#x5DF1;&#x6709;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x53BB;&#x505A;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x575A;&#x6301;&#x65F6;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x9009;&#x62E9;&#x4E86;&#x65AD;&#x820D;&#x79BB;&#xFF0C;&#x53CA;&#x65F6;&#x6B62;&#x635F;&#x624D;&#x662F;&#x4EBA;&#x751F;&#x7684;&#x660E;&#x667A;&#x4E4B;&#x4E3E;&#x3002;</p>
<p>&#x5728;&#x90A3;&#x4E00;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4F53;&#x4F1A;&#x5230;&#x4E86;&#x5EA6;&#x65E5;&#x5982;&#x5E74;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x9677;&#x5165;&#x4E86;&#x602A;&#x5708;&#xFF0C;&#x6BCF;&#x5929;&#x72B9;&#x8C6B;&#x4E0D;&#x5B9A;&#xFF0C;&#x5929;&#x5929;&#x5931;&#x7720;&#x7126;&#x8651;&#xFF0C;&#x81EA;&#x4FE1;&#x5FC3;&#x4E22;&#x5931;&#xFF0C;&#x5BB6;&#x4EBA;&#x770B;&#x5230;&#x6211;&#x8FD9;&#x6837;&#x4E5F;&#x5BF9;&#x6211;&#x5FEB;&#x5931;&#x53BB;&#x8010;&#x6027;&#x3002;&#x73B0;&#x5728;&#x7EC8;&#x4E8E;&#x89E3;&#x8131;&#xFF0C;&#x6B63;&#x5E94;&#x4E86;&#x90A3;&#x53E5;&#x8BDD;&#xFF0C;&#x5728;&#x6240;&#x8C13;&#x201D;&#x4EBA;&#x4E16;&#x95F4;&#x201D;&#x6478;&#x722C;&#x6EDA;&#x6253;&#x81F3;&#x4ECA;&#xFF0C;&#x6211;&#x552F;&#x4E00;&#x613F;&#x610F;&#x89C6;&#x4E3A;&#x771F;&#x7406;&#x7684;&#xFF0C;&#x5C31;&#x53EA;&#x6709;&#x8FD9;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x4F1A;&#x8FC7;&#x53BB;&#x7684;&#x3002;&#x4E0D;&#x8981;&#x8BA9;&#x4EFB;&#x4F55;&#x4EBA;&#x4EFB;&#x4F55;&#x4E8B;&#x6253;&#x65AD;&#x4F60;&#x7684;&#x8282;&#x594F;&#x3002;&#x5E0C;&#x671B;&#x4EE5;&#x540E;&#x80FD;&#x52C7;&#x6562;&#x575A;&#x5B9A;&#x7684;&#x8D70;&#x4E0B;&#x53BB;&#x3002;</p>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://stareme.wang/2018/12/22/工作中的负能量/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="stareme">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/uploads/me.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="做另一面的自己">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="做另一面的自己" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2018/12/22/工作中的负能量/" itemprop="url">
                  工作中的负能量
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2018-12-22T16:47:43+08:00">
                2018-12-22
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
              <span class="post-meta-divider">|</span>
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/新加坡/" itemprop="url" rel="index">
                    <span itemprop="name">新加坡</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <a href="/2018/12/22/工作中的负能量/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2018/12/22/工作中的负能量/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x597D;&#x5DE7;&#x4E0D;&#x5DE7;&#xFF0C;&#x4ECA;&#x5E74;&#x5B8C;&#x6625;&#x8282;&#x6765;&#x65B0;&#x52A0;&#x5761;&#x521A;&#x597D;&#x662F;13&#x53F7;&#xFF0C;&#x4E00;&#x4E2A;&#x4E24;&#x5E74;&#x524D;&#x98CE;&#x5C18;&#x4EC6;&#x4EC6;&#x5E26;&#x7740;&#x5E0C;&#x671B;&#x6765;&#x65B0;&#x52A0;&#x5761;&#x7684;&#x5E74;&#x8F7B;&#x4EBA;&#xFF0C;&#x73B0;&#x5728;&#x597D;&#x50CF;&#x6CA1;&#x6709;&#x4E86;&#x5F53;&#x65F6;&#x7684;&#x671D;&#x6C14;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x6709;&#x4E9B;&#x4E27;&#x6C14;&#x3002;</p>
<p>&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x5728;&#x516C;&#x53F8;&#x7ECF;&#x5386;&#x4E86;&#x592A;&#x591A;&#x8D1F;&#x9762;&#x60C5;&#x7EEA;&#xFF0C;&#x4E8B;&#x60C5;&#x7684;&#x7ECF;&#x8FC7;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x5728;cto&#x5E26;&#x9886;&#x7740;server&#x56E2;&#x961F;&#x93D6;&#x6218;&#x9ED1;&#x5BA2;&#x7684;&#x4E00;&#x7FFB;&#x6218;&#x4E89;&#x4E2D;&#xFF0C;&#x7ED9;&#x6211;&#x4EEC;&#x670D;&#x52A1;&#x5E26;&#x6765;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x521B;&#x4F24;&#xFF0C;&#x6B64;&#x65F6;&#x6B63;&#x503C;&#x7F51;&#x7EA2;&#x4ECE;&#x6211;&#x4EEC;&#x5E73;&#x53F0;&#x8F6C;&#x5411;&#x5176;&#x4ED6;&#x5E73;&#x53F0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x867D;&#x7136;&#x6700;&#x7EC8;&#x9ED1;&#x5BA2;&#x88AB;&#x8D76;&#x8D70;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x95F4;&#x628A;&#x7528;&#x6237;&#x8E22;&#x8D70;&#xFF0C;&#x786E;&#x5B9E;&#x5F71;&#x54CD;&#x4E86;&#x4E0D;&#x5C11;&#x7528;&#x6237;&#x3002;&#x5728;&#x6709;&#x4E2A;&#x665A;&#x4E0A;brain challenge&#x8FD9;&#x6B3E;&#x6E38;&#x620F;&#x5728;server&#x7AEF;&#x4F18;&#x5316;&#x7684;&#x65F6;&#x5019;&#x53C8;&#x51FA;&#x73B0;&#x4E86;&#x6BDB;&#x75C5;&#xFF0C;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x5927;&#x4E3A;&#x607C;&#x6012;&#xFF0C;&#x8BA4;&#x4E3A;&#x6280;&#x672F;&#x505A;&#x4E86;&#x5F88;&#x591A;&#x65E0;&#x7528;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x60F3;&#x627E;&#x8D23;&#x4EFB;&#x4EBA;&#xFF0C;&#x8868;&#x9762;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x719F;&#x4E0D;&#x77E5;&#xFF0C;&#x516C;&#x53F8;&#x8FD9;&#x65F6;&#x5019;&#x538B;&#x529B;&#x5DF2;&#x7ECF;&#x6765;&#x4E86;&#xFF0C;&#x8D44;&#x91D1;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x8FD9;&#x6837;&#x8FC7;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x5927;&#x5BB6;&#x4E5F;&#x6CA1;&#x6709;&#x592A;&#x5728;&#x610F;&#xFF0C;&#x5DE5;&#x4F5C;&#x8FD8;&#x662F;&#x6B63;&#x5E38;&#x8FDB;&#x884C;&#xFF0C;&#x76F4;&#x5230;&#x6709;&#x4E00;&#x5929;&#xFF0C;&#x8001;&#x677F;&#x4E00;&#x5C01;&#x90AE;&#x4EF6;&#xFF0C;&#x6253;&#x7834;&#x4E86;&#x5E73;&#x9759;&#xFF1A;&#x4E3A;&#x4E86;&#x516C;&#x53F8;&#x7684;&#x6B63;&#x5E38;&#x8FD0;&#x4F5C;&#xFF0C;&#x4ECA;&#x5E74;&#x7684;&#x5B63;&#x5EA6;&#x5956;&#x91D1;&#x548C;&#x5E74;&#x7EC8;&#x5956;&#x90FD;&#x5C06;&#x5EF6;&#x8FDF;&#x53D1;&#x653E;&#xFF0C;&#x8FD9;&#x53EF;&#x662F;&#x5927;&#x5BB6;&#x4E00;&#x5E74;&#x7684;&#x671F;&#x76FC;&#xFF0C;&#x8BA4;&#x771F;&#x5DE5;&#x4F5C;&#x8F9B;&#x82E6;&#x4E86;&#x6574;&#x5E74;&#xFF0C;&#x90FD;&#x5E0C;&#x671B;&#x8FC7;&#x5E74;&#x6709;&#x4E9B;&#x6536;&#x83B7;&#xFF0C;&#x77E5;&#x9053;&#x6709;&#x591A;&#x5C11;&#x4EBA;&#x662F;&#x51C6;&#x5907;&#x7740;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x6708;&#x5DE5;&#x8D44;&#x548C;&#x5E74;&#x7EC8;&#x5956;&#x56DE;&#x5BB6;&#x8FC7;&#x5E74;&#x7684;&#x4E48;&#xFF1B;&#x56FD;&#x5185;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x90FD;&#x662F;3&#x4E2A;&#x6708;&#x4EE5;&#x540E;&#xFF0C;&#x95EE;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x65F6;&#x5019;&#x6CA1;&#x6709;&#xFF0C;&#x8FD9;&#x4F1A;&#x4E0D;&#x514D;&#x6709;&#x4E9B;&#x5C34;&#x5C2C;&#x3002;&#x5B63;&#x5EA6;&#x5956;&#x4E5F;&#x662F;&#xFF0C;&#x5F53;&#x5927;&#x5BB6;&#x671F;&#x5F85;&#x5DF2;&#x4E45;&#xFF0C;&#x800C;&#x4E14;&#x770B;&#x6536;&#x5165;&#x66F2;&#x7EBF;&#x90FD;&#x8FD8;&#x826F;&#x597D;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5FFD;&#x7136;&#x4E2D;&#x6B62;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5F81;&#x7167;&#xFF0C;&#x8FD9;&#x6837;&#x8FD8;&#x662F;&#x5F88;&#x4F24;&#x5927;&#x5BB6;&#x7684;&#x5FC3;&#x3002;&#x6BD5;&#x7ADF;&#xFF0C;&#x5E74;&#x5E95;&#x53D1;&#x653E;&#x5956;&#x91D1;&#x662F;&#x5BF9;&#x5927;&#x5BB6;&#x7684;&#x4E00;&#x4EFD;&#x627F;&#x8BFA;&#xFF0C;&#x867D;&#x7136;&#x90AE;&#x4EF6;&#x4E0A;&#x8BF4;&#x660E;&#x4E86;&#x516C;&#x53F8;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4F46;&#x662F;&#x4E14;&#x4E0D;&#x8BBA;&#x771F;&#x5047;&#xFF0C;&#x4F01;&#x4E1A;&#x7684;&#x76C8;&#x5229;&#x4E0D;&#x5E94;&#x8BE5;&#x662F;&#x9AD8;&#x5C42;&#x9886;&#x5BFC;&#x8003;&#x8651;&#x7684;&#x95EE;&#x9898;&#x5417;&#x3002;</p>
<p>&#x53D1;&#x751F;&#x8FD9;&#x4EF6;&#x4E8B;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x8336;&#x4F59;&#x996D;&#x540E;&#x90FD;&#x6709;&#x5F88;&#x591A;&#x62A5;&#x6028;&#xFF0C;&#x5927;&#x5BB6;&#x5DE5;&#x4F5C;&#x4E5F;&#x6CA1;&#x6709;&#x4EE5;&#x4F4F;&#x90A3;&#x79EF;&#x6781;&#xFF0C;&#x90FD;&#x7EB7;&#x7EB7;&#x63D0;&#x524D;&#x5F00;&#x59CB;&#x4E86;&#x627E;&#x5DE5;&#x4F5C;&#x7684;&#x8BA1;&#x5212;&#xFF0C;&#x800C;&#x6211;&#x5728;&#x8FD9;&#x4EF6;&#x4E8B;&#x4E2D;&#xFF0C;&#x542C;&#x4E86;&#x592A;&#x591A;&#x7684;&#x95F2;&#x8A00;&#x95F2;&#x8BED;&#xFF0C;&#x4E5F;&#x770B;&#x5230;&#x516C;&#x53F8;&#x5728;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x6240;&#x4F5C;&#x6240;&#x4E3A;&#xFF0C;&#x5BFC;&#x81F4;&#x5FC3;&#x6001;&#x4E5F;&#x6709;&#x4E9B;&#x5931;&#x8861;&#xFF0C;&#x4E5F;&#x62B1;&#x6028;&#x8FC7;&#xFF0C;&#x5931;&#x671B;&#x8FC7;&#x3002;&#x53EF;&#x662F;&#x56DE;&#x8FC7;&#x5934;&#x6765;&#x60F3;&#x60F3;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x65F6;&#x77E5;&#x9053;&#x5E74;&#x5E95;&#x6CA1;&#x6709;&#x5956;&#x91D1;&#xFF0C;&#x8FD8;&#x4F1A;&#x6765;&#x8FD9;&#x91CC;&#x5417;&#xFF0C;&#x6211;&#x60F3;&#x6211;&#x7684;&#x9009;&#x62E9;&#x8FD8;&#x662F;&#x4F1A;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x672A;&#x77E5;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x662F;&#x60F3;&#x53BB;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#x3002;&#x65B0;&#x52A0;&#x5761;&#x4E5F;&#x6CA1;&#x6709;&#x8BA9;&#x5931;&#x671B;&#xFF0C;&#x9664;&#x4E86;&#x5DE5;&#x4F5C;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x8FD8;&#x5B66;&#x5230;&#x4E86;&#x5305;&#x5BB9;&#xFF0C;&#x5B66;&#x5230;&#x4E86;&#x597D;&#x7684;&#x793E;&#x4F1A;&#x57FA;&#x7840;&#x662F;&#x591A;&#x4E48;&#x91CD;&#x8981;&#xFF0C;&#x5927;&#x5BB6;&#x624D;&#x80FD;&#x4E95;&#x4E95;&#x6709;&#x6761;&#xFF0C;&#x5949;&#x516C;&#x5B88;&#x6CD5;&#x3002;&#x6CA1;&#x6709;&#x5956;&#x91D1;&#x4E0D;&#x662F;&#x4E0D;&#x80FD;&#x6D3B;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x53EA;&#x4E3A;&#x4E86;&#x773C;&#x524D;&#x8FD9;&#x70B9;&#x5C0F;&#x94B1;&#x4E0D;&#x662F;&#x5417;&#xFF0C;&#x4EE5;&#x540E;&#x7684;&#x8DEF;&#x8FD8;&#x957F;&#x7740;&#x5462;&#x3002;&#x5728;&#x5DE5;&#x4F5C;&#x4E0A;&#x4E5F;&#x5B66;&#x4E60;&#x5230;&#x4E0D;&#x5C11;&#xFF0C;&#x81EA;&#x5DF1;&#x4ECE;&#x4E00;&#x4E2A;&#x505A;&#x4E8B;&#x60C5;&#x90FD;&#x6709;&#x4E9B;&#x5C0F;&#x80C6;&#x602F;&#x7684;&#x9886;&#x5BFC;&#xFF0C;&#x73B0;&#x5728;&#x4E5F;&#x80FD;&#x591F;&#x6709;&#x6761;&#x4E0D;&#x7A33;&#x7684;&#x5E26;&#x9886;&#x5927;&#x5BB6;&#x8FDB;&#x6B65;&#xFF0C;&#x4ECE;&#x800C;&#x5F97;&#x5230;&#x5927;&#x5BB6;&#x7684;&#x8BA4;&#x53EF;&#xFF0C;&#x8FD9;&#x662F;&#x91D1;&#x94B1;&#x4E70;&#x4E0D;&#x5230;&#x7684;&#xFF0C;&#x5F53;&#x7136;&#x8FD8;&#x8981;&#x4E0D;&#x65AD;&#x8FDB;&#x6B65;&#x3002;&#x522B;&#x4EBA;&#x7684;&#x60C5;&#x7EEA;&#x4E0D;&#x80FD;&#x5F71;&#x54CD;&#x4E86;&#x81EA;&#x5DF1;&#xFF0C;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x90FD;&#x8981;&#x505A;&#x597D;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6536;&#x62FE;&#x597D;&#x5FC3;&#x60C5;&#xFF0C;&#x91CD;&#x65B0;&#x4E0A;&#x8DEF;&#x624D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x3002;&#x51B5;&#x4E14;&#x56FD;&#x5185;&#x72B6;&#x51B5;&#x4E5F;&#x4E0D;&#x592A;&#x597D;&#xFF0C;&#x542C;&#x5230;&#x592A;&#x591A;&#x7684;&#x4F01;&#x4E1A;&#x5012;&#x95ED;&#xFF0C;&#x53D1;&#x4E0D;&#x51FA;&#x6765;&#x5DE5;&#x8D44;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x4E0A;&#x5348;&#x89E3;bug,&#x4E0B;&#x5348;&#x88AB;&#x901A;&#x77E5;&#x88C1;&#x5458;&#x7684;&#xFF0C;&#x8DDF;&#x8FD9;&#x4E2A;&#x4E00;&#x6BD4;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x975E;&#x5E38;&#x597D;&#x4E86;&#xFF0C;&#x81F3;&#x4E8E;&#x66F4;&#x597D;&#x7684;&#x4F01;&#x4E1A;&#xFF0C;&#x4EE5;&#x540E;&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x53BB;&#x7684;&#x3002;&#x5BB6;&#x91CC;&#x4EBA;&#x662F;&#x4F1A;&#x7406;&#x89E3;&#x7684;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x8FD8;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x5FC3;&#x6001;&#x8981;&#x597D;&#xFF0C;&#x4E0D;&#x7BA1;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x81EA;&#x5DF1;&#x4E0D;&#x80FD;&#x8BA9;&#x81EA;&#x5DF1;&#x5931;&#x671B;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x522B;&#x4EBA;&#x7684;&#x773C;&#x5149;&#xFF0C;&#x4EBA;&#x751F;&#x7684;&#x8D77;&#x8D77;&#x843D;&#x843D;&#x4E0D;&#x5FC5;&#x592A;&#x5728;&#x610F;&#x3002;</p>
<p>&#x53EA;&#x9700;&#x8981;&#x8BB0;&#x4F4F;&#xFF0C;&#x4EFB;&#x4F55;&#x4E8B;&#x90FD;&#x4F1A;&#x8FC7;&#x53BB;&#x7684;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x6210;&#x4E3A;&#x6700;&#x597D;&#x7684;&#x81EA;&#x5DF1;&#xFF0C;&#x4E0D;&#x8981;&#x6210;&#x4E3A;&#x6700;&#x8BA8;&#x538C;&#x7684;&#x81EA;&#x5DF1;&#x3002;</p>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://stareme.wang/2018/07/12/人生总有一些不期而遇/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="stareme">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/uploads/me.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="做另一面的自己">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="做另一面的自己" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2018/07/12/人生总有一些不期而遇/" itemprop="url">
                  人生总有一些期而遇
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2018-07-12T00:06:57+08:00">
                2018-07-12
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
              <span class="post-meta-divider">|</span>
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/新加坡/" itemprop="url" rel="index">
                    <span itemprop="name">新加坡</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <a href="/2018/07/12/人生总有一些不期而遇/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2018/07/12/人生总有一些不期而遇/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x4ECA;&#x5929;&#x662F;2018.7.11&#xFF0C;2018&#x5DF2;&#x7ECF;&#x8FC7;&#x4E86;&#x4E24;&#x4E2A;&#x5B63;&#x5EA6;&#xFF0C;&#x53C8;&#x662F;&#x4E00;&#x4E2A;&#x5B63;&#x5EA6;&#x4E00;&#x6B21;&#x7684;&#x8001;&#x677F;&#x6D17;&#x8111;&#x65E5;&#x5B50;&#xFF0C;&#x53BB;&#x5E74;&#x539F;&#x5B9A;&#x7684;&#x8BA1;&#x5212;&#x505A;&#x5168;&#x5C4F;&#x6E38;&#x620F;&#x548C;&#x76F4;&#x64AD;&#x7ED3;&#x5408;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6162;&#x6162;&#x7684;&#x88AB;&#x63A8;&#x7FFB;&#x4E86;&#xFF1B;&#x8981;&#x505A;&#x5404;&#x4E2A;&#x5730;&#x533A;&#x7684;loops&#x8BA1;&#x5212;&#x4E5F;&#x88AB;&#x63A8;&#x7FFB;&#x4E86;&#x3002;&#x4F3C;&#x4E4E;&#x53C8;&#x56DE;&#x5230;&#x53BB;&#x5E74;&#x7684;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x91CD;&#x5934;&#x5F00;&#x53D1;&#xFF0C;&#x5168;&#x90E8;&#x4E13;&#x6CE8;&#x4E8E;&#x963F;&#x62C9;&#x4F2F;&#x5E02;&#x573A;&#xFF0C;&#x8FD9;&#x624D;&#x51E0;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x8001;&#x677F;&#x7684;&#x5FC3;&#x7406;&#x53D1;&#x751F;&#x4E86;&#x8FD9;&#x4E48;&#x5927;&#x7684;&#x53D8;&#x5316;&#x3002;&#x539F;&#x5B9A;&#x7684;&#x5728;&#x5E74;&#x5E95;&#x5728;&#x65B0;&#x52A0;&#x5761;&#x4E0A;&#x5E02;&#xFF0C;&#x73B0;&#x5728;&#x53C8;&#x53D8;&#x6210;&#x4E86;&#x660E;&#x5E74;&#x4E2D;&#x65EC;&#x53BB;&#x9999;&#x6E2F;&#x521B;&#x4E1A;&#x677F;&#x4E0A;&#x5E02;&#x7684;&#x8BA1;&#x5212;&#xFF0C;&#x8FD9;&#x53C8;&#x662F;&#x8001;&#x677F;&#x65B0;&#x753B;&#x7684;&#x4E00;&#x4E2A;&#x5927;&#x997C;&#x5417;&#xFF1F;&#x5728;&#x60C5;&#x7406;&#x4E0A;&#x6240;&#x6709;&#x7684;&#x5C1D;&#x8BD5;&#x548C;&#x53D8;&#x5316;&#x90FD;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x4F46;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x8001;&#x677F;&#x5728;&#x4E3B;&#x5BFC;&#x8005;&#x672A;&#x6765;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x5982;&#x679C;&#x4F60;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x60F3;&#x6CD5;&#x7684;&#x4EBA;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x81EA;&#x5DF1;&#x5F53;&#x8001;&#x677F;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x7684;&#x72B6;&#x6001;&#x5C31;&#x53EA;&#x80FD;&#x662F;&#x914D;&#x5408;&#x8001;&#x677F;&#xFF0C;&#x505A;&#x597D;&#x81EA;&#x5DF1;&#x7684;&#x672C;&#x804C;&#x5DE5;&#x4F5C;&#xFF0C;&#x52AA;&#x529B;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#xFF0C;&#x4E0D;&#x8D1F;&#x8FD9;&#x5C81;&#x6708;&#x3002;</p>
<p>&#x5DE5;&#x4F5C;&#x4E0A;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x63A5;&#x89E6;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#xFF0C;&#x4E86;&#x89E3;&#x4E86;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#x4EBA;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x5927;&#x5BB6;&#x5FC3;&#x91CC;&#x90FD;&#x6253;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x5C0F;&#x7B97;&#x76D8;&#xFF0C;&#x6709;&#x7684;&#x4EBA;&#x60F3;&#x8DF3;&#x69FD;&#xFF0C;&#x6709;&#x7684;&#x4EBA;&#x60F3;&#x8FC7;&#x4E9B;&#x65F6;&#x5019;&#x8DF3;&#x69FD;&#x3002;&#x539F;&#x56E0;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x6709;&#x56E0;&#x4E3A;&#x4E0D;&#x6EE1;&#x610F;&#x5DE5;&#x8D44;&#x7684;&#xFF0C;&#x6709;&#x4E9B;&#x4E0D;&#x6EE1;&#x610F;cto&#x7684;&#x505A;&#x6CD5;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x56E2;&#x961F;&#xFF0C;cto&#x8FD8;&#x662F;&#x7ED9;&#x4E86;&#x6211;&#x4EEC;&#x5F88;&#x9AD8;&#x7684;&#x8BC4;&#x4EF7;&#xFF0C;&#x8FD9;&#x70B9;&#x5BF9;&#x81EA;&#x5DF1;&#x548C;&#x56E2;&#x961F;&#x8FD8;&#x662F;&#x975E;&#x5E38;&#x6EE1;&#x610F;&#x7684;&#xFF0C;cto&#x4E5F;&#x5151;&#x73B0;&#x4E86;&#x66FE;&#x7ECF;&#x7B54;&#x5E94;&#x7ED9;&#x6211;&#x7684;&#x671F;&#x6743;&#xFF0C;&#x4E5F;&#x7B97;&#x662F;&#x5229;&#x76CA;&#x548C;&#x516C;&#x53F8;&#x7ED1;&#x5728;&#x4E86;&#x4E00;&#x8D77;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x77E5;&#x9053;&#x4F55;&#x65F6;&#x624D;&#x80FD;&#x5151;&#x73B0;&#xFF0C;&#x5FC3;&#x91CC;&#x8FD8;&#x662F;&#x975E;&#x5E38;&#x611F;&#x6069;cto&#x548C;&#x516C;&#x53F8;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x8FD8;&#x662F;&#x8981;&#x9075;&#x4ECE;&#x81EA;&#x5DF1;&#x7684;&#x5185;&#x5FC3;&#xFF0C;&#x4E0D;&#x80FD;&#x5728;&#x80CC;&#x540E;&#x5BF9;&#x522B;&#x4EBA;&#x7684;&#x505A;&#x6CD5;&#x5984;&#x52A0;&#x8BC4;&#x8BBA;&#xFF0C;&#x4EFB;&#x4F55;&#x6D41;&#x7A0B;&#x6267;&#x884C;&#x4E0B;&#x6765;&#x5BF9;&#x56E2;&#x961F;&#x7684;&#x5E2E;&#x52A9;&#x90FD;&#x662F;&#x5F88;&#x5927;&#x7684;&#xFF0C;&#x5C31;&#x7B97;&#x524D;&#x671F;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x9002;&#x5E94;&#xFF0C;&#x90A3;&#x4E5F;&#x4E0D;&#x80FD;&#x62B1;&#x6028;&#xFF0C;&#x6765;&#x65E5;&#x65B9;&#x957F;&#xFF0C;&#x65F6;&#x95F4;&#x4F1A;&#x68C0;&#x9A8C;&#x7ED3;&#x679C;&#x7684;&#x3002;&#x518D;&#x8005;&#x4E0D;&#x65AD;&#x544A;&#x8BC9;&#x81EA;&#x5DF1;&#x4E0D;&#x80FD;&#x53D7;&#x5230;&#x522B;&#x4EBA;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x4EE5;&#x6D88;&#x6781;&#x7684;&#x5FC3;&#x6001;&#x53BB;&#x5F71;&#x54CD;&#x522B;&#x4EBA;&#x3002;</p>
<p>&#x6700;&#x8FD1;&#x96F6;&#x96F6;&#x6563;&#x6563;&#x770B;&#x4E86;&#x5F88;&#x591A;&#x516C;&#x4F17;&#x53F7;&#x548C;&#x65B0;&#x95FB;&#xFF0C;&#x4F46;&#x662F;&#x611F;&#x89C9;&#x603B;&#x7ED3;&#x7684;&#x4E0D;&#x591F;&#xFF0C;&#x56DE;&#x5934;&#x60F3;&#x60F3;&#xFF0C;&#x8FD8;&#x662F;&#x8981;&#x82B1;&#x7CBE;&#x529B;&#x505A;&#x597D;&#x671F;&#x4E2D;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x8981;&#x8BFB;&#x5C31;&#x8981;&#x7CBE;&#x8BFB;&#x548C;&#x7CBE;&#x529B;&#x96C6;&#x4E2D;&#x5728;&#x4E00;&#x70B9;&#x4E0A;&#xFF0C;&#x591A;&#x603B;&#x7ED3;&#xFF0C;&#x4E0D;&#x7136;&#x65F6;&#x95F4;&#x5C31;&#x4F1A;&#x4E0D;&#x77E5;&#x9053;&#x4E0D;&#x89C9;&#x6084;&#x7136;&#x6D41;&#x901D;&#x3002;&#x90FD;&#x8BF4;22&#x5230;30&#x5C81;&#xFF0C;&#x662F;&#x4EBA;&#x751F;&#x6700;&#x8270;&#x96BE;&#x7684;&#x51E0;&#x5E74;&#xFF0C;&#x4EC0;&#x4E48;&#x4E8B;&#x90FD;&#x8981;&#x5C1D;&#x8BD5;&#xFF0C;&#x4F46;&#x53C8;&#x4E0D;&#x80FD;&#x770B;&#x5230;&#x4E8B;&#x60C5;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x5728;&#x6211;&#x8FD9;&#x4E2A;&#x4EBA;&#x751F;&#x7684;&#x5173;&#x952E;&#x70B9;&#xFF0C;&#x5374;&#x53D1;&#x751F;&#x7740;&#x5F88;&#x6211;&#x591A;&#x6211;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x5DE5;&#x4F5C;&#x4E0A;&#x8FD8;&#x662F;&#x751F;&#x6D3B;&#x4E0A;&#xFF0C;&#x6216;&#x8BB8;&#x4EBA;&#x751F;&#x603B;&#x6709;&#x4E00;&#x4E9B;&#x4E0D;&#x671F;&#x800C;&#x9047;&#xFF0C;&#x8BA9;&#x6211;&#x6709;&#x4E9B;&#x60F6;&#x6050;&#xFF0C;&#x53C8;&#x6709;&#x4E9B;&#x5E86;&#x5E78;&#x3002;&#x5373;&#x7136;&#x8BE5;&#x53D1;&#x751F;&#x7684;&#x5DF2;&#x7ECF;&#x53D1;&#x751F;&#xFF0C;&#x6211;&#x5C31;&#x4E0D;&#x5E94;&#x8BE5;&#x754F;&#x60E7;&#xFF0C;&#x5E94;&#x8BE5;&#x5766;&#x7136;&#x9762;&#x5BF9;&#xFF0C;&#x867D;&#x7136;&#x53EF;&#x80FD;&#x8D70;&#x7684;&#x662F;&#x5C11;&#x6709;&#x4EBA;&#x8D70;&#x7684;&#x8DEF;&#xFF0C;&#x4F46;&#x662F;&#x9047;&#x4E0A;&#x4E86;&#x5C31;&#x8981;&#x8BA4;&#x771F;&#x5BF9;&#x5F85;&#x3002;&#x6B63;&#x5982;&#x8001;&#x7F57;&#x6240;&#x8BF4;&#xFF1A;&#x201C;&#x6211;&#x4E0D;&#x5728;&#x4E4E;&#x8F93;&#x8D62;&#xFF0C;&#x6211;&#x5C31;&#x662F;&#x8BA4;&#x771F;&#x201D;&#x3002;&#x4E0D;&#x7BA1;&#x5C06;&#x6765;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF0C;&#x5F88;&#x611F;&#x8C22;&#x8001;&#x5929;&#x8BA9;&#x6211;&#x7ECF;&#x5386;&#x8FD9;&#x4E00;&#x5207;&#x3002;</p>
<p>&#x4ECE;&#x6B64;&#x4EE5;&#x540E;&#x505A;&#x4E00;&#x4E2A;&#x81EA;&#x5F8B;&#x7684;&#x4EBA;&#x3002;&#x4ECE;&#x5F6D;&#x4E8E;&#x5BB4;&#x7684;&#x4EBA;&#x751F;&#x7ECF;&#x5386;&#x4E2D;&#x53EF;&#x4EE5;&#x4E86;&#x89E3;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x4E09;&#x6D41;&#x660E;&#x661F;&#x6210;&#x957F;&#x4E3A;&#x4E00;&#x7EBF;&#x660E;&#x661F;&#xFF0C;&#x4E0D;&#x53EF;&#x8C13;&#x4E0D;&#x52B1;&#x5FD7;&#xFF0C;&#x4ED6;&#x73B0;&#x5728;&#x6536;&#x83B7;&#x7684;&#x4E00;&#x5207;&#x4E00;&#x5207;&#xFF0C;&#x90FD;&#x6E90;&#x81EA;&#x4E8E;&#x4ED6;&#x7684;&#x81EA;&#x5F8B;&#x3002;&#x770B;&#x5230;&#x8FD9;&#xFF0C;&#x611F;&#x52A8;&#x8FD8;&#x662F;&#x5F88;&#x6DF1;&#x7684;&#xFF0C;&#x4F18;&#x79C0;&#x7684;&#x4EBA;&#x4E0D;&#x4E00;&#x5B9A;&#x81EA;&#x5F8B;&#xFF0C;&#x4F46;&#x662F;&#x81EA;&#x5F8B;&#x7684;&#x4EBA;&#x5F88;&#x96BE;&#x4E0D;&#x4F18;&#x79C0;&#x3002;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x8FD9;&#x79CD;&#x4ECE;&#x6765;&#x90FD;&#x53EA;&#x80FD;&#x9760;&#x81EA;&#x5DF1;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x4EBA;&#x751F;&#x53EA;&#x80FD;&#x52E4;&#x594B;&#x548C;&#x81EA;&#x5F8B;&#x3002;&#x5982;&#x679C;&#x4EBA;&#x751F;&#x53EA;&#x6709;&#x4E00;&#x6B21;&#x8BA9;&#x4F60;&#x7FFB;&#x8EAB;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x5B9A;&#x8981;&#x62FC;&#x547D;&#x6293;&#x4F4F;&#x5B83;&#x3002;</p>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://stareme.wang/2018/03/01/时而忧伤/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="stareme">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/uploads/me.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="做另一面的自己">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="做另一面的自己" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2018/03/01/时而忧伤/" itemprop="url">
                  有时候会有一些莫明的忧伤
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2018-03-01T23:21:57+08:00">
                2018-03-01
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
              <span class="post-meta-divider">|</span>
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/新加坡/" itemprop="url" rel="index">
                    <span itemprop="name">新加坡</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <a href="/2018/03/01/时而忧伤/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2018/03/01/时而忧伤/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x4ECA;&#x5929;&#x662F;2018&#x5E74;3&#x6708;1&#x65E5;&#xFF0C;&#x8DDD;&#x79BB;&#x4E0A;&#x6B21;&#x66F4;&#x65B0;&#x65E5;&#x8BB0;&#x5DF2;&#x7ECF;&#x6709;6&#x4E2A;&#x6708;&#x4E4B;&#x4E45;&#xFF0C;&#x66FE;&#x7ECF;&#x6709;&#x597D;&#x51E0;&#x6B21;&#x60F3;&#x66F4;&#x65B0;&#xFF0C;&#x4F46;&#x662F;&#x603B;&#x603B;&#x501F;&#x53E3;&#x90FD;&#x6CA1;&#x6709;&#x53BB;&#x505A;&#x3002;&#x8FC7;&#x5E74;&#x56DE;&#x5BB6;&#x611F;&#x89E6;&#x5F88;&#x5927;&#xFF0C;&#x6765;&#x4E86;&#x4E4B;&#x540E;&#x53C8;&#x4E0D;&#x592A;&#x60F3;&#x4E0A;&#x73ED;&#xFF0C;&#x60F3;&#x56DE;&#x5BB6;&#xFF0C;&#x6240;&#x4EE5;&#x662F;&#x65F6;&#x5019;&#x66F4;&#x65B0;&#x4E0B;&#x4EE5;&#x6170;&#x6211;&#x5FC3;&#x3002;</p>
<p>&#x56DE;&#x987E;&#x81EA;&#x5DF1;&#x53BB;&#x5E74;&#x4E0B;&#x534A;&#x5E74;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x5927;&#x90E8;&#x5206;&#x7ECF;&#x5386;&#x90FD;&#x662F;&#x57CB;&#x5728;&#x4E86;&#x5DE5;&#x4F5C;&#x4E0A;&#xFF0C;&#x81EA;&#x5DF1;&#x5E73;&#x65F6;&#x4E5F;&#x575A;&#x6301;&#x953B;&#x70BC;&#x8EAB;&#x4F53;&#xFF0C;&#x6240;&#x4EE5;&#x8EAB;&#x4F53;&#x548C;&#x5DE5;&#x4F5C;&#x80FD;&#x529B;&#x4E0A;&#x90FD;&#x6709;&#x5F88;&#x5927;&#x7684;&#x8FDB;&#x6B65;&#xFF0C;&#x5C24;&#x5176;&#x81EA;&#x5DF1;&#x88AB;&#x63D0;&#x5347;&#x4E3A;android&#x7AEF;leader&#xFF0C;&#x7BA1;&#x7406;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x65F6;&#xFF0C;&#x4E0D;&#x4EC5;&#x8981;&#x81EA;&#x5DF1;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x5B8C;&#x6210;&#x624B;&#x5934;&#x4E0A;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x8FD8;&#x8981;&#x7763;&#x4FC3;&#x5176;&#x5B83;&#x540C;&#x4E8B;&#x505A;&#x597D;&#x76F8;&#x5E94;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5728;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#x65F6;&#x968F;&#x65F6;&#x53BB;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x4FDD;&#x8BC1;&#x4EA7;&#x54C1;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x3002;&#x4ED8;&#x51FA;&#x8FD8;&#x662F;&#x6709;&#x56DE;&#x62A5;&#x7684;&#xFF0C;&#x7B2C;&#x56DB;&#x5B63;&#x5EA6;&#x7ECF;&#x8FC7;&#x5168;&#x7EC4;&#x7684;&#x52AA;&#x529B;&#xFF0C;&#x83B7;&#x5F97;&#x4E86;cto&#x7684;&#x9AD8;&#x5EA6;&#x8868;&#x626C;&#xFF0C;&#x81EA;&#x5DF1;&#x4E5F;&#x6210;&#x4E86;&#x516C;&#x53F8;&#x7684;super star,&#x52B3;&#x52A8;&#x6977;&#x6A21;&#x3002;&#x5728;&#x548C;&#x540C;&#x4E8B;&#x5408;&#x4F5C;&#x671F;&#x95F4;&#xFF0C;&#x7EC4;&#x5458;&#x5DE5;&#x4F5C;&#x90FD;&#x80FD;&#x6309;&#x8D28;&#x91CF;&#x5B8C;&#x6210;&#xFF0C;&#x4E5F;&#x5408;&#x4F5C;&#x975E;&#x5E38;&#x6109;&#x5FEB;&#xFF0C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x77DB;&#x76FE;&#x3002;&#x65B0;&#x7684;&#x4E00;&#x5E74;&#x5230;&#x6765;&#xFF0C;&#x7EC4;&#x5458;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x53EF;&#x80FD;&#x8981;&#x79BB;&#x5F00;&#xFF0C;&#x66FE;&#x7ECF;&#x5185;&#x5FC3;&#x6709;&#x4E00;&#x4E9B;&#x5C0F;&#x60F6;&#x6050;&#xFF0C;&#x60F6;&#x6050;&#x662F;&#x4E0D;&#x662F;&#x4E4B;&#x524D;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x884C;&#x4E3A;&#x8BA9;&#x4ED6;&#x4EEC;&#x4E0D;&#x723D;&#x4E86;&#xFF1B;&#x60F6;&#x6050;&#x81EA;&#x5DF1;&#x4EE5;&#x540E;&#x8FD8;&#x80FD;&#x4E0D;&#x80FD;&#x6491;&#x8D77;&#x6574;&#x4E2A;&#x7EC4;&#x3002;&#x4F46;&#x662F;&#x540E;&#x9762;&#x60F3;&#x4E86;&#x60F3;&#xFF0C;&#x54EA;&#x4E2A;&#x9886;&#x5BFC;&#x4F1A;&#x4E0D;&#x7528;&#x7ECF;&#x5386;&#x81EA;&#x5DF1;&#x7EC4;&#x5458;&#x7684;&#x79BB;&#x5F00;&#x5462;&#xFF0C;&#x53EA;&#x80FD;&#x5E0C;&#x671B;&#x4ED6;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x524D;&#x7A0B;&#xFF0C;&#x6709;&#x5E78;&#x8DDF;&#x4ED6;&#x4EEC;&#x4E00;&#x8D77;&#x5171;&#x4E8B;&#x3002;&#x6000;&#x7740;&#x79EF;&#x6781;&#x7684;&#x5FC3;&#x6001;&#xFF0C;&#x4E0D;&#x591F;&#x4EBA;&#x4E86;&#x5C31;&#x79EF;&#x6781;&#x62DB;&#x4EBA;&#xFF0C;&#x7EE7;&#x7EED;&#x505A;&#x597D;&#x81EA;&#x5DF1;&#x7684;&#x672C;&#x804C;&#x5DE5;&#x4F5C;&#xFF0C;&#x5176;&#x5B83;&#x7684;&#x60F3;&#x591A;&#x4E86;&#x4E5F;&#x6CA1;&#x7528;&#x3002;</p>
<p>2017&#x5E74;&#x636E;&#x4E2A;&#x4EBA;&#x7EDF;&#x8BA1;&#x5230;&#x7684;&#x65F6;&#x95F4;&#x5927;&#x6982;<a href="http://note.youdao.com/noteshare?id=85992b40571643aa0215a9aa54992211" target="_blank" rel="external">250&#x4E2A;&#x5C0F;&#x65F6;</a>&#xFF0C;&#x5E0C;&#x671B;&#x65B0;&#x7684;&#x4E00;&#x5E74;&#x80FD;&#x4EE5;&#x66F4;&#x9AD8;&#x7684;&#x6548;&#x7387;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F18;&#x5316;&#x9879;&#x76EE;&#xFF0C;&#x63D0;&#x9AD8;&#x9879;&#x76EE;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#xFF0C;&#x66F4;&#x6D41;&#x7545;&#xFF0C;&#x7136;&#x540E;&#x6709;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x966A;&#x966A;&#x5BB6;&#x4EBA;&#x3002;</p>
<p>&#x5DE5;&#x4F5C;&#x65B9;&#x9762;&#x6BD4;&#x8F83;&#x9057;&#x61BE;&#x7684;&#x662F;&#x65E5;&#x6D3B;&#x8FD8;&#x53EA;&#x80FD;&#x7EF4;&#x8FDF;&#x5728;7-8w&#x7684;&#x6C34;&#x5E73;&#xFF0C;&#x8FDC;&#x8FDC;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x6211;&#x7684;&#x76EE;&#x6807;&#x3002;&#x82F1;&#x8BED;&#x6709;&#x4E00;&#x4E9B;&#x63D0;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#x4ECD;&#x7136;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x60F3;&#x8981;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x8981;&#x7EE7;&#x7EED;&#x52AA;&#x529B;&#x3002;</p>
<p>&#x8FC7;&#x5E74;&#x56DE;&#x5BB6;&#x8FD8;&#x662F;&#x5FD9;&#x788C;&#x7684;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x65B0;&#x623F;&#xFF0C;&#x7238;&#x5988;&#xFF0C;&#x8001;&#x5BB6;&#xFF0C;&#x4E08;&#x4EBA;&#x5BB6;&#x6765;&#x56DE;&#x8DD1;&#xFF0C;&#x7ED3;&#x4E86;&#x5A5A;&#x7684;&#x4EBA;&#x771F;&#x7684;&#x662F;&#x7D2F;&#x554A;&#x3002;&#x4E0D;&#x8FC7;&#x5BB6;&#x91CC;&#x4EBA;&#x5728;&#x4E00;&#x8D77;&#x8FD8;&#x662F;&#x975E;&#x5E38;&#x5F00;&#x5FC3;&#xFF0C;&#x6709;&#x8BF4;&#x4E0D;&#x5B8C;&#x7684;&#x8BDD;&#xFF0C;&#x6068;&#x4E0D;&#x5F97;&#x65F6;&#x95F4;&#x53EF;&#x4EE5;&#x8FC7;&#x7684;&#x6162;&#x4E00;&#x70B9;&#x3002;<br><img src="http://ojxhdwqig.bkt.clouddn.com/4138C7C4-7D4A-46F6-90A4-6CA42F1C36AB-553-0000002928D6359A_tmp.JPG" alt=""></p>
<p>&#x7136;&#x540E;&#x5976;&#x5976;70&#x5927;&#x5BFF;&#xFF0C;&#x7ED9;&#x5979;&#x4E70;&#x4E2A;&#x86CB;&#x7CD5;&#xFF0C;&#x5E0C;&#x671B;&#x5979;&#x8EAB;&#x4F53;&#x5065;&#x5EB7;&#xFF0C;&#x6211;&#x7684;&#x5C0F;&#x5F1F;&#x5C0F;&#x59B9;&#x4EEC;&#x8FD8;&#x7ED9;&#x5979;&#x505A;&#x4E86;&#x7279;&#x522B;&#x751F;&#x65E5;&#x793C;&#x7269;&#xFF0C;&#x5976;&#x5976;&#x7279;&#x522B;&#x5F00;&#x5FC3;&#x3002;<br><img src="http://ojxhdwqig.bkt.clouddn.com/IMG_0023.JPG" alt=""></p>
<p>&#x8FC7;&#x5E74;&#x56DE;&#x5BB6;&#x6536;&#x83B7;&#x6700;&#x5927;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x5976;&#x5976;&#x548C;&#x53D4;&#x53D4;&#x4EEC;&#x5927;&#x529B;&#x652F;&#x6301;&#x4E0B;&#x7684;&#x6211;&#x53BB;&#x627E;&#x751F;&#x6211;&#x7684;&#x4EB2;&#x5988;&#xFF0C;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x5766;&#x7136;&#x63A5;&#x53D7;&#x611F;&#x5230;&#x9A84;&#x50B2;&#xFF0C;&#x4E0D;&#x7BA1;&#x4E0A;&#x4E00;&#x8F88;&#x7684;&#x6069;&#x6069;&#x6028;&#x6028;&#xFF0C;&#x53BB;&#x770B;&#x5979;&#x662F;&#x6211;&#x5E94;&#x5C3D;&#x7684;&#x8D23;&#x4EFB;&#xFF0C;&#x8FD8;&#x597D;&#x5728;&#x6211;&#x53EF;&#x4EE5;&#x627F;&#x62C5;&#x7684;&#x5E74;&#x7EAA;&#x53BB;&#x8BA4;&#x8BC6;&#x4E86;&#x5979;&#x4EEC;&#xFF0C;&#x611F;&#x8C22;&#x8BA9;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x6709;&#x4E86;&#x5BF9;&#x4EB2;&#x5988;&#x7684;&#x671F;&#x5F85;&#x548C;&#x60F3;&#x8C61;&#xFF0C;&#x90A3;&#x8FB9;&#x7684;&#x59B9;&#x59B9;&#x5F1F;&#x5F1F;&#x4E5F;&#x8FDC;&#x6BD4;&#x6211;&#x60F3;&#x8C61;&#x7684;&#x61C2;&#x4E8B;&#xFF0C;&#x4E0A;&#x5929;&#x5F85;&#x6211;&#x4E0D;&#x8584;&#xFF0C;&#x4F59;&#x4E0B;&#x7684;&#x65E5;&#x5B50;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x4EB2;&#x54E5;&#x5173;&#x6CE8;&#x7740;&#x4F60;&#x4EEC;&#x7684;&#x6210;&#x957F;&#xFF0C;&#x76F8;&#x4FE1;&#x65F6;&#x95F4;&#x4F1A;&#x6162;&#x6162;&#x4EB2;&#x8FD1;&#x6211;&#x4EEC;&#x7684;&#x611F;&#x60C5;&#x3002;<br><img src="http://ojxhdwqig.bkt.clouddn.com/940BAAEE-23CE-423F-9751-C37056A1E9BD-4893-000002B5C5247241_tmp.JPG" alt=""></p>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://stareme.wang/2017/08/28/当亲人离你而去/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="stareme">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/uploads/me.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="做另一面的自己">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="做另一面的自己" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2017/08/28/当亲人离你而去/" itemprop="url">
                  当身边的人离你而去
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-08-28T23:23:49+08:00">
                2017-08-28
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
              <span class="post-meta-divider">|</span>
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/新加坡/" itemprop="url" rel="index">
                    <span itemprop="name">新加坡</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <a href="/2017/08/28/当亲人离你而去/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2017/08/28/当亲人离你而去/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x4ECA;&#x5929;&#x662F;2017&#x5E74;8&#x6708;28&#x53F7;&#xFF0C;&#x8FD9;&#x4E00;&#x5E74;&#x7684;&#x60C5;&#x4EBA;&#x8282;&#xFF0C;&#x548C;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#xFF0C;&#x5404;&#x79CD;&#x79C0;&#x6069;&#x7231;&#xFF0C;&#x4E00;&#x4E0D;&#x5C0F;&#x5FC3;&#x5C31;&#x8981;&#x88AB;&#x4E00;&#x6CE2;&#x6D12;&#x72D7;&#x7CAE;&#x7684;&#x8282;&#x594F;&#x3002;&#x8D8A;&#x662F;&#x8FD9;&#x79CD;&#x65F6;&#x5019;&#xFF0C;&#x5FC3;&#x91CC;&#x603B;&#x662F;&#x9690;&#x9690;&#x7EA6;&#x7EA6;&#x6709;&#x4E00;&#x4E9B;&#x4F24;&#x60B2;&#x3002;&#x4E3B;&#x8981;&#x662F;&#x6700;&#x8FD1;&#x4E24;&#x5E74;&#x8EAB;&#x8FB9;&#x7684;&#x4EB2;&#x4EBA;&#x4E0D;&#x77E5;&#x4E3A;&#x4F55;&#x603B;&#x662F;&#x5728;&#x6211;&#x89E6;&#x4E0D;&#x53CA;&#x9632;&#x7684;&#x65F6;&#x5019;&#x79BB;&#x6211;&#x800C;&#x53BB;&#x3002;</p>
<p>&#x6211;&#x592A;&#x516C;&#xFF0C;&#x738B;&#x5409;&#x5F6C;&#xFF0C;&#x751F;&#x4E8E;&#x4E00;&#x4E2A;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#x5E74;&#x4EE3;&#xFF0C;&#x6253;&#x4ECE;&#x8BB0;&#x4E8B;&#x8D77;&#xFF0C;&#x4ED6;&#x5C31;&#x9000;&#x4F11;&#x4E86;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD8;&#x80FD;&#x9886;&#x5DE5;&#x8D44;&#xFF0C;&#x5728;&#x4E61;&#x4E0B;&#x662F;&#x5F88;&#x591A;&#x540C;&#x9F84;&#x8001;&#x5934;&#x8001;&#x592A;&#x592A;&#x7FA1;&#x6155;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x4E0D;&#x8BBA;&#x522E;&#x98CE;&#x4E0B;&#x96E8;&#xFF0C;&#x6BCF;&#x5929;&#x4ED6;&#x90FD;&#x8981;&#x53BB;&#x8336;&#x574A;&#x91CC;&#x559D;&#x8336;&#x5520;&#x55D1;&#x6253;&#x724C;&#xFF0C;&#x4ECE;&#x4E0D;&#x95F4;&#x65AD;&#xFF0C;&#x5C0F;&#x65F6;&#x5019;&#x5728;&#x6211;&#x8BFB;&#x4E66;&#x4E4B;&#x524D;&#xFF0C;&#x6BCF;&#x5929;&#x4E5F;&#x662F;&#x8DDF;&#x7740;&#x4ED6;&#x53BB;&#x559D;&#x8336;&#xFF0C;&#x7ED9;&#x6211;&#x7684;&#x7AE5;&#x5E74;&#x589E;&#x6DFB;&#x4E86;&#x4E0D;&#x5C11;&#x4E50;&#x8DA3;&#xFF0C;&#x4E5F;&#x8DDF;&#x8001;&#x4EBA;&#x6709;&#x4E86;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x4EB2;&#x5BC6;&#x611F;&#x3002;&#x4ED6;&#x662F;&#x4E00;&#x4E2A;&#x8033;&#x6735;&#x7279;&#x522B;&#x80CC;&#x7684;&#x4EBA;&#xFF0C;&#x8033;&#x6735;&#x987A;&#x98CE;&#x7684;&#x65F6;&#x5019;&#x5F88;&#x654F;&#x611F;&#xFF0C;&#x4E0D;&#x987A;&#x98CE;&#x7684;&#x65F6;&#x5019;&#x5230;&#x4ED6;&#x8033;&#x6735;&#x8FB9;&#x5927;&#x58F0;&#x8BF4;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x542C;&#x5230;&#xFF0C;&#x6BCF;&#x6B21;&#x4ED6;&#x89C1;&#x5230;&#x964C;&#x751F;&#x4EBA;&#x7ED9;&#x4ED6;&#x793A;&#x610F;&#xFF0C;&#x4ED6;&#x90FD;&#x4F1A;&#x5148;&#x8BF4;&#x201C;&#x6211;&#x8033;&#x6735;&#x542C;&#x4E0D;&#x6E05;&#xFF0C;&#x4E0D;&#x8981;&#x89C1;&#x602A;&#x201D;&#xFF0C;&#x4E61;&#x91CC;&#x4EBA;&#x90FD;&#x6E05;&#x695A;&#x4ED6;&#xFF0C;&#x6240;&#x4EE5;&#x4EA4;&#x6D41;&#x4E5F;&#x4E0D;&#x5B58;&#x5728;&#x5927;&#x95EE;&#x9898;&#x3002;&#x4ED6;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x56FA;&#x6267;&#x7684;&#x4EBA;&#xFF0C;&#x81EA;&#x5DF1;&#x8BA4;&#x5B9A;&#x7684;&#x4E8B;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x4E5F;&#x4E0D;&#x60F3;&#x53BB;&#x6539;&#x53D8;&#xFF0C;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x5C0F;&#x65F6;&#x5019;&#x53EA;&#x8981;&#x4E00;&#x53D7;&#x5230;&#x6B3A;&#x8D1F;&#xFF0C;&#x4ED6;&#x5C31;&#x4E0D;&#x7BA1;&#x4E0D;&#x987E;&#x7684;&#x633A;&#x8EAB;&#x800C;&#x51FA;&#xFF0C;&#x5BF9;&#x6211;&#x7684;&#x8981;&#x6C42;&#x53EA;&#x8981;&#x80FD;&#x505A;&#x5230;&#x7684;&#x4ED6;&#x90FD;&#x4F1A;&#x7B54;&#x5E94;&#x6211;&#x3002;&#x5C31;&#x8FD9;&#x6837;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x4ED6;&#x8D8A;&#x6765;&#x8D8A;&#x8001;&#xFF0C;&#x6211;&#x8D8A;&#x957F;&#x8D8A;&#x5927;&#xFF0C;&#x6211;&#x5341;&#x516B;&#x5C81;&#x4E0A;&#x4E86;&#x5927;&#x5B66;&#x5F00;&#x59CB;&#xFF0C;&#x56DE;&#x5BB6;&#x7684;&#x65F6;&#x95F4;&#x5C31;&#x7279;&#x522B;&#x5C11;&#xFF0C;&#x5927;&#x5B66;&#x6BCF;&#x5230;&#x653E;&#x5047;&#xFF0C;&#x6211;&#x592A;&#x516C;&#x5C31;&#x901A;&#x8FC7;&#x6211;&#x5F1F;&#x95EE;&#x6211;&#x600E;&#x4E48;&#x8FD8;&#x4E0D;&#x56DE;&#x6765;&#x3002;&#x73B0;&#x5728;&#x7EC8;&#x4E8E;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x540E;&#x9762;&#x51E0;&#x5E74;&#xFF0C;&#x6211;&#x5DE5;&#x4F5C;&#x5728;&#x4E0A;&#x6D77;&#x7684;&#x65F6;&#x5019;&#x6211;&#x592A;&#x516C;&#x77E5;&#x9053;&#x6211;&#x8981;&#x56DE;&#x6765;&#xFF0C;&#x7ECF;&#x5E38;&#x5728;&#x719F;&#x6089;&#x7684;&#x5730;&#x65B9;&#x7B49;&#x5F85;&#x7740;&#x6211;&#x56DE;&#x6765;&#x3002;<br><img src="http://ojxhdwqig.bkt.clouddn.com/%E5%AE%B6%E4%BA%BAIMG_2904.JPG" alt=""></p>
<p>&#x6211;&#x4E5F;&#x53EA;&#x80FD;&#x5C3D;&#x91CF;&#x5728;&#x653E;&#x5047;&#x7684;&#x65F6;&#x5019;&#x56DE;&#x53BB;&#x770B;&#x4ED6;&#xFF0C;&#x522B;&#x4EBA;&#x653E;&#x5047;&#x90FD;&#x53BB;&#x65C5;&#x6E38;&#xFF0C;&#x800C;&#x6211;&#x662F;&#x5BB6;&#x91CC;&#x6709;&#x671F;&#x5F85;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x5FC5;&#x987B;&#x56DE;&#x5BB6;&#xFF0C;&#x8FD8;&#x597D;&#x5973;&#x670B;&#x53CB;&#x6CA1;&#x6709;&#x591A;&#x5C11;&#x610F;&#x89C1;&#xFF0C;&#x96BE;&#x4E3A;&#x4ED6;&#x4E86;&#x3002;&#x5DE5;&#x4F5C;&#x4E86;&#x51E0;&#x5E74;&#xFF0C;&#x6211;&#x592A;&#x516C;&#x8EAB;&#x4F53;&#x4E00;&#x76F4;&#x5F88;&#x597D;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x4E00;&#x76F4;&#x5728;&#x5916;&#x9762;&#x5B89;&#x5FC3;&#x5DE5;&#x4F5C;&#x7684;&#x57FA;&#x7840;&#x3002;&#x53EF;&#x662F;&#x4E0A;&#x5929;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x7684;&#x65E0;&#x60C5;&#xFF0C;&#x76F4;&#x5230;2015&#x5E74;&#xFF0C;&#x6709;&#x6B21;&#x56DE;&#x5BB6;&#x5446;&#x4E86;&#x51E0;&#x5929;&#x8D70;&#x7684;&#x65F6;&#x5019;&#x6211;&#x592A;&#x516C;&#x7A81;&#x7136;&#x5BF9;&#x6211;&#x8BF4;&#x201C;&#x8FC7;&#x5E74;&#x56DE;&#x6765;&#x5C31;&#x89C1;&#x4E0D;&#x5230;&#x592A;&#x516C;&#x4E86;&#x201D;&#x5F53;&#x65F6;&#x6211;&#x5185;&#x5FC3;&#x4E00;&#x6014;&#xFF0C;&#x60F3;&#x54ED;&#xFF0C;&#x4F46;&#x662F;&#x60F3;&#x5230;&#x6211;&#x592A;&#x516C;&#x5BF9;&#x81EA;&#x5DF1;&#x8FD9;&#x4E48;&#x6CA1;&#x4FE1;&#x5FC3;&#xFF0C;&#x5C31;&#x5B89;&#x6170;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x7136;&#x540E;&#x544A;&#x522B;&#x4E86;&#xFF0C;&#x53EF;&#x662F;&#x8C01;&#x80FD;&#x60F3;&#x5230;&#x8FD9;&#x6B21;&#x544A;&#x522B;&#x7ADF;&#x7136;&#x4F1A;&#x662F;&#x6C38;&#x522B;&#x2026;..&#x65F6;&#x95F4;&#x53D1;&#x751F;&#x5728;&#x90A3;&#x5E74;&#x5C0F;&#x5E74;&#x591C;&#x7684;&#x524D;&#x4E00;&#x4E2A;&#x665A;&#x4E0A;&#xFF0C;&#x4F60;&#x8D70;&#x4E86;&#xFF0C;&#x8D70;&#x7684;&#x90A3;&#x4E48;&#x5B89;&#x8BE6;&#xFF0C;&#x542C;&#x5230;&#x90A3;&#x4E2A;&#x6D88;&#x606F;&#xFF0C;&#x6211;&#x7B80;&#x76F4;&#x611F;&#x89C9;&#x5929;&#x90FD;&#x8981;&#x584C;&#x4E86;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x8FD9;&#x6837;&#xFF0C;&#x9A6C;&#x4E0A;&#x5C31;&#x8981;&#x8FC7;&#x5E74;&#xFF0C;&#x5C31;&#x80FD;&#x76F8;&#x89C1;&#x4E86;&#xFF0C;&#x53EF;&#x662F;&#x600E;&#x4E48;&#x4F1A;&#x8FD9;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x77E5;&#x9053;&#x4F1A;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x5C31;&#x4E0D;&#x5E94;&#x8BE5;&#x51FA;&#x53BB;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x5C31;&#x5E94;&#x8BE5;&#x7559;&#x5728;&#x8EAB;&#x966A;&#x7740;&#x4F60;&#x8D70;&#x5B8C;&#x8FD9;&#x6700;&#x540E;&#x7684;&#x4E00;&#x7A0B;&#x3002;&#x4F60;&#x7684;&#x65E0;&#x79C1;&#x5949;&#x732E;&#x6210;&#x5C31;&#x4E86;&#x4ECA;&#x5929;&#x7684;&#x6211;&#xFF0C;&#x6211;&#x5982;&#x613F;&#x8D70;&#x51FA;&#x56FD;&#x95E8;&#xFF0C;&#x53EF;&#x662F;&#x5374;&#x518D;&#x4E5F;&#x89C1;&#x4E0D;&#x5230;&#x4F60;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x662F;&#x4F60;&#x4E00;&#x76F4;&#x9ED8;&#x9ED8;&#x7684;&#x5B88;&#x62A4;&#x7740;&#x6211;&#xFF0C;&#x4F60;&#x6C38;&#x8FDC;&#x662F;&#x6211;&#x6700;&#x656C;&#x7231;&#x7684;&#x4EBA;&#x3002;<br><img src="http://ojxhdwqig.bkt.clouddn.com/%E5%AE%B6%E4%BA%BAIMG_2464.JPG" alt=""></p>
<p>&#x5BCC;&#x54E5;&#xFF0C;2012&#x5E74;&#x521A;&#x51FA;&#x6765;&#x5B9E;&#x4E60;&#x7684;&#x65F6;&#x5019;&#x5728;&#x4E0A;&#x6D77;&#x8BA4;&#x8BC6;&#x7684;&#xFF0C;&#x4E0D;&#x77E5;&#x600E;&#x4E48;&#x7684;&#x5C31;&#x6210;&#x4E3A;&#x4E86;&#x65E0;&#x8BDD;&#x4E0D;&#x8C08;&#x7684;&#x597D;&#x670B;&#x53CB;&#xFF0C;&#x5728;&#x5979;&#x9762;&#x524D;&#x8BF4;&#x4EC0;&#x4E48;&#x8BDD;&#xFF0C;&#x505A;&#x4EC0;&#x4E48;&#x4E8B;&#x90FD;&#x4E0D;&#x7528;&#x4F2A;&#x88C5;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4E5F;&#x4ECE;&#x6765;&#x4E0D;&#x4F2A;&#x88C5;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x559C;&#x6B22;&#x8DDF;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x76F8;&#x5904;&#x3002;&#x4ECE;&#x6B66;&#x6C49;&#x53BB;&#x4E0A;&#x6D77;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#x670B;&#x53CB;&#xFF0C;&#x90FD;&#x662F;&#x4ED6;&#x4E00;&#x76F4;&#x966A;&#x7740;&#x6211;&#xFF0C;&#x540E;&#x9762;&#x6211;&#x8FDB;&#x4E86;&#x4E8C;&#x4E09;&#x56DB;&#x4E94;&#x4E5F;&#x662F;&#x4ED6;&#x65E0;&#x610F;&#x63A8;&#x8350;&#xFF0C;&#x4ED6;&#x8FDB;&#x4E86;&#x9694;&#x58C1;&#x7684;TCL,&#x6211;&#x4EEC;&#x5468;&#x672B;&#x6709;&#x65F6;&#x95F4;&#x5C31;&#x4F1A;&#x4E00;&#x8D77;&#x53BB;&#x73A9;&#xFF0C;&#x5728;&#x4E0A;&#x6D77;&#x6362;&#x4E86;&#x51E0;&#x6B21;&#x623F;&#x5B50;&#x90FD;&#x662F;&#x6211;&#x5E2E;&#x4ED6;&#x642C;&#xFF0C;&#x4ED6;&#x5E2E;&#x6211;&#x642C;&#x3002;2016&#x5E74;&#x6211;&#x4EEC;&#x8FD8;&#x7ECF;&#x5E38;&#x4E00;&#x8D77;&#x6CE1;&#x6FA1;&#xFF0C;&#x4ED6;&#x4E5F;&#x5728;&#x897F;&#x5B89;&#x4E70;&#x4E86;&#x623F;&#x5B50;&#xFF0C;&#x51C6;&#x5907;&#x5B58;&#x70B9;&#x94B1;&#x5C31;&#x56DE;&#x5BB6;&#x5B89;&#x4EAB;&#x665A;&#x5E74;&#x7684;&#xFF0C;&#x7545;&#x60F3;&#x672A;&#x6765;&#x3002;&#x6211;&#x4ECA;&#x5E74;&#x8FC7;&#x5B8C;&#x5E74;&#x5306;&#x5306;&#x6765;&#x4E86;&#x65B0;&#x52A0;&#x5761;&#xFF0C;&#x90FD;&#x6CA1;&#x6709;&#x8DDF;&#x4ED6;&#x6765;&#x7684;&#x53CA;&#x9053;&#x522B;&#xFF0C;&#x672C;&#x4E3A;&#x6253;&#x7B97;&#x6211;&#x5728;&#x8FD9;&#x8FB9;&#x7A33;&#x5B9A;&#x4E00;&#x70B9;&#x5C31;&#x63A8;&#x8350;&#x4ED6;&#x6765;&#x8FD9;&#x8FB9;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x53C8;&#x80FD;&#x5728;&#x4E00;&#x8D77;&#x73A9;&#x800D;&#x3002;&#x53EF;&#x662F;&#x5929;&#x65E0;&#x773C;&#xFF0C;&#x4ED6;&#x88AB;&#x67E5;&#x51FA;&#x80C3;&#x51FA;&#x8840;&#xFF0C;&#x4F4F;&#x9662;&#x4F4F;&#x7740;&#x5C31;&#x518D;&#x4E5F;&#x6CA1;&#x8054;&#x7CFB;&#x6211;&#x4E86;&#xFF0C;&#x6211;&#x591A;&#x4E48;&#x5E0C;&#x671B;&#x8FD9;&#x4E0D;&#x662F;&#x771F;&#x7684;&#xFF0C;&#x6709;&#x4E00;&#x5929;&#x4F60;&#x4F1A;&#x5728;&#x5FAE;&#x4FE1;&#x4E0A;&#x7ED9;&#x6211;&#x8BF4;&#x4F60;&#x5F88;&#x597D;&#x3002;<br><img src="http://ojxhdwqig.bkt.clouddn.com/friendsIMG_20160609_152501.jpg" alt=""><br><img src="http://ojxhdwqig.bkt.clouddn.com/friendsIMG_20160609_140528.jpg" alt=""></p>
<p>&#x6211;&#x59D1;&#x7237;&#x7237;&#x524D;&#x6BB5;&#x65F6;&#x95F4;&#x56E0;&#x4E3A;&#x764C;&#x75C7;&#x79BB;&#x5F00;&#x4E86;&#x6211;&#x4EEC;&#xFF0C;&#x4ED6;&#x90A3;&#x6DF1;&#x523B;&#x7684;&#x7B11;&#x5BB9;&#x5370;&#x5728;&#x4E86;&#x6211;&#x7684;&#x8111;&#x6D77;&#x91CC;&#x3002;</p>
<p>&#x611F;&#x89C9;&#x751F;&#x547D;&#x7684;&#x65E0;&#x5E38;&#xFF0C;&#x5728;&#x751F;&#x547D;&#x9762;&#x524D;&#xFF0C;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x90FD;&#x4E0D;&#x503C;&#x4E00;&#x63D0;&#x3002;&#x968F;&#x7740;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x6700;&#x5BB3;&#x6015;&#x7684;&#x4E8B;&#x5C31;&#x662F;&#x4EB2;&#x4EBA;&#x7684;&#x79BB;&#x53BB;&#xFF0C;&#x4E00;&#x5B9A;&#x73CD;&#x60DC;&#x548C;&#x4EB2;&#x4EBA;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x65F6;&#x5149;&#x3002;</p>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://stareme.wang/2017/03/16/2017-me/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="stareme">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/uploads/me.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="做另一面的自己">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="做另一面的自己" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2017/03/16/2017-me/" itemprop="url">
                  2017年目标
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-03-16T23:11:12+08:00">
                2017-03-16
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
              <span class="post-meta-divider">|</span>
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/新加坡/" itemprop="url" rel="index">
                    <span itemprop="name">新加坡</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <a href="/2017/03/16/2017-me/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2017/03/16/2017-me/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x5FFD;&#x7136;&#x6709;&#x79CD;&#x597D;&#x60F3;&#x5728;2017&#x5E74;&#x5E95;&#x5728;&#x670B;&#x53CB;&#x5708;&#x8BF4;&#x4E00;&#x53E5;&#x201C;&#x4ECA;&#x5E74;&#x6536;&#x83B7;&#x592A;&#x591A;&#x7684;&#x611F;&#x89C9;&#x201D;&#xFF0C;&#x901A;&#x8FC7;&#x63A5;&#x89E6;&#x8EAB;&#x8FB9;&#x7684;&#x4EBA;&#xFF0C;&#x8EAB;&#x8FB9;&#x7684;&#x4E8B;&#xFF0C;&#x611F;&#x89C9;&#x5C81;&#x6708;&#x8FD8;&#x662F;&#x4E0D;&#x80FD;&#x7528;&#x6765;&#x8E49;&#x8DCE;&#x554A;&#xFF0C;&#x4EE5;&#x540E;&#x4F1A;&#x540E;&#x6094;&#x3002;&#x7ECF;&#x8FC7;&#x953B;&#x70BC;&#x8FD9;&#x4EF6;&#x5C0F;&#x4E8B;&#xFF0C;&#x660E;&#x767D;&#x4E86;&#x575A;&#x6301;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x6BCF;&#x5929;&#x575A;&#x6301;&#x505A;&#x4E00;&#x4EF6;&#x5C0F;&#x4E8B;&#xFF0C;&#x540E;&#x9762;&#x5E26;&#x7ED9;&#x4F60;&#x7684;&#x60CA;&#x559C;&#x4E0D;&#x5BB9;&#x60F3;&#x50CF;&#x3002;</p>
<p>&#x5728;&#x5DE5;&#x4F5C;&#x7684;&#x524D;&#x4E24;&#x5E74;&#x4E5F;&#x6709;&#x611F;&#x89C9;&#xFF0C;&#x53EA;&#x61C2;java&#x4F3C;&#x4E4E;&#x61C2;&#x7684;&#x662F;&#x6709;&#x70B9;&#x5C11;&#xFF0C;&#x4E5F;&#x5C1D;&#x8BD5;&#x5B66;&#x4E60;&#x4E86;&#x4E00;&#x4E0B;C++&#x5F00;&#x5FC5;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#x5B9E;&#x5728;&#x592A;&#x5C11;&#xFF0C;android&#x90FD;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x5403;&#x900F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5B9E;&#x5728;&#x662F;&#x6709;&#x4E9B;&#x8D39;&#x52B2;&#xFF0C;&#x5B66;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x5B66;&#x61C2;&#x7684;&#x5F88;&#x5C11;&#xFF0C;&#x66F4;&#x522B;&#x8BF4;&#x5E94;&#x7528;&#x3002;&#x6700;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x653E;&#x5F03;&#xFF0C;&#x4E5F;&#x662F;&#x65E0;&#x5948;&#x554A;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x53C2;&#x52A0;&#x6B63;&#x5F0F;&#x5DE5;&#x4F5C;&#x4E0D;&#x77E5;&#x4E0D;&#x89C9;&#x5DF2;&#x7ECF;5&#x5E74;&#x4E86;&#xFF0C;&#x53D1;&#x73B0;&#x6280;&#x80FD;&#x5DF2;&#x7ECF;&#x4E0D;&#x80FD;&#x652F;&#x6491;&#x6211;&#x7684;&#x68A6;&#x60F3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x662F;&#x65F6;&#x5019;&#x5B66;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x77E5;&#x8BC6;&#x4E86;&#xFF0C;&#x53BB;&#x5E74;&#x521A;&#x597D;&#x4E70;&#x4E86;mac pro, &#x591A;&#x4E48;&#x597D;&#x7684;&#x673A;&#x4F1A;&#x5B66;&#x4E60;IOS&#x5F00;&#x53D1;&#xFF0C;&#x8FD9;&#x6B21;&#x4E0D;&#x80FD;&#x518D;&#x627E;&#x501F;&#x53E3;&#x4E86;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x8BA9;mac&#x7269;&#x6709;&#x6240;&#x503C;&#x7684;&#x65F6;&#x5019;&#x4E86;&#x3002;</p>
<p>&#x4E8E;&#x662F;2017&#x5E74;&#x5236;&#x5B9A;&#x4EE5;&#x4E0B;&#x76EE;&#x6807;&#xFF1A;</p>
<ul>
<li>&#x575A;&#x6301;&#x953B;&#x70BC;&#x8EAB;&#x4F53;&#xFF0C;&#x4E00;&#x5468;&#x53BB;1&#x5230;2&#x6B21;&#x5427;&#xFF0C;&#x597D;&#x7684;&#x8EAB;&#x4F53;&#x624D;&#x80FD;&#x6491;&#x8D77;&#x521B;&#x4E1A;&#x7684;&#x5E26;&#x6765;&#x7684;&#x9AD8;&#x8D1F;&#x8377;&#x5DE5;&#x4F5C;&#x5F3A;&#x5EA6;&#xFF0C;&#x867D;&#x7136;&#x76EE;&#x524D;&#x8FD8;&#x5728;&#x5BFB;&#x627E;&#x5065;&#x8EAB;&#x623F;&#x4E2D;&#x3002;</li>
<li>&#x575A;&#x6301;&#x767D;&#x65A9;&#x8BCD;&#x5B66;&#x4E60;&#x82F1;&#x8BED;&#xFF0C;&#x5148;&#x56DB;&#x7EA7;&#x9AD8;&#x9891;&#xFF0C;&#x518D;&#x516D;&#x7EA7;&#x9AD8;&#x9891;&#xFF0C;&#x7136;&#x540E;&#x542C;&#x529B;&#xFF0C;&#x53E3;&#x8BED;&#x3002;&#x5728;&#x65B0;&#x52A0;&#x5761;&#x8FD9;&#x4E2A;&#x5F39;&#x4E38;&#x4E4B;&#x5730;&#x4E0D;&#x4F1A;&#x8BF4;&#x82F1;&#x8BED;&#x6709;&#x65F6;&#x5019;&#x8FD8;&#x662F;&#x633A;&#x5C34;&#x5C2C;&#x7684;&#xFF0C;&#x7FA1;&#x6155;&#x8EAB;&#x8FB9;&#x7684;&#x540C;&#x4E8B;&#x82F1;&#x8BED;&#x8BB2;&#x7684;&#x6E9C;&#xFF0C;&#x76EE;&#x6807;&#x662F;&#x4ECA;&#x5E74;&#x53EF;&#x4EE5;&#x542C;&#x61C2;&#x8FD9;&#x91CC;&#x4EBA;&#x8BF4;&#x82F1;&#x8BED;&#xFF0C;&#x80FD;&#x7B80;&#x5355;&#x7684;&#x65E5;&#x5E38;&#x4EA4;&#x6D41;&#x3002;</li>
<li>&#x5728;&#x4E0D;&#x803D;&#x8BEF;&#x5E73;&#x65F6;&#x5DE5;&#x4F5C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5229;&#x7528;mac pro &#x5B66;&#x4E60;IOS&#x5F00;&#x53D1;&#xFF0C;&#x638C;&#x63E1;swift&#xFF0C;&#x6709;&#x6761;&#x4EF6;&#x548C;&#x65F6;&#x95F4;&#x638C;&#x63E1;&#x4E0B;Object-C,&#x82B1;&#x4E86;5&#x5E74;&#x7684;&#x65F6;&#x95F4;&#x5B66;&#x597D;android,&#x82B1;5&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#x5B66;&#x4F1A;ios,&#x518D;&#x5F00;&#x53D1;1&#xFF0C;2&#x5E74;&#x65F6;&#x95F4;&#x5F00;&#x53D1;&#x5B9E;&#x9645;&#x7684;iphone&#x5E94;&#x7528;&#x3002;</li>
<li>&#x5E0C;&#x671B;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x9879;&#x76EE;Loops&#x65E5;&#x6D3B;&#x80FD;&#x7834;20-30w&#x7AED;&#x5C3D;&#x6240;&#x80FD;&#xFF0C;&#x6211;&#x53EF;&#x662F;&#x4ECE;2345&#x6D4F;&#x89C8;&#x5668;&#x65E5;&#x6D3B;150w&#x8DF3;&#x69FD;&#x51FA;&#x6765;&#xFF0C;&#x4E0D;&#x80FD;&#x8D85;&#x8FC7;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x8BA9;&#x6211;&#x5728;&#x524D;&#x540C;&#x4E8B;&#x9762;&#x524D;&#x62AC;&#x4E0D;&#x8D77;&#x5934;&#x554A;&#x3002;</li>
<li>&#x4ECA;&#x5E74;&#x4E89;&#x53D6;&#x56DE;&#x5BB6;&#x4E24;&#x6B21;&#xFF0C;&#x867D;&#x7136;&#x82B1;&#x8D39;&#x4E0D;&#x5C0F;&#xFF0C;&#x4F46;&#x662F;&#x94B1;&#x7B97;&#x4EC0;&#x4E48;&#x5462;&#x8DDF;&#x5BB6;&#x91CC;&#x8001;&#x4EBA;&#x5BF9;&#x6211;&#x56DE;&#x5BB6;&#x7684;&#x671F;&#x5F85;&#x76F8;&#x6BD4;&#x3002;</li>
<li>&#x5C3D;&#x91CF;&#x62BD;&#x51FA;&#x65F6;&#x95F4;&#x966A;&#x8001;&#x5A46;&#x591A;&#x901B;&#x901B;&#x4E1C;&#x5357;&#x4E9A;&#xFF0C;&#x8DDF;&#x7740;&#x6211;&#x4E1C;&#x5954;&#x897F;&#x8DD1;&#xFF0C;&#x73B0;&#x5728;&#x4E5F;&#x6CA1;&#x6709;&#x5B89;&#x5B9A;&#xFF0C;&#x771F;&#x662F;&#x96BE;&#x4E3A;&#x5979;&#x4E86;&#x3002;</li>
</ul>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://stareme.wang/2017/02/16/刚来新加坡/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="stareme">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/uploads/me.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="做另一面的自己">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="做另一面的自己" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2017/02/16/刚来新加坡/" itemprop="url">
                  在新加坡怎么样
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-02-16T22:02:45+08:00">
                2017-02-16
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
              <span class="post-meta-divider">|</span>
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/新加坡/" itemprop="url" rel="index">
                    <span itemprop="name">新加坡</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <a href="/2017/02/16/刚来新加坡/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2017/02/16/刚来新加坡/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>2017.2.13&#x53F7;&#x62D6;&#x7740;&#x91CD;&#x91CD;&#x7684;&#x884C;&#x674E;&#xFF0C;&#x5728;&#x6D66;&#x4E1C;&#x56FD;&#x9645;&#x673A;&#x573A;&#x770B;&#x7740;&#x8001;&#x5A46;&#x542B;&#x6CEA;&#x544A;&#x522B;&#xFF0C;&#x5FC3;&#x4E2D;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x820D;&#xFF0C;&#x79BB;&#x884C;&#x524D;&#x7684;&#x524D;&#x4E24;&#x5929;&#x4E5F;&#x548C;&#x4E0A;&#x6D77;&#x7684;&#x670B;&#x53CB;&#x4EEC;&#x4F9D;&#x6B21;&#x4F5C;&#x4E86;&#x544A;&#x522B;&#x3002;&#x6765;&#x4E4B;&#x524D;&#x4E00;&#x4E24;&#x4E2A;&#x6708;&#x8FD8;&#x662F;&#x633A;&#x5174;&#x594B;&#xFF0C;&#x6BD5;&#x7ADF;&#x6709;&#x673A;&#x4F1A;&#x51FA;&#x56FD;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x56FD;&#x5916;&#x53EF;&#x4EE5;&#x5446;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E0D;&#x9519;&#x7684;&#x4F53;&#x9A8C;&#xFF0C;&#x4E0D;&#x662F;&#x4EBA;&#x4EBA;&#x90FD;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x662F;&#x6765;&#x4E86;&#x8FD9;&#x8FB9;&#x3002;&#x4F46;&#x662F;&#x4E34;&#x884C;&#x524D;&#x67E5;&#x4E86;&#x4E0B;&#x65B0;&#x52A0;&#x5761;&#x7684;&#x6D88;&#x8D39;&#x6C34;&#x5E73;&#xFF0C;&#x4E16;&#x754C;&#x7B2C;&#x4E00;&#xFF0C;&#x60F3;&#x60F3;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x8D44;&#xFF0C;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x5C31;&#x6CA1;&#x8FD9;&#x4E48;&#x9AD8;&#x4E86;&#xFF0C;&#x5F88;&#x5BB3;&#x6015;&#x81EA;&#x5DF1;&#x8D5A;&#x4E0D;&#x5230;&#x94B1;&#xFF0C;&#x53CD;&#x800C;&#x865A;&#x5EA6;&#x4E86;&#x65F6;&#x5149;&#xFF0C;&#x800C;&#x4E14;&#x627E;&#x4E86;&#x5F88;&#x4E45;&#x7684;&#x9152;&#x5E97;&#x90FD;&#x8FD9;&#x4E48;&#x8D35;&#xFF0C;&#x9152;&#x5E97;&#x4E5F;&#x6CA1;&#x627E;&#x597D;&#xFF0C;&#x66F4;&#x52A0;&#x65AD;&#x5B9A;&#x8FD9;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x4EBA;&#x80FD;&#x6D88;&#x8D39;&#x7684;&#x8D77;&#x7684;&#x5730;&#x65B9;&#xFF1B;&#x60F3;&#x5230;&#x6D77;&#x5173;&#x68C0;&#x67E5;&#xFF0C;&#x4F1A;&#x4E0D;&#x4F1A;&#x5165;&#x4E0D;&#x4E86;&#x5173;&#xFF0C;&#x88AB;&#x5173;&#x8D77;&#x6765;&#xFF0C;&#x5230;&#x4E86;&#x8FD9;&#x8FB9;&#x8981;&#x5728;&#x98DE;&#x673A;&#x573A;&#x8FC7;&#x591C;&#x7B49;&#x7B49;&#x3002;&#x60F3;&#x6765;&#x60F3;&#x53BB;&#xFF0C;&#x8D8A;&#x53D1;&#x89C9;&#x5F97;&#x4E0D;&#x77E5;&#x9053;&#x4F55;&#x53BB;&#x4F55;&#xFF0C;&#x4E8E;&#x662F;&#x63D0;&#x524D;&#x4E00;&#x5929;&#x6C42;&#x52A9;&#x4E86;&#x63A8;&#x8350;&#x53BB;&#x8FD9;&#x4E2A;&#x516C;&#x53F8;&#x7684;&#x4E00;&#x4E2A;&#x670B;&#x53CB;&#xFF0C;&#x672C;&#x6765;&#x662F;&#x4E0D;&#x60F3;&#x6253;&#x6270;&#x4EBA;&#x5BB6;&#x7684;&#xFF0C;&#x6BD5;&#x7ADF;&#x4E4B;&#x524D;&#x4E5F;&#x4E0D;&#x662F;&#x5F88;&#x719F;&#x3002;&#x4F46;&#x662F;&#x4ED6;&#x4E00;&#x542C;&#x6211;&#x8981;&#x6765;&#xFF0C;&#x70ED;&#x60C5;&#x8D85;&#x51FA;&#x4E86;&#x6211;&#x7684;&#x60F3;&#x50CF;&#xFF0C;&#x53C8;&#x662F;&#x5306;&#x5FD9;&#x5E2E;&#x6211;&#x627E;&#x623F;&#x5B50;&#xFF0C;&#x665A;&#x4E0A;&#x53C8;&#x8981;&#x6765;&#x98DE;&#x673A;&#x573A;&#x63A5;&#x6211;&#xFF0C;&#x4E00;&#x542C;&#x5230;&#x8FD9;&#x611F;&#x89C9;&#x4E00;&#x80A1;&#x6696;&#x6D41;&#x6D8C;&#x4E0A;&#x5FC3;&#x5934;&#xFF0C;&#x771F;&#x6B63;&#x611F;&#x89C9;&#x5230;&#x51FA;&#x95E8;&#x9760;&#x670B;&#x53CB;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;&#x4E8E;&#x662F;&#x4E4B;&#x524D;&#x7684;&#x5BB3;&#x6015;&#x548C;&#x6050;&#x60E7;&#x5C31;&#x6D88;&#x5931;&#x4E86;&#xFF0C;&#x60F3;&#x4E86;&#x4E0B;&#x4E4B;&#x524D;&#x7684;&#x6D88;&#x8D39;&#x95EE;&#x9898;&#xFF0C;&#x6765;&#x8FD9;&#x8FB9;&#x53EF;&#x4EE5;&#x4F53;&#x9A8C;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x5C11;&#x8D5A;&#x70B9;&#x53C8;&#x6709;&#x4F55;&#x70E6;&#x5462;&#x3002;&#x4E8E;&#x662F;&#x5C31;&#x8FD9;&#x6837;&#x7B2C;&#x4E8C;&#x5929;2&#xFF1A;40&#x98DE;&#x673A;&#x8D77;&#x98DE;&#x4E86;&#xFF0C;&#x98DE;&#x5411;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x56FD;&#x5EA6;&#xFF0C;&#x65B0;&#x52A0;&#x5761;&#x3002;</p>
<p>&#x5728;&#x98DE;&#x673A;&#x4E0A;&#xFF0C;&#x4E00;&#x5207;&#x6B63;&#x5E38;&#xFF0C;&#x4E2D;&#x9014;&#x6709;&#x70B9;&#x997F;&#xFF0C;&#x53EB;&#x4E86;&#x4EFD;&#x5364;&#x8089;&#x996D;&#xFF0C;40&#x5757;&#xFF0C;&#x6709;&#x70B9;&#x5FC3;&#x75DB;&#xFF0C;&#x4F46;&#x60F3;&#x7740;&#x6BD5;&#x7ADF;&#x51FA;&#x56FD;&#x554A;&#xFF0C;&#x4E0D;&#x80FD;&#x592A;&#x5BD2;&#x60E8;&#x4E86;&#xFF0C;&#x53D1;&#x73B0;&#x65C1;&#x8FB9;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x90E8;&#x5206;&#x8001;&#x4EBA;&#x53BB;&#x5761;&#x56FD;&#x65C5;&#x6E38;&#x7684;&#x56E2;&#xFF0C;&#x679C;&#x7136;&#x65B0;&#x52A0;&#x5761;&#x662F;&#x4E2A;&#x65C5;&#x6E38;&#x7684;&#x597D;&#x5730;&#x65B9;&#x3002;&#x98DE;&#x673A;&#x63D0;&#x524D;&#x4E00;&#x4E2A;&#x5C0F;&#x65F6;&#x5230;&#x8FBE;&#xFF0C;&#x4E8E;&#x662F;&#x548C;&#x670B;&#x53CB;&#x4E00;&#x8FB9;&#x5FAE;&#x4FE1;&#x4E00;&#x8FB9;&#x5165;&#x5173;&#x3002;&#x5E26;&#x7740;EP&#x7684;&#x4FE1;&#x4EF6;&#x4EE5;&#x4E3A;&#x80FD;&#x8FDB;&#x53BB;&#x4E86;&#xFF0C;&#x6CA1;&#x60F3;&#x88AB;&#x53EB;&#x7740;&#x53BB;&#x586B;&#x4E86;&#x4EFD;&#x5165;&#x5173;&#x7533;&#x8BF7;&#x8868;&#xFF0C;&#x8FD8;&#x88AB;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x6D77;&#x5173;&#x4EBA;&#x5458;&#x4E00;&#x987F;&#x95EE;&#x8BDD;&#xFF0C;&#x8BF4;&#x662F;&#x4E0D;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x6765;&#x65B0;&#x52A0;&#x5761;&#x7B49;&#x7B49;&#xFF0C;&#x65C1;&#x8FB9;&#x6709;&#x597D;&#x591A;&#x5176;&#x5B83;&#x56FD;&#x5BB6;&#x7684;&#x4EBA;&#xFF0C;&#x611F;&#x89C9;&#x8FD8;&#x662F;&#x633A;&#x5BB3;&#x6015;&#x7684;&#x3002;&#x4E0D;&#x8FC7;&#x6CA1;&#x6709;&#x60F3;&#x50CF;&#x7684;&#x90A3;&#x4E48;&#x4E25;&#xFF0C;&#x4E1C;&#x897F;&#x4E0D;&#x68C0;&#x67E5;&#xFF0C;&#x53EF;&#x601C;&#x4E86;&#x6211;&#x7237;&#x7237;&#x5976;&#x5976;&#x7ED9;&#x6211;&#x5907;&#x597D;&#x7684;&#x6768;&#x6885;&#x5E72;&#xFF0C;&#x674E;&#x5B50;&#x5E72;&#x4E86;&#xFF0C;&#x6709;&#x5F15;&#x8D77;&#x540E;&#x6094;&#x3002;&#x8FD8;&#x597D;&#x4E00;&#x5207;&#x987A;&#x5229;&#xFF0C;&#x5165;&#x5B8C;&#x5173;&#xFF0C;&#x53D6;&#x5B8C;&#x884C;&#x674E;&#x4E4B;&#x540E;&#xFF0C;&#x670B;&#x53CB;&#x4E5F;&#x6765;&#x63A5;&#x5230;&#x4E86;&#x6211;&#xFF0C;&#x4ED6;&#x5E26;&#x7740;&#x53BB;&#x5750;&#x5730;&#x94C1;&#x5F80;&#x4F4F;&#x7684;&#x5730;&#x65B9;&#x8D76;&#xFF0C;&#x4E00;&#x8FB9;&#x4ECB;&#x7ECD;&#x7740;&#x65B0;&#x52A0;&#x5761;&#x548C;&#x6211;&#x6765;&#x5230;&#x8FD9;&#x8FB9;&#x4E4B;&#x540E;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x8FD8;&#x966A;&#x4E86;&#x6211;&#x529E;&#x4E86;&#x4E00;&#x5F20;&#x516C;&#x4EA4;&#x5361;&#xFF0C;&#x6709;&#x82F1;&#x8BED;&#xFF0C;&#x679C;&#x7136;&#x5761;&#x56FD;&#x8981;&#x8BB2;&#x82F1;&#x8BED;&#xFF0C;&#x4E0D;&#x7136;&#x5904;&#x5904;&#x78B0;&#x58C1;&#x3002;&#x5230;&#x4E86;&#x4F4F;&#x7684;&#x5730;&#x65B9;&#x624D;&#x77E5;&#x9053;&#x4EBA;&#x5BB6;&#x90FD;&#x63D0;&#x524D;&#x628A;&#x94B1;&#x7ED9;&#x4E86;&#x623F;&#x4E1C;&#xFF0C;$750,&#x4E00;&#x7B14;&#x4E0D;&#x5C0F;&#x7684;&#x6570;&#x76EE;&#x3002;&#x60F3;&#x60F3;&#x4EBA;&#x5BB6;&#x771F;&#x597D;&#xFF0C;&#x8FD9;&#x4E48;&#x76F8;&#x4FE1;&#x522B;&#x4EBA;&#xFF0C;&#x81EA;&#x5DF1;&#x4E5F;&#x6C42;&#x5FC5;&#x80FD;&#x505A;&#x5230;&#x3002;&#x8FD9;&#x4E2A;&#x670B;&#x53CB;&#x5982;&#x679C;&#x4EBA;&#x5BB6;&#x4E0D;&#x5ACC;&#x5F03;&#xFF0C;&#x5F97;&#x4EA4;&#x3002;&#x4E8E;&#x662F;&#x628A;&#x94B1;&#x8FD8;&#x7ED9;&#x4EBA;&#x5BB6;&#xFF0C;&#x8FD8;&#x5151;&#x6362;&#x4E86;250&#x5757;&#xFF0C;1000&#x5757;&#x7ED9;&#x4EBA;&#x5BB6;&#x53BB;&#x5B58;&#x4E86;&#x3002;&#x540E;&#x9762;&#x4ED6;&#x5C31;&#x56DE;&#x5BB6;&#x4E86;&#x3002;&#x53D1;&#x73B0;&#x8FD9;&#x8FB9;&#x662F;&#x590F;&#x5929;&#xFF0C;&#x548C;&#x5BB6;&#x91CC;&#x5F62;&#x6210;&#x9C9C;&#x660E;&#x7684;&#x53CD;&#x5DEE;&#x3002;&#x6211;&#x4E5F;&#x5B89;&#x5FC3;&#x7684;&#x7761;&#x4E0B;&#x4E86;&#x3002;&#x8981;&#x662F;&#x6CA1;&#x6709;&#x4ED6;&#xFF0C;&#x771F;&#x4E0D;&#x77E5;&#x9053;&#x90A3;&#x4E00;&#x665A;&#x4E0A;&#x8981;&#x600E;&#x4E48;&#x5EA6;&#x8FC7;&#xFF0C;&#x623F;&#x5B50;&#x8981;&#x600E;&#x4E48;&#x624D;&#x80FD;&#x627E;&#x5230;&#x3002;&#x7136;&#x540E;&#x53BB;&#x516C;&#x53F8;&#x53C8;&#x662F;&#x591A;&#x4E48;&#x7684;&#x8D39;&#x52B2;&#x3002;&#x53EA;&#x80FD;&#x8BF4;&#x597D;&#x4EBA;&#x6709;&#x597D;&#x62A5;&#xFF0C;&#x4EE5;&#x540E;&#x8981;&#x50CF;&#x4ED6;&#x5B66;&#x4E60;&#x3002;<br><img src="http://ojxhdwqig.bkt.clouddn.com/WechatIMG8.jpeg" alt=""></p>
<p>&#x8EAB;&#x4E0A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5C31;&#x662F;mac&#x7535;&#x8111;&#x548C;&#x90A3;3000&#x7684;&#x73B0;&#x91D1;&#xFF0C;&#x7B7E;&#x8BC1;&#xFF0C;&#x7B7E;&#x8BC1;&#x4FE1;&#x4EF6;&#x7B49;&#x7B49;&#x554A;&#xFF0C;&#x4E8E;&#x662F;&#x5305;&#x4E00;&#x76F4;&#x80CC;&#x7740;&#x3002;&#x7B2C;&#x4E8C;&#x5929;&#x5C31;&#x4E70;&#x5404;&#x79CD;&#x65E5;&#x7528;&#x54C1;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x53BB;&#x8D85;&#x5E02;&#x901B;&#x4E86;&#x901B;&#xFF0C;&#x6CA1;&#x6709;&#x9884;&#x671F;&#x7684;&#x6D88;&#x8D39;&#x90A3;&#x4E48;&#x8D35;&#xFF0C;&#x603B;&#x5171;&#x4E70;&#x4E0B;&#x6765;&#x4E0D;&#x5230;50&#xFF0C;&#x7EC8;&#x4E8E;&#x9A8C;&#x8BC1;&#x4E86;&#x4E0D;&#x7BA1;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#x90FD;&#x6709;&#x4E00;&#x5343;&#x79CD;&#x6D3B;&#x6CD5;&#xFF0C;&#x770B;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x4E8E;&#x662F;&#x53C8;&#x5426;&#x5B9A;&#x4E4B;&#x524D;&#x81EA;&#x5DF1;&#x65E0;&#x77E5;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x4F4F;&#x7684;&#x95EE;&#x9898;&#x7B97;&#x662F;&#x6682;&#x65F6;&#x89E3;&#x51B3;&#x4E86;&#xFF0C;&#x5230;&#x4E86;&#x5403;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x65E9;&#x4E0A;&#x4E0B;&#x53BB;&#x4E00;&#x770B;&#x90FD;9&#x70B9;&#x591A;&#x4E86;&#xFF0C;&#x600E;&#x4E48;&#x8FD8;&#x662F;&#x8FD9;&#x4E48;&#x591A;&#x4EBA;&#x5728;&#x5403;&#x65E9;&#x70B9;&#xFF0C;&#x800C;&#x4E14;&#x4E00;&#x5230;&#x4E0B;&#x9762;&#x53D1;&#x73B0;&#x4EC0;&#x4E48;&#x4EBA;&#x90FD;&#x6709;&#xFF0C;&#x5370;&#x5EA6;&#x7684;&#xFF0C;&#x672C;&#x5730;&#x7684;&#xFF0C;&#x4E2D;&#x56FD;&#x7684;&#xFF0C;&#x9A6C;&#x6765;&#xFF0C;&#x7F8E;&#x56FD;&#x7684;&#xFF0C;&#x8BF4;&#x7684;&#x8BDD;&#x57FA;&#x672C;&#x90FD;&#x542C;&#x4E0D;&#x61C2;&#xFF0C;&#x4E8E;&#x662F;&#x6709;&#x70B9;&#x5BB3;&#x6015;&#xFF0C;&#x672C;&#x8EAB;&#x4E0D;&#x559C;&#x6B22;&#x5728;&#x964C;&#x751F;&#x7684;&#x73AF;&#x5883;&#x5446;&#x7740;&#xFF0C;&#x4E8E;&#x662F;&#x627E;&#x554A;&#x627E;&#xFF0C;&#x53D1;&#x73B0;&#x8FD9;&#x8FB9;&#x7684;&#x98DF;&#x7269;&#x505A;&#x7684;&#x8BA9;&#x4EBA;&#x6CA1;&#x80C3;&#x53E3;&#x554A;&#xFF0C;&#x90FD;&#x9ECF;&#x7CCA;&#x7CCA;&#x7684;&#xFF0C;&#x4E8E;&#x662F;&#x627E;&#x4E86;&#x5BB6;&#x5E7F;&#x4E1C;&#x80A0;&#x7C89;&#x52A0;&#x4E00;&#x7897;&#x7A00;&#x996D;4.5&#xFF0C;&#x8FD8;&#x86EE;&#x8D35;&#x7684;&#xFF0C;&#x5403;&#x80A0;&#x7C89;&#x7684;&#x7B2C;&#x4E00;&#x53E3;&#x5C31;&#x60F3;&#x5410;&#x4E86;&#xFF0C;&#x600E;&#x4E48;&#x4F1A;&#x6709;&#x8FD9;&#x4E48;&#x96BE;&#x5403;&#x7684;&#x98DF;&#x7269;&#xFF0C;&#x8FD9;&#x662F;&#x52A0;&#x4E86;&#x4EC0;&#x4E48;&#x9999;&#x6599;&#xFF0C;&#x4E8E;&#x662F;&#x518D;&#x4E5F;&#x4E0D;&#x6562;&#x76F8;&#x4FE1;&#x6240;&#x6709;&#x540D;&#x5B57;&#x662F;&#x4E2D;&#x56FD;&#x7684;&#x996D;&#x4E86;&#xFF0C;&#x8FD8;&#x662F;&#x5FCD;&#x7740;&#x5403;&#x4E86;&#x51E0;&#x53E3;&#x3002;&#x4E8E;&#x662F;&#x540E;&#x9762;&#x7684;&#x6BCF;&#x9910;&#x90FD;&#x627E;&#x7C73;&#x996D;&#x5403;&#xFF0C;&#x8FD9;&#x8FB9;&#x7C73;&#x996D;&#x7ADF;&#x7136;&#x4E5F;&#x6709;&#x4E00;&#x822C;&#x7279;&#x6B8A;&#x7684;&#x9999;&#x5473;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5F97;&#x5403;&#x554A;&#xFF0C;&#x4E0D;&#x7136;&#x771F;&#x6CA1;&#x4EC0;&#x4E48;&#x53EF;&#x4EE5;&#x5403;&#x7684;&#x4E86;&#x3002;&#x4E0A;&#x73ED;&#x516C;&#x53F8;&#x98DF;&#x5802;&#x7684;&#x996D;&#x4E0D;&#x9519;&#xFF0C;&#x4EF7;&#x683C;&#x4E5F;&#x516C;&#x9053;&#x3002;&#x4E8E;&#x662F;&#x6162;&#x6162;&#x7684;&#x5C31;&#x7B97;&#x5165;&#x4E61;&#x968F;&#x4FD7;&#x4E86;&#x3002;&#x4E0A;&#x73ED;&#x73AF;&#x5883;&#x8FD8;&#x4E0D;&#x9519;&#xFF0C;&#x90FD;&#x662F;&#x4E2D;&#x56FD;&#x4EBA;&#xFF0C;&#x6CA1;&#x6709;&#x8BED;&#x8A00;&#x969C;&#x788D;&#xFF0C;&#x800C;&#x4E14;&#x521A;&#x53BB;&#x914D;&#x7684;&#x8FD8;&#x662F;macbookpro&#xFF0C;&#x597D;&#x597D;&#x5E72;&#x8FD8;&#x6709;&#x80A1;&#x7968;&#x548C;&#x5956;&#x91D1;&#x62FF;&#xFF0C;&#x8001;&#x677F;&#x975E;&#x5E38;open&#xFF0C;&#x6709;&#x4E00;&#x8BF4;&#x4E00;&#xFF0C;&#x4E0D;&#x4F1A;&#x5BF9;&#x5458;&#x5DE5;&#x9690;&#x85CF;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x9886;&#x5BFC;&#x7684;&#x8C08;&#x8BDD;&#x8DDF;&#x6211;&#x4EEC;&#x8BF4;&#x7684;&#x5C31;&#x662F;&#x5728;&#x516C;&#x53F8;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E24;&#x4EF6;&#x4E8B;&#x4E00;&#x662F;&#x94B1;&#x7ED9;&#x7684;&#x591A;&#x4E0D;&#x591A;&#xFF0C;&#x4E8C;&#x662F;&#x8FC7;&#x7684;&#x5F00;&#x4E0D;&#x5F00;&#x5FC3;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x90FD;&#x8FBE;&#x4E0D;&#x5230;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8D70;&#x4E86;&#x3002;&#x8BF4;&#x7684;&#x5F88;&#x5BF9;&#xFF0C;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#x4E0D;&#x5BB9;&#x6613;&#xFF0C;&#x8FD8;&#x4E50;&#x4E8E;&#x5206;&#x4EAB;&#x7ED9;&#x5458;&#x5DE5;&#xFF0C;&#x633A;&#x611F;&#x52A8;&#x7684;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x597D;&#x597D;&#x5E72;&#x62A5;&#x7B54;&#x516C;&#x53F8;&#x3002;<br><img src="http://ojxhdwqig.bkt.clouddn.com/WechatIMG6.jpeg" alt=""><br><img src="http://ojxhdwqig.bkt.clouddn.com/WechatIMG7.jpeg" alt=""><br><img src="http://ojxhdwqig.bkt.clouddn.com/WechatIMG2.jpeg" alt=""><br><img src="http://ojxhdwqig.bkt.clouddn.com/WechatIMG3.jpeg" alt=""></p>
<p>&#x4E4B;&#x524D;&#x5BB6;&#x91CC;&#x4EBA;&#x8FD8;&#x662F;&#x6709;&#x70B9;&#x62C5;&#x5FC3;&#x6211;&#x7684;&#x5B89;&#x5168;&#xFF0C;&#x6015;&#x88AB;&#x5173;&#x5728;&#x8FD9;&#x8FB9;&#xFF0C;&#x6BD5;&#x7ADF;&#x8001;&#x5BB6;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x5BB3;&#x6015;&#x7684;&#x6B63;&#x5E38;&#x7684;&#x3002;&#x4E8E;&#x662F;&#x5728;&#x670B;&#x53CB;&#x7684;&#x5E2E;&#x52A9;&#x4E0B;&#x529E;&#x4E86;&#x7535;&#x8BDD;&#x5361;&#xFF0C;&#x7ACB;&#x9A6C;&#x6253;&#x4E86;&#x7535;&#x8BDD;&#x7ED9;&#x5BB6;&#x91CC;&#x4EBA;&#xFF0C;&#x8BF4;&#x4E00;&#x8DEF;&#x7684;&#x7ECF;&#x8FC7;&#x548C;&#x611F;&#x53D7;&#xFF0C;&#x89C1;&#x4E86;&#x597D;&#x591A;&#x6CA1;&#x6709;&#x89C1;&#x8FC7;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FDB;&#x7684;&#x662F;&#x6B63;&#x89C4;&#x516C;&#x53F8;&#x6CA1;&#x6709;&#x88AB;&#x8D29;&#x5356;&#xFF0C;&#x8FD9;&#x6837;&#x7238;&#x7238;&#x5976;&#x5976;&#x5C31;&#x653E;&#x5FC3;&#x4E86;&#xFF0C;&#x6211;&#x4E5F;&#x5C31;&#x653E;&#x5FC3;&#x4E86;&#x3002;</p>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://stareme.wang/2017/01/17/Android hook初学/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="stareme">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/uploads/me.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="做另一面的自己">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="做另一面的自己" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2017/01/17/Android hook初学/" itemprop="url">
                  Android Hook 技术
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-01-17T21:53:41+08:00">
                2017-01-17
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
              <span class="post-meta-divider">|</span>
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/Android/" itemprop="url" rel="index">
                    <span itemprop="name">Android</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <a href="/2017/01/17/Android hook初学/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2017/01/17/Android hook初学/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>hook&#x4E00;&#x4E8B;&#x770B;&#x4F3C;&#x795E;&#x79D8;&#xFF0C;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x96BE;&#xFF0C;&#x5E0C;&#x671B;&#x5404;&#x4F4D;&#x770B;&#x5B98;&#x770B;&#x8FC7;&#x672C;&#x6587;&#x4E4B;&#x540E;&#x80FD;&#x6709;&#x6240;&#x6536;&#x83B7;&#x3002;</p>
<p>&#x672C;&#x6B21;&#x662F;<code>hook Android</code>&#x7684;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;<code>OnClickListener</code>&#xFF0C;<code>hook</code>&#x7684;&#x610F;&#x4E49;&#x5728;&#x4E8E;&#x4F60;&#x80FD;&#x5728;&#x8C03;&#x7528;<code>setOnClickListener</code>&#x540E;&#x505A;&#x4E9B;&#x5176;&#x4ED6;&#x7684;&#x4E8B;&#xFF0C;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x4F60;&#x60F3;&#x548C;&#x6240;&#x6709;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x4E00;&#x8D77;&#x5904;&#x7406;&#x7684;&#x4E8B;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x5C31;&#x4EE5;&#x57CB;&#x70B9;&#x4E3A;&#x4F8B;&#x5427;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line">@Override</div><div class="line">public void onClick(View view) {</div><div class="line">    view.setTag(R.id.hook, &quot;I&apos;m hooking now.....&quot;);</div><div class="line">}</div></pre></td></tr></table></figure>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#xFF0C;&#x53EF;&#x662F;&#x5F39;&#x51FA;&#x6765;&#x7684;&#x7ED3;&#x679C;&#x662F;<code>Toast</code>&#x4E86;&#x4E2A; <code>I&apos;m hooking now.....</code>.</p>
<h4 id="&#x5206;&#x6790;&#x4E0B;&#x6E90;&#x7801;&#xFF1A;"><a href="#&#x5206;&#x6790;&#x4E0B;&#x6E90;&#x7801;&#xFF1A;" class="headerlink" title="&#x5206;&#x6790;&#x4E0B;&#x6E90;&#x7801;&#xFF1A;"></a>&#x5206;&#x6790;&#x4E0B;&#x6E90;&#x7801;&#xFF1A;</h4><p><img src="http://ojafgwnc4.bkt.clouddn.com/code1.png" alt=""></p>
<p>&#x9996;&#x5148;&#x6765;&#x770B;&#x770B;android.view.View&#x4E2D;&#x7684;&#x8FD9;&#x5757;&#x4EE3;&#x7801;&#xFF0C;mOnClickListener&#x53D8;&#x91CF;&#x9759;&#x9759;&#x7684;&#x5728;&#x8FD9;&#x91CC;(&#x8FD9;&#x91CC;&#x8FD8;&#x6709;&#x522B;&#x7684;&#x4E8B;&#x4EF6;&#x54E6;&#xFF0C;&#x6BD4;&#x5982;OnLongClickListener&#x7B49;&#xFF0C;&#x5927;&#x5BB6;&#x5B66;&#x5B8C;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x8BD5;&#x7740;hook&#x4E0B;&#x522B;&#x7684;)&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x79FB;&#x82B1;&#x63A5;&#x6728;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x82B1;&#x66FF;&#x6362;&#x6389;&#x8FD9;&#x4E2A;&#x6728;&#xFF0C;mOnClickListener&#x662F;ListenerInfo&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#xFF0C;&#x90A3;&#x7EE7;&#x7EED;&#x770B;&#x770B;ListenerInfo&#x5728;View&#x7684;&#x54EA;&#x91CC;&#x88AB;&#x521D;&#x59CB;&#x5316;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x6700;&#x5F00;&#x59CB;&#x62FF;&#x5230;&#x7684;&#x53EA;&#x6709;View&#x8FD9;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;<br><img src="http://ojafgwnc4.bkt.clouddn.com/code2.png" alt=""><br>&#x6CA1;&#x9519;&#xFF0C;&#x627E;&#x5230;&#x4E86;&#xFF0C;getListenerInfo()&#x5E72;&#x4E86;&#x8FD9;&#x4EF6;&#x4E8B;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5165;&#x624B;&#x5148;&#x628A;ListenerInfo&#x62FF;&#x4E0B;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x79FB;&#x82B1;&#x63A5;&#x6728;&#x3002;</p>
<h4 id="&#x5B9E;&#x73B0;"><a href="#&#x5B9E;&#x73B0;" class="headerlink" title="&#x5B9E;&#x73B0;"></a>&#x5B9E;&#x73B0;</h4><p>hook&#x7684;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x5145;&#x5206;&#x5229;&#x7528;java&#x53CD;&#x5C04;&#x673A;&#x5236;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x51E0;&#x884C;&#x4EE3;&#x7801;&#x641E;&#x5B9A;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div></pre></td><td class="code"><pre><div class="line">private void hook(View view) {</div><div class="line">     try {</div><div class="line">         Class clazzView = Class.forName(&quot;android.view.View&quot;);</div><div class="line">         Method method = clazzView.getDeclaredMethod(&quot;getListenerInfo&quot;);</div><div class="line">         method.setAccessible(true);</div><div class="line">         Object listenerInfo = method.invoke(view);</div><div class="line">         Class clazzInfo = Class.forName(&quot;android.view.View$ListenerInfo&quot;);</div><div class="line">         Field field = clazzInfo.getDeclaredField(&quot;mOnClickListener&quot;);</div><div class="line">         field.set(listenerInfo, new HookListener((View.OnClickListener) field.get(listenerInfo)));</div><div class="line">     } catch (ClassNotFoundException e) {</div><div class="line">         e.printStackTrace();</div><div class="line">     } catch (NoSuchMethodException e) {</div><div class="line">         e.printStackTrace();</div><div class="line">     } catch (InvocationTargetException e) {</div><div class="line">         e.printStackTrace();</div><div class="line">     } catch (IllegalAccessException e) {</div><div class="line">         e.printStackTrace();</div><div class="line">     } catch (NoSuchFieldException e) {</div><div class="line">         e.printStackTrace();</div><div class="line">     }</div><div class="line"> }</div></pre></td></tr></table></figure>
<p>&#x7531;&#x4E8E;&#x79FB;&#x82B1;&#x63A5;&#x6728;&#x6709;&#x4E2A;&#x672C;&#x8D28;&#x4E0D;&#x80FD;&#x5FD8;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5C0A;&#x91CD;&#x539F;&#x6709;&#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6728;&#x4E5F;&#x5F97;&#x5B9E;&#x73B0;View.OnClickListener&#x63A5;&#x53E3;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div></pre></td><td class="code"><pre><div class="line">private static class HookListener implements View.OnClickListener {</div><div class="line">        private View.OnClickListener mOriListener;</div><div class="line"></div><div class="line">        public HookListener(View.OnClickListener onClickListener) {</div><div class="line">            mOriListener = onClickListener;</div><div class="line">        }</div><div class="line"></div><div class="line">        @Override</div><div class="line">        public void onClick(View view) {</div><div class="line">            if (mOriListener != null) {</div><div class="line">                mOriListener.onClick(view);</div><div class="line">            }</div><div class="line"></div><div class="line">            String text = (String)view.getTag(R.id.hook);</div><div class="line">            Toast.makeText(view.getContext(), text, Toast.LENGTH_LONG).show();</div><div class="line">        }</div><div class="line">    }</div></pre></td></tr></table></figure>
<p>&#x4EE5;&#x4E0A;&#x4EE3;&#x7801;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x6728;&#xFF0C;&#x4E3A;&#x4E86;&#x770B;&#x8D77;&#x6765;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x6211;&#x76F4;&#x63A5;&#x901A;&#x8FC7;&#x6784;&#x9020;&#x51FD;&#x6570;&#x628A;&#x539F;&#x6765;<code>OnClickListener</code>&#x7ED9;&#x4F20;&#x8FC7;&#x6765;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x65B0;&#x7684;<code>HookListener</code>&#x7684;<code>onClick()</code>&#x91CC;&#x628A;&#x539F;&#x6765;&#x7684;&#x4E8B;&#x4EF6;&#x7EE7;&#x7EED;&#x5B8C;&#x6210;&#xFF0C;&#x5E76;&#x52A0;&#x4E0A;&#x81EA;&#x5DF1;&#x60F3;&#x7325;&#x7410;&#x6B32;&#x4E3A;&#x7684;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x8FD9;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x7684;<code>hook</code>&#x4E86;&#x4E00;&#x4E2A;<code>onClick</code>&#x4E8B;&#x4EF6;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x66F4;&#x590D;&#x6742;&#x7684;&#x64CD;&#x4F5C;&#x9700;&#x8981;&#x9605;&#x8BFB;&#x6E90;&#x7801;&#xFF0C;&#x7136;&#x540E;&#x4F5C;&#x76F8;&#x5E94;&#x7684;<code>hook</code>&#x64CD;&#x4F5C;&#x3002;&#x5E0C;&#x671B;&#x5BF9;&#x5927;&#x5BB6;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x6211;&#x4E5F;&#x662F;&#x521D;&#x5B66;&#x8005;&#x3002;</p>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://stareme.wang/2017/01/11/Chromium 提供判断低端机方法/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="stareme">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/uploads/me.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="做另一面的自己">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="做另一面的自己" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2017/01/11/Chromium 提供判断低端机方法/" itemprop="url">
                  Chromium 提供判断低端机方法
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-01-11T22:51:08+08:00">
                2017-01-11
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
              <span class="post-meta-divider">|</span>
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/Chromium/" itemprop="url" rel="index">
                    <span itemprop="name">Chromium</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <a href="/2017/01/11/Chromium 提供判断低端机方法/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2017/01/11/Chromium 提供判断低端机方法/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div></pre></td><td class="code"><pre><div class="line">public static boolean isLowEndDevice() {</div><div class="line">        if(sLowEndDevice == null) {</div><div class="line">            sLowEndDevice = Boolean.valueOf(detectLowEndDevice());</div><div class="line">        }</div><div class="line"></div><div class="line">        return sLowEndDevice.booleanValue();</div><div class="line">    }</div></pre></td></tr></table></figure>
<p>&#x5B9E;&#x73B0;&#xFF1A;<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div></pre></td><td class="code"><pre><div class="line">private static boolean detectLowEndDevice() {</div><div class="line">        assert CommandLine.isInitialized();</div><div class="line"></div><div class="line">        if(CommandLine.getInstance().hasSwitch(&quot;enable-low-end-device-mode&quot;)) {</div><div class="line">            return true;</div><div class="line">        } else if(CommandLine.getInstance().hasSwitch(&quot;disable-low-end-device-mode&quot;)) {</div><div class="line">            return false;</div><div class="line">        } else {</div><div class="line">            int ramSizeKB = amountOfPhysicalMemoryKB();</div><div class="line">            return ramSizeKB &gt; 0 &amp;&amp; ramSizeKB / 1024 &lt; 512;</div><div class="line">        }</div><div class="line">    }</div></pre></td></tr></table></figure></p>
<p>&#x8BFB;&#x53D6; /proc/meminfo &#x76EE;&#x5F55;&#x6B63;&#x5219;&#x5339;&#x914D;&#x51FA;&#x7269;&#x7406;&#x5185;&#x5B58;&#x5730;&#x5740;&#xFF0C;&#x5177;&#x4F53;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;<br><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div><div class="line">17</div><div class="line">18</div><div class="line">19</div><div class="line">20</div><div class="line">21</div><div class="line">22</div><div class="line">23</div><div class="line">24</div><div class="line">25</div><div class="line">26</div><div class="line">27</div><div class="line">28</div><div class="line">29</div><div class="line">30</div><div class="line">31</div><div class="line">32</div><div class="line">33</div><div class="line">34</div><div class="line">35</div><div class="line">36</div><div class="line">37</div><div class="line">38</div><div class="line">39</div><div class="line">40</div><div class="line">41</div><div class="line">42</div><div class="line">43</div><div class="line">44</div></pre></td><td class="code"><pre><div class="line">private static int amountOfPhysicalMemoryKB() {</div><div class="line">        Pattern pattern = Pattern.compile(&quot;^MemTotal:\\s+([0-9]+) kB$&quot;);</div><div class="line">        ThreadPolicy oldPolicy = StrictMode.allowThreadDiskReads();</div><div class="line"></div><div class="line">        try {</div><div class="line">            FileReader e = new FileReader(&quot;/proc/meminfo&quot;);</div><div class="line"></div><div class="line">            try {</div><div class="line">                BufferedReader reader = new BufferedReader(e);</div><div class="line"></div><div class="line">                try {</div><div class="line">                    while(true) {</div><div class="line">                        String line = reader.readLine();</div><div class="line">                        if(line == null) {</div><div class="line">                            Log.w(&quot;SysUtils&quot;, &quot;/proc/meminfo lacks a MemTotal entry?&quot;);</div><div class="line">                            break;</div><div class="line">                        }</div><div class="line"></div><div class="line">                        Matcher m = pattern.matcher(line);</div><div class="line">                        if(m.find()) {</div><div class="line">                            int totalMemoryKB = Integer.parseInt(m.group(1));</div><div class="line">                            if(totalMemoryKB &gt; 1024) {</div><div class="line">                                int var7 = totalMemoryKB;</div><div class="line">                                return var7;</div><div class="line">                            }</div><div class="line"></div><div class="line">                            Log.w(&quot;SysUtils&quot;, &quot;Invalid /proc/meminfo total size in kB: &quot; + m.group(1));</div><div class="line">                            break;</div><div class="line">                        }</div><div class="line">                    }</div><div class="line">                } finally {</div><div class="line">                    reader.close();</div><div class="line">                }</div><div class="line">            } finally {</div><div class="line">                e.close();</div><div class="line">            }</div><div class="line">        } catch (Exception var25) {</div><div class="line">            Log.w(&quot;SysUtils&quot;, &quot;Cannot get total physical size from /proc/meminfo&quot;, var25);</div><div class="line">        } finally {</div><div class="line">            StrictMode.setThreadPolicy(oldPolicy);</div><div class="line">        }</div><div class="line"></div><div class="line">        return 0;</div><div class="line">    }</div></pre></td></tr></table></figure></p>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://stareme.wang/2017/01/06/Api 23+ 代码申请权限问题/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="stareme">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/uploads/me.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="做另一面的自己">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="做另一面的自己" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2017/01/06/Api 23+ 代码申请权限问题/" itemprop="url">
                  Android Api 23+ 权限请求问题
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-01-06T14:37:35+08:00">
                2017-01-06
              </time>
            

            

            
          </span>

          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <a href="/2017/01/06/Api 23+ 代码申请权限问题/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2017/01/06/Api 23+ 代码申请权限问题/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x5982;&#x7533;&#x8BF7; ==PERMISSION_REQUEST_READ_STORAGE==&#x4E3A;&#x4F8B;&#x3002;</p>
<h4 id="1-&#x5728;AndroidManifest&#x7533;&#x8BF7;&#x6743;&#x9650;"><a href="#1-&#x5728;AndroidManifest&#x7533;&#x8BF7;&#x6743;&#x9650;" class="headerlink" title="1.&#x5728;AndroidManifest&#x7533;&#x8BF7;&#x6743;&#x9650;"></a>1.&#x5728;AndroidManifest&#x7533;&#x8BF7;&#x6743;&#x9650;</h4><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div></pre></td><td class="code"><pre><div class="line">&lt;uses-permission android:name=&quot;android.permission.READ_EXTERNAL_STORAGE&quot; /&gt;</div></pre></td></tr></table></figure>
<p>&#x8FD9;&#x6837;&#x8981;&#x662F;&#x5728;Api 23&#x4EE5;&#x4E0B;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x6743;&#x9650;&#x7533;&#x8BF7;&#x5DE5;&#x4F5C;&#x5C31;&#x7B97;&#x5B8C;&#x6210;&#x4E86;&#x3002;</p>
<h4 id="2-onCreate-&#x4E2D;&#x68C0;&#x67E5;&#x6743;&#x9650;&#x662F;&#x5426;&#x88AB;&#x8D4B;&#x4E88;&#xFF0C;"><a href="#2-onCreate-&#x4E2D;&#x68C0;&#x67E5;&#x6743;&#x9650;&#x662F;&#x5426;&#x88AB;&#x8D4B;&#x4E88;&#xFF0C;" class="headerlink" title="2.onCreate &#x4E2D;&#x68C0;&#x67E5;&#x6743;&#x9650;&#x662F;&#x5426;&#x88AB;&#x8D4B;&#x4E88;&#xFF0C;"></a>2.onCreate &#x4E2D;&#x68C0;&#x67E5;&#x6743;&#x9650;&#x662F;&#x5426;&#x88AB;&#x8D4B;&#x4E88;&#xFF0C;</h4><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line">if (ActivityCompat.checkSelfPermission(this, Manifest.permission.READ_EXTERNAL_STORAGE)</div><div class="line">                == PackageManager.PERMISSION_GRANTED) {</div><div class="line">            startMainActivity();</div><div class="line">    }</div></pre></td></tr></table></figure>
<h4 id="3-&#x5982;&#x679C;&#x6743;&#x9650;&#x6CA1;&#x6709;&#x88AB;&#x7533;&#x8BF7;&#xFF0C;&#x5F00;&#x59CB;&#x7533;&#x8BF7;&#x6743;&#x9650;"><a href="#3-&#x5982;&#x679C;&#x6743;&#x9650;&#x6CA1;&#x6709;&#x88AB;&#x7533;&#x8BF7;&#xFF0C;&#x5F00;&#x59CB;&#x7533;&#x8BF7;&#x6743;&#x9650;" class="headerlink" title="3.&#x5982;&#x679C;&#x6743;&#x9650;&#x6CA1;&#x6709;&#x88AB;&#x7533;&#x8BF7;&#xFF0C;&#x5F00;&#x59CB;&#x7533;&#x8BF7;&#x6743;&#x9650;"></a>3.&#x5982;&#x679C;&#x6743;&#x9650;&#x6CA1;&#x6709;&#x88AB;&#x7533;&#x8BF7;&#xFF0C;&#x5F00;&#x59CB;&#x7533;&#x8BF7;&#x6743;&#x9650;</h4><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div></pre></td><td class="code"><pre><div class="line">ActivityCompat.requestPermissions(</div><div class="line">                this,</div><div class="line">                new String[]{Manifest.permission.READ_EXTERNAL_STORAGE},</div><div class="line">                PERMISSION_REQUEST_READ_STORAGE);</div></pre></td></tr></table></figure>
<p>&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x6CE8;&#x91CA;&#x975E;&#x5E38;&#x8BE6;&#x7EC6;&#xFF0C;&#x53EF;&#x4EE5;&#x67E5;&#x770B;api&#x6587;&#x6863;&#x3002;</p>
<h4 id="4-&#x8FD9;&#x4E2A;activity&#x5B9E;&#x73B0;ActivityCompat-OnRequestPermissionsResultCallback&#x63A5;&#x53E3;&#xFF0C;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x662F;&#x5426;&#x6388;&#x6743;&#x4F1A;&#x6709;&#x56DE;&#x8C03;&#x65B9;&#x6CD5;&#xFF1A;"><a href="#4-&#x8FD9;&#x4E2A;activity&#x5B9E;&#x73B0;ActivityCompat-OnRequestPermissionsResultCallback&#x63A5;&#x53E3;&#xFF0C;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x662F;&#x5426;&#x6388;&#x6743;&#x4F1A;&#x6709;&#x56DE;&#x8C03;&#x65B9;&#x6CD5;&#xFF1A;" class="headerlink" title="4.&#x8FD9;&#x4E2A;activity&#x5B9E;&#x73B0;ActivityCompat.OnRequestPermissionsResultCallback&#x63A5;&#x53E3;&#xFF0C;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x662F;&#x5426;&#x6388;&#x6743;&#x4F1A;&#x6709;&#x56DE;&#x8C03;&#x65B9;&#x6CD5;&#xFF1A;"></a>4.&#x8FD9;&#x4E2A;activity&#x5B9E;&#x73B0;ActivityCompat.OnRequestPermissionsResultCallback&#x63A5;&#x53E3;&#xFF0C;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x662F;&#x5426;&#x6388;&#x6743;&#x4F1A;&#x6709;&#x56DE;&#x8C03;&#x65B9;&#x6CD5;&#xFF1A;</h4><figure class="highlight plain"><table><tr><td class="gutter"><pre><div class="line">1</div><div class="line">2</div><div class="line">3</div><div class="line">4</div><div class="line">5</div><div class="line">6</div><div class="line">7</div><div class="line">8</div><div class="line">9</div><div class="line">10</div><div class="line">11</div><div class="line">12</div><div class="line">13</div><div class="line">14</div><div class="line">15</div><div class="line">16</div></pre></td><td class="code"><pre><div class="line">/*</div><div class="line">     * Callback received when a permissions request has been completed.</div><div class="line">     */</div><div class="line">    @Override</div><div class="line">    public void onRequestPermissionsResult(</div><div class="line">            int requestCode, @NonNull String[] permissions, @NonNull int[] grantResults) {</div><div class="line"></div><div class="line">        String permissionResult = &quot;Request code: &quot; + requestCode + &quot;, Permissions: &quot; + permissions</div><div class="line">                + &quot;, Results: &quot; + grantResults;</div><div class="line">        Log.d(TAG, &quot;onRequestPermissionsResult(): &quot; + permissionResult);</div><div class="line"></div><div class="line">        if (requestCode == PERMISSION_REQUEST_READ_STORAGE) {</div><div class="line">            // Close activity regardless of user&apos;s decision (decision picked up in main activity).</div><div class="line">            startMainActivity();</div><div class="line">        }</div><div class="line">    }</div></pre></td></tr></table></figure>

          
        
      
    </div>

    <div>
      
    </div>

    <div>
      
    </div>


    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
  </section>

  
  <nav class="pagination">
    <span class="page-number current">1</span><a class="page-number" href="/page/2/">2</a><a class="extend next" rel="next" href="/page/2/"><i class="fa fa-angle-right"></i></a>
  </nav>



          </div>
          


          

        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel sidebar-panel-active">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/uploads/me.png"
               alt="stareme" />
          <p class="site-author-name" itemprop="name">stareme</p>
          <p class="site-description motion-element" itemprop="description">敢问路在何方</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">16</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/wangbin0802" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/1646304090/profile?topnav=1&wvr=6" target="_blank" title="Weibo">
                  
                    <i class="fa fa-fw fa-weibo"></i>
                  
                  Weibo
                </a>
              </span>
            
          
        </div>

        
        

        
        

        


      </section>

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2021</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">stareme</span>
</div>


<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>


        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.1.0"></script>



  

  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"staremewang"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  








  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
      search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();
    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';
      $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = $( "entry", xmlResponse ).map(function() {
            return {
              title: $( "title", this ).text(),
              content: $("content",this).text(),
              url: $( "url" , this).text()
            };
          }).get();
          var $input = document.getElementById(search_id);
          var $resultContent = document.getElementById(content_id);
          $input.addEventListener('input', function(){
            var matchcounts = 0;
            var str='<ul class=\"search-result-list\">';
            var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
            $resultContent.innerHTML = "";
            if (this.value.trim().length > 1) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var content_index = [];
                var data_title = data.title.trim().toLowerCase();
                var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                var data_url = decodeURIComponent(data.url);
                var index_title = -1;
                var index_content = -1;
                var first_occur = -1;
                // only match artiles with not empty titles and contents
                if(data_title != '') {
                  keywords.forEach(function(keyword, i) {
                    index_title = data_title.indexOf(keyword);
                    index_content = data_content.indexOf(keyword);
                    if( index_title >= 0 || index_content >= 0 ){
                      isMatch = true;
                      if (i == 0) {
                        first_occur = index_content;
                      }
                    }

                  });
                }
                // show search results
                if (isMatch) {
                  matchcounts += 1;
                  str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                  var content = data.content.trim().replace(/<[^>]+>/g,"");
                  if (first_occur >= 0) {
                    // cut out 100 characters
                    var start = first_occur - 20;
                    var end = first_occur + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if(start == 0){
                      end = 50;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    var match_content = content.substring(start, end);
                    // highlight all keywords
                    keywords.forEach(function(keyword){
                      var regS = new RegExp(keyword, "gi");
                      match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                    });

                    str += "<p class=\"search-result\">" + match_content +"...</p>"
                  }
                  str += "</li>";
                }
              })};
            str += "</ul>";
            if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
            if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
            $resultContent.innerHTML = str;
          });
          proceedsearch();
        }
      });}

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>


  

  

  

  


</body>
</html>
