<!doctype html>



  


<html class="theme-next pisces use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="Qzone&amp;#x7684;&amp;#x65E5;&amp;#x5747;&amp;#x89C6;&amp;#x9891;&amp;#x64AD;&amp;#x653E;&amp;#x91CF;&amp;#x5DF2;&amp;#x7ECF;&amp;#x7A81;&amp;#x7834;&amp;#x4E86;10&amp;#x4EBF;&amp;#xFF0C;&amp;#x5176;&amp;#x4E2D;Android&amp;#x7AEF;&amp;#x7684;&amp;#x64AD;&amp;#x653E;&amp;#x91CF;&amp;#x5728;&amp;#">
<meta property="og:type" content="article">
<meta property="og:title" content="QZone视频下载如何做到多快好省">
<meta property="og:url" content="http://stareme.wang/2016/12/12/Qzone视频下载如何做到多快好省？/index.html">
<meta property="og:site_name" content="做另一面的自己">
<meta property="og:description" content="Qzone&amp;#x7684;&amp;#x65E5;&amp;#x5747;&amp;#x89C6;&amp;#x9891;&amp;#x64AD;&amp;#x653E;&amp;#x91CF;&amp;#x5DF2;&amp;#x7ECF;&amp;#x7A81;&amp;#x7834;&amp;#x4E86;10&amp;#x4EBF;&amp;#xFF0C;&amp;#x5176;&amp;#x4E2D;Android&amp;#x7AEF;&amp;#x7684;&amp;#x64AD;&amp;#x653E;&amp;#x91CF;&amp;#x5728;&amp;#">
<meta property="og:updated_time" content="2016-12-12T14:38:37.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="QZone视频下载如何做到多快好省">
<meta name="twitter:description" content="Qzone&amp;#x7684;&amp;#x65E5;&amp;#x5747;&amp;#x89C6;&amp;#x9891;&amp;#x64AD;&amp;#x653E;&amp;#x91CF;&amp;#x5DF2;&amp;#x7ECF;&amp;#x7A81;&amp;#x7834;&amp;#x4E86;10&amp;#x4EBF;&amp;#xFF0C;&amp;#x5176;&amp;#x4E2D;Android&amp;#x7AEF;&amp;#x7684;&amp;#x64AD;&amp;#x653E;&amp;#x91CF;&amp;#x5728;&amp;#">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://stareme.wang/2016/12/12/Qzone视频下载如何做到多快好省？/"/>





  <title> QZone视频下载如何做到多快好省 | 做另一面的自己 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?1b404ff8751a05c0c72a0484de9977f5";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">做另一面的自己</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup">
 <span class="search-icon fa fa-search"></span>
 <input type="text" id="local-search-input">
 <div id="local-search-result"></div>
 <span class="popup-btn-close">close</span>
</div>


    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://stareme.wang/2016/12/12/Qzone视频下载如何做到多快好省？/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="stareme">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/uploads/me.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="做另一面的自己">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="做另一面的自己" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                QZone视频下载如何做到多快好省
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2016-12-12T22:33:31+08:00">
                2016-12-12
              </time>
            

            

            
          </span>

          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <a href="/2016/12/12/Qzone视频下载如何做到多快好省？/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/12/12/Qzone视频下载如何做到多快好省？/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>Qzone&#x7684;&#x65E5;&#x5747;&#x89C6;&#x9891;&#x64AD;&#x653E;&#x91CF;&#x5DF2;&#x7ECF;&#x7A81;&#x7834;&#x4E86;10&#x4EBF;&#xFF0C;&#x5176;&#x4E2D;Android&#x7AEF;&#x7684;&#x64AD;&#x653E;&#x91CF;&#x5728;&#x603B;&#x64AD;&#x653E;&#x91CF;&#x4E2D;&#x7684;&#x5360;&#x6BD4;&#x8D85;&#x8FC7;70%&#xFF0C;&#x76F8;&#x6BD4;&#x5E74;&#x521D;&#xFF0C;&#x64AD;&#x653E;&#x91CF;&#x7684;&#x589E;&#x957F;&#x4E86;&#x8D85;&#x8FC7;10&#x500D;&#x3002;&#x89C6;&#x9891;&#x4E0B;&#x8F7D;&#x662F;&#x6574;&#x4E2A;&#x89C6;&#x9891;&#x64AD;&#x653E;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x5982;&#x679C;&#x4E0B;&#x8F7D;&#x4FA7;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x5219;&#x4F1A;&#x9020;&#x6210;&#x6574;&#x4E2A;&#x89C6;&#x9891;&#x64AD;&#x653E;&#x7684;&#x5931;&#x8D25;&#xFF0C;&#x8FD9;&#x5C31;&#x5BF9;&#x6211;&#x4EEC;&#x7684;&#x89C6;&#x9891;&#x4E0B;&#x8F7D;&#x63D0;&#x51FA;&#x4E86;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x8981;&#x6C42;&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x89C6;&#x9891;&#x4E0B;&#x8F7D;&#x603B;&#x7ED3;&#x4E3A;&#x201D;&#x591A;&#x5FEB;&#x597D;&#x7701;&#x201D;&#x56DB;&#x4E2A;&#x65B9;&#x9762;&#xFF0C;&#x4EE5;&#x4E0B;&#x8F7D;&#x6210;&#x529F;&#x7387;&#x3001;&#x9996;&#x6B21;&#x7F13;&#x51B2;&#x65F6;&#x957F;&#x548C;&#x7F13;&#x51B2;&#x6982;&#x7387;&#x4E3A;&#x4E3B;&#x8981;&#x7684;&#x6280;&#x672F;&#x6307;&#x6807;&#x5BF9;&#x89C6;&#x9891;&#x4E0B;&#x8F7D;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x3002;&#x5177;&#x4F53;&#x53C2;&#x6570;&#x7684;&#x4F18;&#x5316;&#x7ED3;&#x679C;&#x89C1;&#x4E0B;&#x8868;1&#xFF0C;&#x7ECF;&#x8FC7;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x6253;&#x78E8;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x89C6;&#x9891;&#x4E0B;&#x8F7D;&#x6A21;&#x5757;&#x7684;&#x4E0B;&#x8F7D;&#x6210;&#x529F;&#x7387;&#x5DF2;&#x7ECF;&#x8FBE;&#x5230;&#x4E86;99.9%&#xFF0C;&#x89C6;&#x9891;&#x7684;&#x9996;&#x6B21;&#x7F13;&#x51B2;&#x65F6;&#x957F;1.2&#x79D2;&#xFF0C;&#x4E8C;&#x6B21;&#x7F13;&#x51B2;&#x6982;&#x7387;&#x4F4E;&#x4E8E;1%&#xFF0C;&#x53D6;&#x5F97;&#x4E86;&#x826F;&#x597D;&#x7684;&#x6548;&#x679C;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x5C06;&#x4ECE;&#x201D;&#x591A;&#x5FEB;&#x597D;&#x7701;&#x201D;&#x8FD9;&#x56DB;&#x4E2A;&#x65B9;&#x9762;&#xFF0C;&#x5BF9;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x7684;&#x4F18;&#x5316;&#x5DE5;&#x4F5C;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002; </p>
<p>&#x8868;1: &#x4E0B;&#x8F7D;&#x76F8;&#x5173;&#x6280;&#x672F;&#x6307;&#x6807;&#x4F18;&#x5316;&#x524D;&#x540E;&#x5BF9;&#x6BD4;<br>&#x6280;&#x672F;&#x6307;&#x6807; | &#x4E0B;&#x8F7D;&#x6210;&#x529F;&#x7387; | &#x9996;&#x6B21;&#x7F13;&#x51B2;&#x65F6;&#x957F; | &#x7F13;&#x51B2;&#x6982;&#x7387;<br>&#x2014;|&#x2014;&#x2014;|&#x2014;&#x2014;|&#x2014;&#x2014;|&#x2014;&#x2014;&#x2014;|&#x2014;<br>&#x4F18;&#x5316;&#x524D; | 97.1% | 2s | 15%<br>&#x4F18;&#x5316;&#x540E; | 99.9% | 1.2s | 0.9&#xFF05;</p>
<ol>
<li>&#x591A;  </li>
</ol>
<p>&#x5728;10&#x4EBF;&#x8FD9;&#x4E2A;&#x91CF;&#x7EA7;&#x4E0B;&#xFF0C;&#x9664;&#x4E86;&#x4FDD;&#x8BC1;&#x4E0B;&#x8F7D;&#x7684;&#x6210;&#x529F;&#x7387;&#x548C;&#x4E0B;&#x8F7D;&#x901F;&#x5EA6;&#x8FD9;&#x4E9B;&#x4E3B;&#x8981;&#x53C2;&#x6570;&#x4E4B;&#x5916;&#xFF0C;&#x5BF9;&#x4E8E;&#x6574;&#x4E2A;&#x4E0B;&#x8F7D;&#x6D41;&#x7A0B;&#x7684;&#x76D1;&#x63A7;&#x3001;&#x5904;&#x7406;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x663E;&#x5F97;&#x683C;&#x5916;&#x91CD;&#x8981;&#x3002;&#x4E3A;&#x4E86;&#x63D0;&#x5347;&#x89C6;&#x9891;&#x7684;&#x4E0B;&#x8F7D;&#x6210;&#x529F;&#x7387;&#x3001;&#x7A33;&#x5B9A;&#x6027;&#xFF0C;&#x76D1;&#x63A7;&#x6574;&#x4E2A;&#x4E0B;&#x8F7D;&#x6D41;&#x7A0B;&#xFF0C;&#x63D0;&#x5347;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x6211;&#x4EEC;&#x91C7;&#x7528;&#x672C;&#x5730;&#x4EE3;&#x7406;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x89C6;&#x9891;&#x4E0B;&#x8F7D;&#x3002;<br>&#x5728;Android&#x624B;&#x673A;&#x4E0A;&#x64AD;&#x653E;&#x5728;&#x7EBF;&#x89C6;&#x9891;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x5B9E;&#x4F8B;&#x5316;&#x4E00;&#x4E2A;MediaPlayer, &#x5C06;&#x89C6;&#x9891;&#x7684;URL&#x901A;&#x8FC7;setDataSource()&#x8BBE;&#x7F6E;&#x7ED9;&#x64AD;&#x653E;&#x5668;&#xFF0C;&#x4E4B;&#x540E;&#x8C03;&#x7528;prepareAsync()&#x548C;start()&#x904D;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x64AD;&#x653E;&#x89C6;&#x9891;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x5176;&#x4E2D;&#x6700;&#x5927;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6D41;&#x5B8C;&#x5168;&#x7531;MediaPlayer&#x63A7;&#x5236;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#x4E0B;&#x8F7D;&#x548C;&#x64AD;&#x653E;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E5F;&#x5C31;&#x5BFC;&#x81F4;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x63D0;&#x9AD8;&#x6210;&#x529F;&#x7387;&#xFF0C;&#x4F18;&#x5316;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;Android&#x4FA7;&#x7684;&#x89C6;&#x9891;&#x4E0B;&#x8F7D;&#x4E00;&#x822C;&#x91C7;&#x7528;&#x672C;&#x5730;&#x4EE3;&#x7406;&#x7684;&#x65B9;&#x6848;&#x5B9E;&#x73B0;&#x3002;&#x672C;&#x5730;&#x4EE3;&#x7406;&#x7684;&#x65B9;&#x6848;&#x5373;&#x662F;&#x6307;&#x5728;&#x64AD;&#x653E;&#x89C6;&#x9891;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C06;&#x89C6;&#x9891;&#x7684;URL&#x8F6C;&#x6362;&#x4E3A;&#x672C;&#x5730;URL(127.0.0.1&#x5F00;&#x5934;)&#xFF0C;&#x5728;&#x64AD;&#x653E;&#x5668;&#x901A;&#x8FC7;&#x672C;&#x5730;URL&#x8BF7;&#x6C42;&#x89C6;&#x9891;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x672C;&#x5730;&#x4EE3;&#x7406;&#x622A;&#x83B7;&#x8FD9;&#x6B21;&#x8BF7;&#x6C42;&#xFF0C;&#x5728;&#x7ECF;&#x8FC7;&#x672C;&#x5730;&#x7684;&#x5904;&#x7406;&#x903B;&#x8F91;&#x540E;&#xFF0C;&#x5411;&#x670D;&#x52A1;&#x5668;&#x6216;&#x8005;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x8BF7;&#x6C42;&#x6570;&#x636E;&#x3002;&#x672C;&#x5730;&#x4EE3;&#x7406;&#x5728;&#x83B7;&#x5F97;&#x89C6;&#x9891;&#x6570;&#x636E;&#x4E4B;&#x540E;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x8F6C;&#x53D1;&#x7ED9;&#x64AD;&#x653E;&#x5668;&#x3002;</p>
<p>&#x76F8;&#x6BD4;&#x8D77;&#x76F4;&#x63A5;&#x7531;&#x64AD;&#x653E;&#x5668;&#x8BF7;&#x6C42;&#x6570;&#x636E;&#xFF0C;&#x672C;&#x5730;&#x4EE3;&#x7406;&#x7684;&#x4F18;&#x52BF;&#x662F;&#x6570;&#x636E;&#x6D41;&#x7531;&#x672C;&#x5730;&#x4EE3;&#x7406;&#x63A7;&#x5236;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x672C;&#x5730;&#x4EE3;&#x7406;&#x4E2D;&#x52A0;&#x5165;&#x7F13;&#x5B58;&#x3001;&#x9884;&#x52A0;&#x8F7D;&#x3001;&#x9632;&#x76D7;&#x94FE;&#x7B49;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x6781;&#x5927;&#x7684;&#x63D0;&#x5347;&#x89C6;&#x9891;&#x4E0B;&#x8F7D;&#x7684;&#x6210;&#x529F;&#x7387;&#xFF0C;&#x51CF;&#x5C11;&#x89C6;&#x9891;&#x7684;&#x7F13;&#x51B2;&#x65F6;&#x95F4;&#xFF0C;&#x4ECE;&#x800C;&#x63D0;&#x5347;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x3002;</p>
<p>&#x4F20;&#x7EDF;&#x7684;&#x672C;&#x5730;&#x4EE3;&#x7406;&#x65B9;&#x6848;&#x786E;&#x5B9E;&#x89E3;&#x51B3;&#x4E86;&#x64AD;&#x653E;&#x5668;&#x76F4;&#x8FDE;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x540C;&#x6837;&#x4E5F;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x89C6;&#x9891;&#x4E0B;&#x8F7D;&#x548C;&#x64AD;&#x653E;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x590D;&#x6742;&#xFF0C;&#x8FC7;&#x591A;&#x7684;&#x903B;&#x8F91;&#x548C;&#x4E0B;&#x8F7D;&#x672C;&#x8EAB;&#x8026;&#x5408;&#xFF0C;&#x7ED9;&#x5F00;&#x53D1;&#x7684;&#x8FC7;&#x7A0B;&#x5E26;&#x6765;&#x6781;&#x5927;&#x7684;&#x4E0D;&#x4FBF;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x6837;&#x4E5F;&#x4E0D;&#x5BB9;&#x6613;&#x63A5;&#x5165;&#x7B2C;&#x4E09;&#x65B9;&#x7684;&#x4E0B;&#x8F7D;&#x5668;&#x548C;&#x5BF9;&#x4E0B;&#x8F7D;&#x8FC7;&#x7A0B;&#x8FDB;&#x884C;&#x76D1;&#x63A7;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x7ECF;&#x5386;&#x4E86;&#x4E24;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x8FED;&#x4EE3;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6574;&#x4E2A;&#x4E0B;&#x8F7D;&#x8FC7;&#x7A0B;&#x8FDB;&#x884C;&#x91CD;&#x6784;&#x3002;&#x8FD9;&#x6B21;&#x91CD;&#x6784;&#x4F7F;&#x5F97;&#x4E0B;&#x8F7D;&#x5404;&#x6A21;&#x5757;&#x7684;&#x804C;&#x8D23;&#x660E;&#x786E;&#xFF0C;&#x4FBF;&#x4E8E;&#x5F00;&#x53D1;&#x3001;&#x7EF4;&#x62A4;&#x4EE5;&#x53CA;&#x63A5;&#x5165;&#x7B2C;&#x4E09;&#x65B9;&#x7684;&#x4E0B;&#x8F7D;&#xFF0C;&#x4E5F;&#x4E3A;&#x6211;&#x4EEC;&#x540E;&#x7EED;&#x7684;&#x4F18;&#x5316;&#x6253;&#x4E0B;&#x57FA;&#x7840;&#xFF0C;&#x91CD;&#x6784;&#x4E4B;&#x540E;&#x7684;&#x65B9;&#x6848;&#x4F1A;&#x5728;&#x4E4B;&#x540E;&#x5355;&#x72EC;&#x6210;&#x6587;&#x4ECB;&#x7ECD;&#x3002;</p>
<ol>
<li>&#x5FEB;</li>
</ol>
<p>&#x56FD;&#x5916;SmartBear&#x7684;&#x7814;&#x7A76;&#x8868;&#x660E;&#xFF0C;57%&#x7684;&#x7528;&#x6237;&#x5728;3&#x79D2;&#x6CA1;&#x6709;&#x52A0;&#x8F7D;&#x5B8C;&#x7F51;&#x9875;&#x65F6;&#x5C31;&#x4F1A;&#x653E;&#x5F03;&#x3002;&#x5728;&#x89C6;&#x9891;&#x64AD;&#x653E;&#x4E0A;&#xFF0C;&#x52A0;&#x5FEB;&#x89C6;&#x9891;&#x7684;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#xFF0C;&#x51CF;&#x5C11;&#x64AD;&#x653E;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x5361;&#x987F;&#xFF0C;&#x5BF9;&#x63D0;&#x9AD8;&#x7528;&#x6237;&#x89C2;&#x770B;&#x89C6;&#x9891;&#x7684;&#x4F53;&#x9A8C;&#x6709;&#x6781;&#x5927;&#x7684;&#x5E2E;&#x52A9;&#x3002;&#x7ECF;&#x8FC7;&#x6211;&#x4EEC;&#x957F;&#x671F;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x73B0;&#x5728;Qzone&#x89C6;&#x9891;&#x64AD;&#x653E;&#x7684;&#x63A5;&#x8FD1;&#x79D2;&#x5F00;&#xFF0C;&#x7F13;&#x51B2;&#x6982;&#x7387;&#x4E0B;&#x964D;&#x5230;&#x4E0D;&#x5230;1%&#xFF0C;&#x8FD9;&#x6781;&#x5927;&#x7684;&#x63D0;&#x5347;&#x4E86;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x4E5F;&#x4ECE;&#x4FA7;&#x9762;&#x63D0;&#x5347;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x89C6;&#x9891;&#x64AD;&#x653E;&#x91CF;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x6570;&#x636E;&#x63D0;&#x5347;&#x7684;&#x80CC;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x505A;&#x4E86;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#x5DE5;&#x4F5C;&#xFF1A;</p>
<p>2.1&#xFF1A;&#x9632;&#x76D7;&#x94FE;&#x9884;&#x62C9;&#x53D6;</p>
<p>&#x76D7;&#x94FE;&#x64AD;&#x653E;&#x5728;&#x56FD;&#x5185;&#x975E;&#x5E38;&#x666E;&#x904D;&#xFF0C;&#x800C;&#x76D7;&#x94FE;&#x4F1A;&#x4F7F;&#x5E73;&#x53F0;&#x8D44;&#x6E90;&#x6D41;&#x5931;&#xFF0C;&#x589E;&#x52A0;&#x5E26;&#x5BBD;&#x6210;&#x672C;&#xFF0C;&#x4E0D;&#x5229;&#x4E8E;&#x5E73;&#x53F0;&#x7684;&#x957F;&#x671F;&#x53D1;&#x5C55;&#xFF0C;&#x56FD;&#x5185;&#x5927;&#x90E8;&#x5206;&#x89C6;&#x9891;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x5546;&#x90FD;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x505A;&#x4E86;&#x9632;&#x76D7;&#x94FE;&#x3002;&#x9632;&#x76D7;&#x94FE;&#x7684;&#x4E3B;&#x8981;&#x8FC7;&#x7A0B;&#x662F;&#x540E;&#x53F0;&#x4E0B;&#x53D1;&#x7684;&#x89C6;&#x9891;URL&#xFF0C;&#x5728;&#x6B63;&#x5F0F;&#x64AD;&#x653E;&#x4E4B;&#x524D;&#xFF0C;&#x9700;&#x8981;&#x901A;&#x8FC7;URL&#x4E2D;&#x7684;&#x90E8;&#x5206;&#x53C2;&#x6570;&#xFF0C;&#x52A0;&#x4E0A;&#x4E00;&#x4E9B;&#x672C;&#x5730;&#x53C2;&#x6570;&#xFF0C;&#x5411;&#x540E;&#x53F0;&#x62C9;&#x53D6;&#x771F;&#x6B63;&#x64AD;&#x653E;&#x7684;URL, &#x8FD9;&#x4E9B;&#x771F;&#x6B63;&#x64AD;&#x653E;&#x7684;URL&#x90FD;&#x5E26;&#x6709;&#x65F6;&#x6548;&#x6027;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x4ECE;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x907F;&#x514D;&#x76D7;&#x94FE;&#x884C;&#x4E3A;&#x3002;&#x4F46;&#x901A;&#x8FC7;&#x9632;&#x76D7;&#x94FE;&#x63A5;&#x53E3;&#x62C9;&#x53D6;&#x771F;&#x5B9E;&#x7684;&#x64AD;&#x653E;URL&#x9700;&#x8981;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x4E5F;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x5EF6;&#x957F;&#x4E86;&#x7528;&#x6237;&#x611F;&#x77E5;&#x7684;&#x89C6;&#x9891;&#x52A0;&#x8F7D;&#x65F6;&#x95F4;&#x3002;&#x9488;&#x5BF9;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x9632;&#x76D7;&#x94FE;&#x7684;&#x6A21;&#x5757;&#x8FDB;&#x884C;&#x4E86;&#x6539;&#x9020;&#xFF0C;&#x5F15;&#x5165;&#x9884;&#x62C9;&#x53D6;&#x673A;&#x5236;&#xFF0C;&#x5C06;&#x9632;&#x76D7;&#x94FE;&#x7684;&#x62C9;&#x53D6;&#x4E0E;&#x64AD;&#x653E;&#x89E3;&#x8026;&#xFF0C;&#x5BF9;&#x7528;&#x6237;&#x7684;&#x64AD;&#x653E;&#x884C;&#x4E3A;&#x8FDB;&#x884C;&#x9884;&#x5224;&#xFF0C;&#x5728;&#x7528;&#x6237;&#x64AD;&#x653E;&#x89C6;&#x9891;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x63D0;&#x524D;&#x62C9;&#x53D6;&#x5E76;&#x7F13;&#x5B58;&#x4E4B;&#x540E;&#x89C6;&#x9891;&#x7684;URL, &#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x4E86;&#x56E0;&#x4E3A;&#x62C9;&#x53D6;&#x9632;&#x76D7;&#x94FE;URL&#x9020;&#x6210;&#x7684;&#x89C6;&#x9891;&#x7F13;&#x51B2;&#x65F6;&#x95F4;&#x3002;</p>
<p>2.2&#xFF1A;&#x6570;&#x636E;&#x9884;&#x52A0;&#x8F7D;&#xFF1A;</p>
<p>&#x4ECE;MediapPlayer&#x7684;&#x6E90;&#x7801;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF08;AwesomePlayer.cpp&#xFF09;, MediaPlayer&#x9700;&#x8981;&#x4E0B;&#x8F7D;5&#x79D2;&#x7684;&#x6570;&#x636E;&#x624D;&#x4F1A;&#x5F00;&#x59CB;&#x64AD;&#x653E;&#x89C6;&#x9891;&#xFF0C;&#x6309;&#x7167;&#x73B0;&#x5728;&#x7684;&#x5916;&#x7F51;&#x5E73;&#x5C40;&#x4E0B;&#x8F7D;&#x901F;&#x5EA6;&#x8BA1;&#x7B97;&#xFF0C;&#x8BE5;&#x8FC7;&#x7A0B;&#x7684;&#x8017;&#x65F6;&#x5728;&#x63A5;&#x8FD1;1&#x79D2;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x9884;&#x52A0;&#x8F7D;&#x662F;&#x51CF;&#x5C11;&#x89C6;&#x9891;&#x9996;&#x6B21;&#x7F13;&#x51B2;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4F46;&#x89C6;&#x9891;&#x6570;&#x636E;&#x7684;&#x9884;&#x52A0;&#x8F7D;&#x4E0D;&#x80FD;&#x8DDF;&#x5F53;&#x524D;&#x64AD;&#x653E;&#x7684;&#x89C6;&#x9891;&#x62A2;&#x4E0B;&#x8F7D;&#x5E26;&#x5BBD;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4EE5;&#x5F53;&#x524D;&#x64AD;&#x653E;&#x89C6;&#x9891;&#x7684;&#x64AD;&#x653E;&#x8FDB;&#x5EA6;&#x548C;&#x6570;&#x636E;&#x7F13;&#x5B58;&#x91CF;&#x4E3A;&#x7EF4;&#x5EA6;&#xFF0C;&#x5F53;&#x4E24;&#x8005;&#x540C;&#x65F6;&#x8FBE;&#x5230;&#x4E00;&#x4E2A;&#x9600;&#x503C;&#x65F6;&#x5F00;&#x59CB;&#x4E0B;&#x8F7D;&#x4E0B;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x7684;&#x6570;&#x636E;&#x3002;&#x5728;&#x5B9E;&#x8DF5;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x53D1;&#x73B0;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x4E9B;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x7684;&#x539F;&#x56E0;&#xFF0C;MediaPlayer&#x5728;&#x64AD;&#x653E;&#x89C6;&#x9891;&#x4E4B;&#x524D;&#x53EF;&#x80FD;&#x4F1A;&#x8BF7;&#x6C42;&#x4E00;&#x90E8;&#x5206;&#x5C3E;&#x90E8;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x89C6;&#x9891;&#x9884;&#x52A0;&#x8F7D;&#x8FD8;&#x4F1A;&#x52A0;&#x8F7D;&#x4E00;&#x90E8;&#x5206;&#x5C3E;&#x90E8;&#x6570;&#x636E;&#xFF0C;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x7684;&#x4FDD;&#x8BC1;&#x9884;&#x52A0;&#x8F7D;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>2.3&#xFF1A;&#x7F13;&#x5B58;&#x6539;&#x9020;</p>
<p>MediaPlayer&#x52A0;&#x8F7D;&#x672C;&#x5730;&#x89C6;&#x9891;&#x7684;&#x6548;&#x7387;&#x8FDC;&#x9AD8;&#x4E8E;&#x5728;&#x7EBF;&#x4E0B;&#x8F7D;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x7F13;&#x5B58;&#x7684;&#x547D;&#x4E2D;&#x7387;&#x4F1A;&#x76F4;&#x63A5;&#x5F71;&#x54CD;&#x5230;&#x89C6;&#x9891;&#x7F13;&#x51B2;&#x7684;&#x901F;&#x5EA6;&#x3002;&#x6700;&#x521D;&#x7684;&#x7F13;&#x5B58;&#x65B9;&#x6848;&#x662F;&#x9488;&#x5BF9;&#x5355;&#x4E2A;&#x89C6;&#x9891;&#x6309;&#x7167;&#x987A;&#x5E8F;&#x7F13;&#x5B58;&#xFF0C;&#x8FD9;&#x6837;&#x5B9E;&#x73B0;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x65E0;&#x6CD5;&#x5BF9;&#x4E8E;&#x64AD;&#x653E;&#x7A7A;&#x6D1E;&#xFF08;&#x975E;&#x987A;&#x5E8F;&#x64AD;&#x653E;&#x573A;&#x666F;&#xFF0C;&#x4F8B;&#x5982;&#x62D6;&#x52A8;&#x3001;&#x7EED;&#x64AD;&#x7B49;&#xFF09;&#x8FDB;&#x884C;&#x7F13;&#x5B58;&#xFF0C;&#x8FD9;&#x964D;&#x4F4E;&#x4E86;&#x89C6;&#x9891;&#x7684;&#x7F13;&#x5B58;&#x7387;&#x548C;&#x7F13;&#x5B58;&#x547D;&#x4E2D;&#x7387;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x5E26;&#x5BBD;&#x6210;&#x672C;&#x548C;&#x89C6;&#x9891;&#x7684;&#x7F13;&#x51B2;&#x65F6;&#x957F;&#x3002;&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x9488;&#x5BF9;&#x7F13;&#x5B58;&#x6A21;&#x5757;&#x8FDB;&#x884C;&#x4E86;&#x6539;&#x9020;&#xFF0C;&#x5C06;&#x987A;&#x5E8F;&#x7F13;&#x5B58;&#x6539;&#x4E3A;&#x5206;&#x7247;&#x7F13;&#x5B58;&#xFF0C;&#x5373;&#x5C06;&#x5355;&#x4E2A;&#x89C6;&#x9891;&#x7684;&#x7F13;&#x5B58;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x5927;&#x5C0F;&#x8FDB;&#x884C;&#x5206;&#x7247;&#xFF0C;&#x5728;&#x9047;&#x5230;&#x6570;&#x636E;&#x7A7A;&#x6D1E;&#x6216;&#x8005;&#x7F13;&#x5B58;&#x6570;&#x636E;&#x91CF;&#x8FBE;&#x6211;&#x4EEC;&#x8BBE;&#x7F6E;&#x7684;&#x5355;&#x7247;&#x7F13;&#x5B58;&#x4E0A;&#x9650;&#x65F6;&#xFF0C;&#x5F00;&#x542F;&#x4E0B;&#x4E00;&#x4E2A;&#x5206;&#x7247;&#x7F13;&#x5B58;&#xFF0C;&#x786E;&#x4FDD;&#x53EF;&#x4EE5;&#x7F13;&#x5B58;&#x6240;&#x6709;&#x7684;&#x4E0B;&#x8F7D;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x6837;&#x6539;&#x9020;&#x4E4B;&#x540E;&#x6781;&#x5927;&#x7684;&#x63D0;&#x5347;&#x4E86;&#x7F13;&#x5B58;&#x547D;&#x4E2D;&#x7387;&#xFF0C;&#x964D;&#x4F4E;&#x4E86;&#x9996;&#x6B21;&#x7F13;&#x51B2;&#x65F6;&#x95F4;&#x548C;&#x4E8C;&#x6B21;&#x7F13;&#x51B2;&#x7684;&#x6982;&#x7387;&#x3002;</p>
<p>2.4&#xFF1A;&#x6027;&#x80FD;&#x4F18;&#x5316;</p>
<p>&#x68B3;&#x7406;&#x4E0B;&#x8F7D;&#x548C;&#x64AD;&#x653E;&#x8FC7;&#x7A0B;&#x4E2D;&#x6574;&#x4F53;&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x901A;&#x8FC7;&#x5DE5;&#x5177;&#x6392;&#x67E5;&#x6D41;&#x7A0B;&#x4E2D;&#x957F;&#x8017;&#x65F6;&#x7684;&#x70B9;&#x548C;&#x4F18;&#x5316;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x51CF;&#x5C11;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x8017;&#x65F6;&#x548C;&#x64CD;&#x4F5C;&#xFF0C;&#x5E76;&#x5C06;&#x90E8;&#x5206;&#x8017;&#x65F6;&#x903B;&#x8F91;&#x79FB;&#x5165;&#x5B50;&#x7EBF;&#x7A0B;&#xFF1B;&#x4F18;&#x5316;&#x65F6;&#x5E8F;&#xFF0C;&#x5C06;&#x4F8B;&#x5982;&#x56FE;&#x7247;&#x52A0;&#x8F7D;&#x3001;&#x7F13;&#x5B58;IO&#x7B49;&#x91CD;&#x903B;&#x8F91;&#x6267;&#x884C;&#x7684;&#x65F6;&#x673A;&#x540E;&#x79FB;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x89C6;&#x9891;&#x64AD;&#x653E;&#x5173;&#x8054;&#x5EA6;&#x4E0D;&#x9AD8;&#x7684;&#x903B;&#x8F91;&#x4F7F;&#x7528;&#x61D2;&#x52A0;&#x8F7D;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;&#x5BF9;&#x4E8E;&#x89C6;&#x9891;&#x64AD;&#x653E;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x89C6;&#x9891;&#x7F13;&#x51B2;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;CPU&#x548C;IO&#x7684;&#x5360;&#x7528;&#xFF0C;&#x4F7F;&#x5F97;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x8C03;&#x5EA6;&#x66F4;&#x591A;&#x7684;&#x8D44;&#x6E90;&#x5728;&#x89E3;&#x5C01;&#x88C5;&#x3001;&#x89E3;&#x7801;&#x3001;&#x6E32;&#x67D3;&#x7B49;&#x4E0E;&#x64AD;&#x653E;&#x3001;&#x4E0B;&#x8F7D;&#x76F4;&#x63A5;&#x76F8;&#x5173;&#x7684;&#x64CD;&#x4F5C;&#x4E0A;&#xFF0C;&#x8FDB;&#x800C;&#x51CF;&#x5C11;&#x8FD9;&#x90E8;&#x5206;&#x7684;&#x8017;&#x65F6;&#x3002;</p>
<ol>
<li>&#x597D;</li>
</ol>
<p>&#x4E0B;&#x8F7D;&#x7684;&#x6210;&#x529F;&#x7387;&#x662F;&#x4FDD;&#x8BC1;&#x89C6;&#x9891;&#x89C2;&#x770B;&#x4F53;&#x9A8C;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x76EE;&#x524D;Qzone&#x7684;&#x89C6;&#x9891;&#x4E0B;&#x8F7D;&#x6210;&#x529F;&#x7387;&#x5DF2;&#x7ECF;&#x63D0;&#x5347;&#x81F3;99.9%&#xFF0C;&#x8DDF;&#x4E3B;&#x8981;&#x547D;&#x4EE4;&#x5B57;&#x7684;&#x6210;&#x529F;&#x7387;&#x76F8;&#x5F53;&#x3002;&#x56FD;&#x5185;&#x7684;&#x79FB;&#x52A8;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x9519;&#x7EFC;&#x590D;&#x6742;&#xFF0C;&#x4E0D;&#x4EC5;&#x8981;&#x5904;&#x7406;&#x65AD;&#x7F51;&#x3001;&#x6162;&#x901F;&#x3001;&#x6296;&#x52A8;&#x7B49;&#x7F51;&#x7EDC;&#x672C;&#x8EAB;&#x7684;&#x9898;&#xFF0C;&#x8FD8;&#x8981;&#x5904;&#x7406;&#x8DE8;&#x7F51;&#x3001;&#x8FD0;&#x8425;&#x5546;&#x52AB;&#x6301;&#x7B49;&#x56FD;&#x60C5;&#x95EE;&#x9898;&#x3002;&#x4E0B;&#x8F7D;&#x6210;&#x529F;&#x7387;&#x7684;&#x63D0;&#x5347;&#x8FC7;&#x7A0B;&#x975E;&#x5E38;&#x8270;&#x96BE;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x5176;&#x4E2D;&#x4E3B;&#x8981;&#x505A;&#x4E86;&#x4EE5;&#x4E0B;&#x7684;&#x5DE5;&#x4F5C;&#xFF1A;<br>3.1&#xFF1A; IP&#x76F4;&#x51FA;&#x4E0E;&#x7ADE;&#x901F;</p>
<p>&#x901A;&#x8FC7;IP&#x76F4;&#x51FA;&#x51CF;&#x5C11;&#x4E86;DNS&#x52AB;&#x6301;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF1B;&#x5BF9;&#x4E8E;&#x4E0B;&#x5C42;&#x4EE3;&#x7406;&#x7684;&#x89C6;&#x9891;&#x4E0B;&#x8F7D;&#x4E0B;&#x53D1;&#x591A;&#x7EC4;IP&#xFF0C;&#x901A;&#x8FC7;&#x7ADE;&#x901F;&#x8BA1;&#x7B97;&#x672C;&#x5730;&#x6700;&#x4F73;IP&#xFF0C;&#x4F7F;&#x7528;&#x6700;&#x4F73;IP&#x8FDB;&#x884C;&#x76F4;&#x51FA;&#x4E0B;&#x8F7D;&#xFF1B;&#x4E0A;&#x5C42;&#x4EE3;&#x7406;&#x5BF9;&#x4E8E;&#x4E0B;&#x5C42;&#x4EE3;&#x7406;&#x7684;&#x6574;&#x4E2A;&#x4E0B;&#x8F7D;&#x8FC7;&#x7A0B;&#x8FDB;&#x884C;&#x76D1;&#x63A7;&#xFF0C;&#x5728;&#x76D1;&#x6D4B;&#x5230;&#x4E0B;&#x8F7D;&#x901F;&#x5EA6;&#x7F13;&#x6162;&#x6216;&#x8005;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x65F6;&#xFF08;IP&#x8FDE;&#x63A5;&#x5931;&#x8D25;&#x3001;&#x6570;&#x636E;&#x8BFB;&#x53D6;&#x8D85;&#x65F6;&#x7B49;&#xFF09;&#x7ACB;&#x5373;&#x5207;&#x6362;&#x4E0B;&#x8F7D;IP&#xFF0C;&#x51CF;&#x5C11;&#x7528;&#x6237;&#x7684;&#x89C6;&#x9891;&#x52A0;&#x8F7D;&#x65F6;&#x95F4;&#x3002;&#x901A;&#x8FC7;IP&#x76F4;&#x51FA;&#x3001;&#x7ADE;&#x901F;&#x548C;&#x5207;&#x6362;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x4E0B;&#x8F7D;&#x7684;&#x8FDE;&#x63A5;&#x3001;&#x6570;&#x636E;&#x8BFB;&#x53D6;&#x6210;&#x529F;&#x7387;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x56E0;DNS&#x52AB;&#x6301;&#x5BFC;&#x81F4;&#x4E0B;&#x8F7D;&#x5931;&#x8D25;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x540C;&#x65F6;&#x63D0;&#x9AD8;&#x4E86;&#x4E0B;&#x8F7D;&#x901F;&#x5EA6;&#x3002;</p>
<p>3.2&#xFF1A;&#x5BF9;&#x4E8E;&#x94FE;&#x63A5;&#x5931;&#x6548;&#xFF08;403&#xFF09;&#x8FDB;&#x884C;&#x5904;&#x7406;</p>
<p>&#x4E0A;&#x6587;&#xFF08;2.1&#x7AE0;&#x8282;&#xFF09;&#x4E2D;&#x63D0;&#x5230;Qzone&#x89C6;&#x9891;&#x64AD;&#x653E;&#x7684;&#x94FE;&#x63A5;&#x5747;&#x662F;&#x7ECF;&#x8FC7;&#x9632;&#x76D7;&#x94FE;&#x5904;&#x7406;&#xFF0C;&#x5E26;&#x6709;&#x64AD;&#x653E;&#x6548;&#x671F;&#x7684;&#x94FE;&#x63A5;&#xFF0C;&#x8FD9;&#x5C31;&#x4F7F;&#x5F97;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x64AD;&#x653E;&#x7684;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7528;&#x6237;&#x5E0C;&#x671B;&#x64AD;&#x653E;&#x67D0;&#x89C6;&#x9891;&#x65F6;&#xFF0C;&#x8DDF;&#x968F;&#x540E;&#x53F0;&#x4E0B;&#x53D1;&#x7684;&#x89C6;&#x9891;&#x94FE;&#x63A5;&#x5DF2;&#x7ECF;&#x8FC7;&#x671F;&#x5931;&#x6548;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x5219;&#x4F1A;&#x6781;&#x5927;&#x964D;&#x4F4E;&#x4E0B;&#x8F7D;&#x7684;&#x6210;&#x529F;&#x7387;&#x3002;&#x9488;&#x5BF9;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x6839;&#x636E;&#x89C6;&#x9891;&#x7684;&#x4E0D;&#x540C;&#x6765;&#x6E90;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x79CD;&#x60C5;&#x51B5;&#x8FDB;&#x884C;&#x5F02;&#x5316;&#x5904;&#x7406;&#xFF0C;&#x901A;&#x8FC7;&#x5411;&#x540E;&#x53F0;&#x91CD;&#x65B0;&#x62C9;&#x53D6;&#x94FE;&#x63A5;&#x6216;&#x8005;&#x672C;&#x5730;&#x8BA1;&#x7B97;Key&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x56E0;&#x8FDE;&#x63A5;&#x4E2D;&#x7684;Key&#x5931;&#x6548;&#x5BFC;&#x81F4;&#x89C6;&#x9891;&#x65E0;&#x6CD5;&#x64AD;&#x653E;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>3.3&#xFF1A;&#x4E0B;&#x8F7D;&#x547D;&#x4EE4;&#x5B57;&#x62C9;&#x53D6;&#x63A5;&#x5165;&#x79C1;&#x6709;&#x901A;&#x9053;</p>
<p>Qzone&#x5F88;&#x65E9;&#x5C31;&#x5F00;&#x59CB;&#x91C7;&#x7528;&#x7EF4;&#x7EB3;&#x65AF;&#xFF08;WNS, Wireless Network Service&#xFF09;&#x79C1;&#x6709;&#x901A;&#x9053;&#x65B9;&#x6848;&#x8FDB;&#x884C;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x4F20;&#x8F93;&#xFF0C;&#x76F8;&#x6BD4;&#x4F7F;&#x7528;&#x6700;&#x591A;&#x7684;Http&#x65B9;&#x6848;&#xFF0C;WNS&#x901A;&#x8FC7;&#x957F;&#x8FDE;&#x63A5;&#x3001;IP&#x76F4;&#x51FA;&#x3001;&#x63A5;&#x5165;&#x70B9;&#x4F18;&#x5316;&#x3001;&#x6570;&#x636E;&#x538B;&#x7F29;&#x7B49;&#x65B9;&#x6CD5;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x7684;&#x6210;&#x529F;&#x7387;&#x548C;&#x7A33;&#x5B9A;&#x6027;&#x3002;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x4E3B;&#x8981;&#x547D;&#x4EE4;&#x5B57;&#x7684;&#x62C9;&#x53D6;&#x6210;&#x529F;&#x7387;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x539F;&#x6709;&#x7528;Http&#x62C9;&#x53D6;&#x547D;&#x4EE4;&#x5B57;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x6539;&#x9020;&#xFF0C;&#x4F7F;&#x7528;WNS&#x901A;&#x9053;&#x5305;&#x88F9;&#x539F;&#x6765;&#x7684;Http&#x6570;&#x636E;&#x5305;&#xFF0C;&#x5728;&#x540E;&#x53F0;&#x901A;&#x8FC7;WNS&#x901A;&#x9053;&#x6536;&#x5230;&#x539F;&#x6709;&#x7684;&#x8BF7;&#x6C42;&#x540E;&#x518D;&#x5C06;&#x8BF7;&#x6C42;&#x5206;&#x53D1;&#x81F3;&#x5BF9;&#x5E94;&#x7684;&#x540E;&#x53F0;&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x6D41;&#x7A0B;&#x5982;&#x4E0B;&#x56FE;4&#x6240;&#x793A;&#x3002;&#x8FD9;&#x6837;&#x901A;&#x8FC7;&#x4F4E;&#x6210;&#x672C;&#x7684;&#x6539;&#x9020;&#xFF08;&#x4E0D;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x539F;&#x6709;&#x534F;&#x8BAE;&#xFF0C;&#x540E;&#x53F0;&#x76F4;&#x63A5;&#x900F;&#x4F20;&#x57FA;&#x672C;&#x6CA1;&#x6709;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x91CF;&#xFF09;&#xFF0C;&#x501F;&#x7531;WNS&#x63D0;&#x5347;&#x4E86;&#x6574;&#x4E2A;&#x901A;&#x9053;&#x7684;&#x4F20;&#x8F93;&#x8D28;&#x91CF;&#xFF0C;&#x8FDB;&#x800C;&#x4E5F;&#x63D0;&#x9AD8;&#x4E86;&#x89C6;&#x9891;&#x7684;&#x4E0B;&#x8F7D;&#x6210;&#x529F;&#x7387;&#x3002;</p>
<p>3.4&#xFF1A;&#x4E0B;&#x8F7D;&#x901F;&#x7387;&#x52A8;&#x6001;&#x8C03;&#x8282;</p>
<p>&#x5728;&#x79FB;&#x52A8;&#x7F51;&#x7EDC;&#x4E0B;&#xFF0C;&#x53D1;&#x751F;&#x7F51;&#x7EDC;&#x6296;&#x52A8;&#x548C;&#x7F51;&#x7EDC;&#x5207;&#x6362;&#x7ECF;&#x5E38;&#x53D1;&#x751F;&#xFF0C;&#x4F46;&#x7F51;&#x7EDC;&#x4E0D;&#x7A33;&#x5B9A;&#xFF0C;&#x5BF9;&#x4E0B;&#x8F7D;&#x6765;&#x8BF4;&#x662F;&#x975E;&#x5E38;&#x81F4;&#x547D;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x5E94;&#x5BF9;&#x7F51;&#x7EDC;&#x6296;&#x52A8;&#x548C;&#x7F51;&#x7EDC;&#x5207;&#x6362;&#xFF0C;&#x4E0B;&#x5C42;&#x4EE3;&#x7406;&#x4F1A;&#x76D1;&#x542C;&#x5F53;&#x524D;&#x7684;&#x7F51;&#x7EDC;&#x53D8;&#x5316;&#xFF0C;&#x76D1;&#x63A7;&#x5F53;&#x524D;&#x7684;&#x4E0B;&#x8F7D;&#x901F;&#x5EA6;&#x3002;&#x4E0B;&#x5C42;&#x4EE3;&#x7406;&#x5728;&#x4E0B;&#x8F7D;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x5BF9;&#x4E8E;&#x522B;&#x7684;&#x4E1A;&#x52A1;&#x5F71;&#x54CD;&#xFF0C;&#x4E0D;&#x4F1A;&#x5360;&#x7528;&#x5168;&#x90E8;&#x7684;&#x5E26;&#x5BBD;&#xFF0C;&#x4F46;&#x5F53;&#x53D1;&#x751F;&#x9891;&#x7E41;&#x7684;&#x7F51;&#x7EDC;&#x5207;&#x6362;&#x65F6;&#xFF0C;&#x4E0B;&#x8F7D;&#x4EE3;&#x7406;&#x4F1A;&#x4E3B;&#x52A8;&#x7A81;&#x7834;&#x901F;&#x5EA6;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x5FEB;&#x7684;&#x5728;&#x7F51;&#x7EDC;&#x60C5;&#x51B5;&#x826F;&#x597D;&#x65F6;&#x4E0B;&#x8F7D;&#x6570;&#x636E;&#xFF0C;&#x7ED9;&#x4E4B;&#x540E;&#x7684;&#x64AD;&#x653E;&#x7559;&#x4E0B;&#x8DB3;&#x591F;&#x7684;&#x6570;&#x636E;Buffer&#xFF0C;&#x4FDD;&#x8BC1;&#x6574;&#x4F53;&#x64AD;&#x653E;&#x7684;&#x6D41;&#x7545;&#x6027;&#x3002;</p>
<ol>
<li>&#x7701;</li>
</ol>
<p>&#x4E92;&#x8054;&#x7F51;&#x7684;&#x89C6;&#x9891;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x5546;&#x5728;&#x56FD;&#x5185;&#x76C8;&#x5229;&#x6781;&#x5176;&#x56F0;&#x96BE;&#xFF0C;&#x9664;&#x4E86;&#x8FD1;&#x51E0;&#x5E74;&#x89C6;&#x9891;&#x5E02;&#x573A;&#x7ADE;&#x4E89;&#x8D8A;&#x6765;&#x8D8A;&#x6FC0;&#x70C8;&#xFF0C;&#x7248;&#x6743;&#x8D39;&#x5C45;&#x9AD8;&#x4E0D;&#x4E0B;&#x4E4B;&#x5916;&#xFF0C;&#x56FD;&#x5185;&#x9AD8;&#x6602;&#x7684;&#x5E26;&#x5BBD;&#x6210;&#x672C;&#x4E5F;&#x662F;&#x91CD;&#x8981;&#x539F;&#x56E0;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x4F55;&#x5728;&#x4FDD;&#x8BC1;&#x89C6;&#x9891;&#x8D28;&#x91CF;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x51CF;&#x5C11;&#x4E0B;&#x8F7D;&#x6D41;&#x91CF;&#xFF0C;&#x51CF;&#x5C11;&#x4E0B;&#x8F7D;&#x800C;&#x4EA7;&#x751F;&#x7684;&#x5E26;&#x5BBD;&#x6210;&#x672C;&#xFF0C;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x6765;&#x8BF4;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x5728;&#x8FD9;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x7684;&#x5DE5;&#x4F5C;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>4.1: &#x6D41;&#x91CF;&#x63A7;&#x5236;</p>
<p>&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x7528;&#x6237;&#x89C2;&#x770B;&#x7684;&#x6D41;&#x7545;&#x6027;&#xFF0C;&#x51CF;&#x5C11;&#x89C6;&#x9891;&#x7F13;&#x51B2;&#xFF0C;&#x89C6;&#x9891;&#x6570;&#x636E;&#x4E0B;&#x8F7D;&#x7684;&#x53EF;&#x64AD;&#x653E;&#x91CF;&#x4E0E;&#x5F53;&#x524D;&#x89C2;&#x770B;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x4E4B;&#x524D;&#x4F1A;&#x4FDD;&#x6301;&#x4E00;&#x5B9A;&#x7684;Buffer&#xFF0C;&#x5728;&#x6574;&#x4E2A;&#x64AD;&#x653E;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x52A8;&#x6001;&#x8C03;&#x8282;&#x4E0B;&#x8F7D;&#x901F;&#x5EA6;&#xFF0C;&#x8FD9;&#x4E2A;Buffer&#x7684;&#x5927;&#x5C0F;&#x57FA;&#x672C;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x5E76;&#x4E14;Buffer&#x7684;&#x5927;&#x5C0F;&#x53EF;&#x4EE5;&#x52A8;&#x6001;&#x8C03;&#x8282;&#x3002;&#x5728;&#x6D41;&#x91CF;&#x9AD8;&#x5CF0;&#x7684;&#x65F6;&#x95F4;&#x6BB5;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x901A;&#x8FC7;&#x540E;&#x53F0;&#x8FDB;&#x884C;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#xFF0C;&#x51CF;&#x5C11;Buffer&#xFF0C;&#x4E5F;&#x5C31;&#x51CF;&#x5C11;&#x4E86;&#x9AD8;&#x5CF0;&#x65F6;&#x6BB5;&#x6574;&#x4F53;&#x7684;&#x4E0B;&#x8F7D;&#x91CF;&#x3002;&#x5E26;&#x5BBD;&#x7684;&#x8BA1;&#x8D39;&#x6807;&#x51C6;&#x4E00;&#x822C;&#x6309;&#x7167;&#x9AD8;&#x5CF0;&#x6D41;&#x91CF;&#x8BA1;&#x8D39;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x9AD8;&#x5CF0;&#x65F6;&#x6BB5;&#x7684;&#x6D41;&#x91CF;&#xFF0C;&#x4E5F;&#x5C31;&#x964D;&#x4F4E;&#x4E86;&#x5E26;&#x5BBD;&#x6210;&#x672C;&#x3002;&#x5177;&#x4F53;&#x6D41;&#x63A7;&#x5982;&#x4E0B;&#x56FE;&#xFF0C;&#x9AD8;&#x5CF0;&#x65F6;&#x6BB5;&#x89C6;&#x9891;&#x7F13;&#x51B2;M&#x79D2;&#xFF0C;&#x975E;&#x9AD8;&#x5CF0;&#x65F6;&#x6BB5;&#x7F13;&#x51B2;N&#x79D2;&#xFF0C;N&gt;M&#xFF0C;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x5747;&#x53EF;&#x7531;&#x540E;&#x53F0;&#x63A7;&#x5236;&#x3002;</p>
<p>4.2: H265&#x7F16;&#x7801;</p>
<p>H265&#x662F;&#x65B0;&#x4E00;&#x4EE3;&#x89C6;&#x9891;&#x7F16;&#x7801;&#x6807;&#x51C6;&#xFF0C;&#x76F8;&#x6BD4;&#x539F;&#x6709;&#x4F7F;&#x7528;H264&#x7F16;&#x7801;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x5177;&#x6709;&#x66F4;&#x9AD8;&#x7684;&#x538B;&#x7F29;&#x6BD4;&#xFF0C;&#x5728;&#x753B;&#x8D28;&#x8FD1;&#x4F3C;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;H265&#x7F16;&#x7801;&#x7684;&#x89C6;&#x9891;&#x6587;&#x4EF6;&#x4F53;&#x79EF;&#x53EA;&#x6709;H264&#x7684;&#x4E00;&#x534A;&#x751A;&#x81F3;&#x66F4;&#x5C11;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x64AD;&#x653E;H265&#x7F16;&#x7801;&#x7684;&#x89C6;&#x9891;&#x80FD;&#x6781;&#x5927;&#x51CF;&#x5C11;&#x5E26;&#x5BBD;&#x6D88;&#x8017;&#x3002;&#x4F46;H265&#x73B0;&#x9636;&#x6BB5;&#x4E3B;&#x8981;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;&#x662F;&#x7EC8;&#x7AEF;&#x7F16;&#x7801;&#x8017;&#x65F6;&#x8FC7;&#x957F;&#xFF0C;&#x540E;&#x53F0;&#x7F16;&#x7801;&#x8FC7;&#x4E8E;&#x6D88;&#x8017;&#x8D44;&#x6E90;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;Android&#x624B;&#x673A;&#x4E0A;&#xFF0C;&#x8F6F;&#x89E3;&#x7801;&#xFF08;Android&#x652F;&#x6301;H265&#x786C;&#x89E3;&#x7801;&#x7684;&#x673A;&#x578B;&#x8F83;&#x5C11;&#xFF0C;&#x5E76;&#x4E14;&#x786C;&#x89E3;&#x7801;&#x7684;&#x517C;&#x5BB9;&#x6027;&#x95EE;&#x9898;&#x76F8;&#x6BD4;&#x8F6F;&#x89E3;&#x66F4;&#x591A;&#xFF09;&#x5E26;&#x6765;&#x7684;&#x8017;&#x7535;&#x3001;&#x53D1;&#x70ED;&#x4EE5;&#x53CA;&#x517C;&#x5BB9;&#x6027;&#x95EE;&#x9898;&#x3002;&#x76EE;&#x524D;&#xFF0C;Qzone&#x901A;&#x8FC7;&#x81EA;&#x89E3;&#x7801;&#x64AD;&#x653E;&#x5668;&#xFF0C;&#x5728;&#x7ECF;&#x8FC7;&#x5927;&#x91CF;&#x7684;&#x517C;&#x5BB9;&#x6027;&#x6D4B;&#x8BD5;&#x4E4B;&#x540E;&#xFF0C;&#x5DF2;&#x7ECF;&#x5728;&#x8D85;&#x8FC7;100&#x6B3E;&#x4E3B;&#x6D41;Android&#x624B;&#x673A;&#x4E0A;&#x5B9E;&#x73B0;&#x4E86;H265&#x89C6;&#x9891;&#x7684;&#x8F6F;&#x89E3;&#x64AD;&#x653E;&#x3002;&#x7A7A;&#x95F4;&#x89C6;&#x9891;H265&#x548C;H264&#x7F16;&#x7801;&#x7684;&#x4E0B;&#x8F7D;&#x5E26;&#x5BBD;&#x5BF9;&#x6BD4;&#x4EE5;&#x53CA;&#x4E4B;&#x540E;&#x7684;&#x9884;&#x671F;&#x60C5;&#x51B5;&#x5982;&#x4E0B;&#x56FE;6&#x6240;&#x793A;&#xFF0C;&#x53EF;&#x4EE5;&#x660E;&#x663E;&#x770B;&#x51FA;&#xFF0C;&#x901A;&#x8FC7;H265&#x7F16;&#x7801;&#x6781;&#x5927;&#x7684;&#x964D;&#x4F4E;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x89C6;&#x9891;&#x4E0B;&#x8F7D;&#x5E26;&#x5BBD;&#x6210;&#x672C;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x5728;2.3&#x4E2D;&#x8BBA;&#x8FF0;&#x5BF9;&#x4E8E;&#x89C6;&#x9891;&#x7F13;&#x5B58;&#x7684;&#x5206;&#x7247;&#x6539;&#x9020;&#xFF0C;&#x540C;&#x65F6;&#x63D0;&#x5347;&#x4E86;&#x4E0B;&#x8F7D;&#x6570;&#x636E;&#x7F13;&#x5B58;&#x7684;&#x4F7F;&#x7528;&#x7387;&#x548C;&#x547D;&#x4E2D;&#x7387;&#xFF0C;&#x4E5F;&#x4E86;&#x51CF;&#x5C11;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x89C6;&#x9891;&#x4E0B;&#x8F7D;&#x5E26;&#x5BBD;&#x3002;</p>
<ol>
<li>&#x603B;&#x7ED3;  </li>
</ol>
<p>&#x7ECF;&#x8FC7;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x4F18;&#x5316;&#xFF0C;Qzone&#x89C6;&#x9891;&#x4E1A;&#x52A1;&#xFF0C;&#x5305;&#x62EC;&#x4E0B;&#x8F7D;&#x6210;&#x529F;&#x7387;&#x3001;&#x64AD;&#x653E;&#x6210;&#x529F;&#x7387;&#x3001;&#x7F13;&#x51B2;&#x6982;&#x7387;&#x3001;&#x9996;&#x6B21;&#x7F13;&#x51B2;&#x65F6;&#x957F;&#x7B49;&#x5728;&#x5185;&#x7684;&#x4E3B;&#x8981;&#x6280;&#x672F;&#x6307;&#x6807;&#xFF0C;&#x5747;&#x5F97;&#x5230;&#x4E86;&#x5927;&#x5E45;&#x5EA6;&#x7684;&#x63D0;&#x5347;&#xFF0C;&#x8FBE;&#x5230;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x9884;&#x671F;&#xFF0C;&#x4E5F;&#x4E3A;Qzone&#x89C6;&#x9891;&#x70B9;&#x64AD;&#x548C;&#x76F4;&#x64AD;&#x4E1A;&#x52A1;&#x7684;&#x6301;&#x7EED;&#x53D1;&#x529B;&#x94FA;&#x5E73;&#x4E86;&#x9053;&#x8DEF;&#x3002;&#x4F46;&#x6280;&#x672F;&#x4F18;&#x5316;&#x662F;&#x4E00;&#x4E2A;&#x957F;&#x671F;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x76EE;&#x524D;Qzone&#x7684;&#x89C6;&#x9891;&#x64AD;&#x653E;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x542F;&#x7528;&#x81EA;&#x89E3;&#x7801;&#x64AD;&#x653E;&#x5668;&#xFF0C;&#x9010;&#x6B65;&#x66FF;&#x6362;&#x539F;&#x751F;&#x7684;MediaPlayer&#xFF0C;&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x8FD8;&#x4F1A;&#x901A;&#x8FC7;&#x64AD;&#x653E;&#x5668;&#x591A;&#x5B9E;&#x4F8B;&#xFF0C;&#x7F16;&#x89E3;&#x7801;&#xFF0C;&#x53C2;&#x6570;&#x8C03;&#x8282;&#x7B49;&#x65B9;&#x5F0F;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x5347;&#x89C6;&#x9891;&#x4E0B;&#x8F7D;&#x6210;&#x529F;&#x7387;&#xFF0C;&#x538B;&#x7F29;&#x89C6;&#x9891;&#x7F13;&#x51B2;&#x65F6;&#x95F4;&#xFF0C;&#x51CF;&#x5C11;&#x7F13;&#x51B2;&#x6982;&#x7387;&#x3002;&#x4E5F;&#x6B22;&#x8FCE;&#x5404;&#x4F4D;&#x591A;&#x4F7F;&#x7528;Qzone&#x4F53;&#x9A8C;&#x6211;&#x4EEC;&#x5728;&#x5404;&#x4E2A;&#x573A;&#x666F;&#x4E2D;&#x7684;&#x89C6;&#x9891;&#x64AD;&#x653E;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x4F53;&#x9A8C;&#x6216;&#x8005;&#x6280;&#x672F;&#x4F18;&#x5316;&#x7684;&#x5EFA;&#x8BAE;&#x548C;&#x610F;&#x89C1;&#xFF0C;&#x6B22;&#x8FCE;&#x4EA4;&#x6D41;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/12/11/Gitlab 工作流程/" rel="next" title="代码Review流程与操作步骤">
                <i class="fa fa-chevron-left"></i> 代码Review流程与操作步骤
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/12/14/手机浏览器广告拦截功能文档/" rel="prev" title="手机浏览器广告拦截实现及自动化测试">
                手机浏览器广告拦截实现及自动化测试 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/12/12/Qzone视频下载如何做到多快好省？/"
           data-title="QZone视频下载如何做到多快好省" data-url="http://stareme.wang/2016/12/12/Qzone视频下载如何做到多快好省？/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel sidebar-panel-active">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/uploads/me.png"
               alt="stareme" />
          <p class="site-author-name" itemprop="name">stareme</p>
          <p class="site-description motion-element" itemprop="description">敢问路在何方</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">12</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">4</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/wangbin0802" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/1646304090/profile?topnav=1&wvr=6" target="_blank" title="Weibo">
                  
                    <i class="fa fa-fw fa-weibo"></i>
                  
                  Weibo
                </a>
              </span>
            
          
        </div>

        
        

        
        

        


      </section>

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">stareme</span>
</div>


<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>


        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.1.0"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"staremewang"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  








  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
      search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();
    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';
      $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = $( "entry", xmlResponse ).map(function() {
            return {
              title: $( "title", this ).text(),
              content: $("content",this).text(),
              url: $( "url" , this).text()
            };
          }).get();
          var $input = document.getElementById(search_id);
          var $resultContent = document.getElementById(content_id);
          $input.addEventListener('input', function(){
            var matchcounts = 0;
            var str='<ul class=\"search-result-list\">';
            var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
            $resultContent.innerHTML = "";
            if (this.value.trim().length > 1) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var content_index = [];
                var data_title = data.title.trim().toLowerCase();
                var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                var data_url = decodeURIComponent(data.url);
                var index_title = -1;
                var index_content = -1;
                var first_occur = -1;
                // only match artiles with not empty titles and contents
                if(data_title != '') {
                  keywords.forEach(function(keyword, i) {
                    index_title = data_title.indexOf(keyword);
                    index_content = data_content.indexOf(keyword);
                    if( index_title >= 0 || index_content >= 0 ){
                      isMatch = true;
                      if (i == 0) {
                        first_occur = index_content;
                      }
                    }

                  });
                }
                // show search results
                if (isMatch) {
                  matchcounts += 1;
                  str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                  var content = data.content.trim().replace(/<[^>]+>/g,"");
                  if (first_occur >= 0) {
                    // cut out 100 characters
                    var start = first_occur - 20;
                    var end = first_occur + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if(start == 0){
                      end = 50;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    var match_content = content.substring(start, end);
                    // highlight all keywords
                    keywords.forEach(function(keyword){
                      var regS = new RegExp(keyword, "gi");
                      match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                    });

                    str += "<p class=\"search-result\">" + match_content +"...</p>"
                  }
                  str += "</li>";
                }
              })};
            str += "</ul>";
            if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
            if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
            $resultContent.innerHTML = str;
          });
          proceedsearch();
        }
      });}

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>


  

  

  

  


</body>
</html>
