<!doctype html>



  


<html class="theme-next pisces use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="&amp;#x597D;&amp;#x5DE7;&amp;#x4E0D;&amp;#x5DE7;&amp;#xFF0C;&amp;#x4ECA;&amp;#x5E74;&amp;#x5B8C;&amp;#x6625;&amp;#x8282;&amp;#x6765;&amp;#x65B0;&amp;#x52A0;&amp;#x5761;&amp;#x521A;&amp;#x597D;&amp;#x662F;13&amp;#x53F7;&amp;#xFF0C;&amp;#x4E00;&amp;#x4E2A;&amp;#x4E24;&amp;#x5E74;&amp;#x524D;&amp;#x98C">
<meta property="og:type" content="article">
<meta property="og:title" content="工作中的负能量">
<meta property="og:url" content="http://stareme.wang/2018/12/22/工作中的负能量/index.html">
<meta property="og:site_name" content="做另一面的自己">
<meta property="og:description" content="&amp;#x597D;&amp;#x5DE7;&amp;#x4E0D;&amp;#x5DE7;&amp;#xFF0C;&amp;#x4ECA;&amp;#x5E74;&amp;#x5B8C;&amp;#x6625;&amp;#x8282;&amp;#x6765;&amp;#x65B0;&amp;#x52A0;&amp;#x5761;&amp;#x521A;&amp;#x597D;&amp;#x662F;13&amp;#x53F7;&amp;#xFF0C;&amp;#x4E00;&amp;#x4E2A;&amp;#x4E24;&amp;#x5E74;&amp;#x524D;&amp;#x98C">
<meta property="og:updated_time" content="2018-12-22T08:57:46.213Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="工作中的负能量">
<meta name="twitter:description" content="&amp;#x597D;&amp;#x5DE7;&amp;#x4E0D;&amp;#x5DE7;&amp;#xFF0C;&amp;#x4ECA;&amp;#x5E74;&amp;#x5B8C;&amp;#x6625;&amp;#x8282;&amp;#x6765;&amp;#x65B0;&amp;#x52A0;&amp;#x5761;&amp;#x521A;&amp;#x597D;&amp;#x662F;13&amp;#x53F7;&amp;#xFF0C;&amp;#x4E00;&amp;#x4E2A;&amp;#x4E24;&amp;#x5E74;&amp;#x524D;&amp;#x98C">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://stareme.wang/2018/12/22/工作中的负能量/"/>





  <title> 工作中的负能量 | 做另一面的自己 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?1b404ff8751a05c0c72a0484de9977f5";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">做另一面的自己</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup">
 <span class="search-icon fa fa-search"></span>
 <input type="text" id="local-search-input">
 <div id="local-search-result"></div>
 <span class="popup-btn-close">close</span>
</div>


    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://stareme.wang/2018/12/22/工作中的负能量/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="stareme">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/uploads/me.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="做另一面的自己">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="做另一面的自己" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                工作中的负能量
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2018-12-22T16:47:43+08:00">
                2018-12-22
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
              <span class="post-meta-divider">|</span>
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/新加坡/" itemprop="url" rel="index">
                    <span itemprop="name">新加坡</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <a href="/2018/12/22/工作中的负能量/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2018/12/22/工作中的负能量/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x597D;&#x5DE7;&#x4E0D;&#x5DE7;&#xFF0C;&#x4ECA;&#x5E74;&#x5B8C;&#x6625;&#x8282;&#x6765;&#x65B0;&#x52A0;&#x5761;&#x521A;&#x597D;&#x662F;13&#x53F7;&#xFF0C;&#x4E00;&#x4E2A;&#x4E24;&#x5E74;&#x524D;&#x98CE;&#x5C18;&#x4EC6;&#x4EC6;&#x5E26;&#x7740;&#x5E0C;&#x671B;&#x6765;&#x65B0;&#x52A0;&#x5761;&#x7684;&#x5E74;&#x8F7B;&#x4EBA;&#xFF0C;&#x73B0;&#x5728;&#x597D;&#x50CF;&#x6CA1;&#x6709;&#x4E86;&#x5F53;&#x65F6;&#x7684;&#x671D;&#x6C14;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x6709;&#x4E9B;&#x4E27;&#x6C14;&#x3002;</p>
<p>&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x5728;&#x516C;&#x53F8;&#x7ECF;&#x5386;&#x4E86;&#x592A;&#x591A;&#x8D1F;&#x9762;&#x60C5;&#x7EEA;&#xFF0C;&#x4E8B;&#x60C5;&#x7684;&#x7ECF;&#x8FC7;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x5728;cto&#x5E26;&#x9886;&#x7740;server&#x56E2;&#x961F;&#x93D6;&#x6218;&#x9ED1;&#x5BA2;&#x7684;&#x4E00;&#x7FFB;&#x6218;&#x4E89;&#x4E2D;&#xFF0C;&#x7ED9;&#x6211;&#x4EEC;&#x670D;&#x52A1;&#x5E26;&#x6765;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x521B;&#x4F24;&#xFF0C;&#x6B64;&#x65F6;&#x6B63;&#x503C;&#x7F51;&#x7EA2;&#x4ECE;&#x6211;&#x4EEC;&#x5E73;&#x53F0;&#x8F6C;&#x5411;&#x5176;&#x4ED6;&#x5E73;&#x53F0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x867D;&#x7136;&#x6700;&#x7EC8;&#x9ED1;&#x5BA2;&#x88AB;&#x8D76;&#x8D70;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x95F4;&#x628A;&#x7528;&#x6237;&#x8E22;&#x8D70;&#xFF0C;&#x786E;&#x5B9E;&#x5F71;&#x54CD;&#x4E86;&#x4E0D;&#x5C11;&#x7528;&#x6237;&#x3002;&#x5728;&#x6709;&#x4E2A;&#x665A;&#x4E0A;brain challenge&#x8FD9;&#x6B3E;&#x6E38;&#x620F;&#x5728;server&#x7AEF;&#x4F18;&#x5316;&#x7684;&#x65F6;&#x5019;&#x53C8;&#x51FA;&#x73B0;&#x4E86;&#x6BDB;&#x75C5;&#xFF0C;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x5927;&#x4E3A;&#x607C;&#x6012;&#xFF0C;&#x8BA4;&#x4E3A;&#x6280;&#x672F;&#x505A;&#x4E86;&#x5F88;&#x591A;&#x65E0;&#x7528;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x60F3;&#x627E;&#x8D23;&#x4EFB;&#x4EBA;&#xFF0C;&#x8868;&#x9762;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x719F;&#x4E0D;&#x77E5;&#xFF0C;&#x516C;&#x53F8;&#x8FD9;&#x65F6;&#x5019;&#x538B;&#x529B;&#x5DF2;&#x7ECF;&#x6765;&#x4E86;&#xFF0C;&#x8D44;&#x91D1;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x8FD9;&#x6837;&#x8FC7;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x5927;&#x5BB6;&#x4E5F;&#x6CA1;&#x6709;&#x592A;&#x5728;&#x610F;&#xFF0C;&#x5DE5;&#x4F5C;&#x8FD8;&#x662F;&#x6B63;&#x5E38;&#x8FDB;&#x884C;&#xFF0C;&#x76F4;&#x5230;&#x6709;&#x4E00;&#x5929;&#xFF0C;&#x8001;&#x677F;&#x4E00;&#x5C01;&#x90AE;&#x4EF6;&#xFF0C;&#x6253;&#x7834;&#x4E86;&#x5E73;&#x9759;&#xFF1A;&#x4E3A;&#x4E86;&#x516C;&#x53F8;&#x7684;&#x6B63;&#x5E38;&#x8FD0;&#x4F5C;&#xFF0C;&#x4ECA;&#x5E74;&#x7684;&#x5B63;&#x5EA6;&#x5956;&#x91D1;&#x548C;&#x5E74;&#x7EC8;&#x5956;&#x90FD;&#x5C06;&#x5EF6;&#x8FDF;&#x53D1;&#x653E;&#xFF0C;&#x8FD9;&#x53EF;&#x662F;&#x5927;&#x5BB6;&#x4E00;&#x5E74;&#x7684;&#x671F;&#x76FC;&#xFF0C;&#x8BA4;&#x771F;&#x5DE5;&#x4F5C;&#x8F9B;&#x82E6;&#x4E86;&#x6574;&#x5E74;&#xFF0C;&#x90FD;&#x5E0C;&#x671B;&#x8FC7;&#x5E74;&#x6709;&#x4E9B;&#x6536;&#x83B7;&#xFF0C;&#x77E5;&#x9053;&#x6709;&#x591A;&#x5C11;&#x4EBA;&#x662F;&#x51C6;&#x5907;&#x7740;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x6708;&#x5DE5;&#x8D44;&#x548C;&#x5E74;&#x7EC8;&#x5956;&#x56DE;&#x5BB6;&#x8FC7;&#x5E74;&#x7684;&#x4E48;&#xFF1B;&#x56FD;&#x5185;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x90FD;&#x662F;3&#x4E2A;&#x6708;&#x4EE5;&#x540E;&#xFF0C;&#x95EE;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x65F6;&#x5019;&#x6CA1;&#x6709;&#xFF0C;&#x8FD9;&#x4F1A;&#x4E0D;&#x514D;&#x6709;&#x4E9B;&#x5C34;&#x5C2C;&#x3002;&#x5B63;&#x5EA6;&#x5956;&#x4E5F;&#x662F;&#xFF0C;&#x5F53;&#x5927;&#x5BB6;&#x671F;&#x5F85;&#x5DF2;&#x4E45;&#xFF0C;&#x800C;&#x4E14;&#x770B;&#x6536;&#x5165;&#x66F2;&#x7EBF;&#x90FD;&#x8FD8;&#x826F;&#x597D;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5FFD;&#x7136;&#x4E2D;&#x6B62;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5F81;&#x7167;&#xFF0C;&#x8FD9;&#x6837;&#x8FD8;&#x662F;&#x5F88;&#x4F24;&#x5927;&#x5BB6;&#x7684;&#x5FC3;&#x3002;&#x6BD5;&#x7ADF;&#xFF0C;&#x5E74;&#x5E95;&#x53D1;&#x653E;&#x5956;&#x91D1;&#x662F;&#x5BF9;&#x5927;&#x5BB6;&#x7684;&#x4E00;&#x4EFD;&#x627F;&#x8BFA;&#xFF0C;&#x867D;&#x7136;&#x90AE;&#x4EF6;&#x4E0A;&#x8BF4;&#x660E;&#x4E86;&#x516C;&#x53F8;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4F46;&#x662F;&#x4E14;&#x4E0D;&#x8BBA;&#x771F;&#x5047;&#xFF0C;&#x4F01;&#x4E1A;&#x7684;&#x76C8;&#x5229;&#x4E0D;&#x5E94;&#x8BE5;&#x662F;&#x9AD8;&#x5C42;&#x9886;&#x5BFC;&#x8003;&#x8651;&#x7684;&#x95EE;&#x9898;&#x5417;&#x3002;</p>
<p>&#x53D1;&#x751F;&#x8FD9;&#x4EF6;&#x4E8B;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x8336;&#x4F59;&#x996D;&#x540E;&#x90FD;&#x6709;&#x5F88;&#x591A;&#x62A5;&#x6028;&#xFF0C;&#x5927;&#x5BB6;&#x5DE5;&#x4F5C;&#x4E5F;&#x6CA1;&#x6709;&#x4EE5;&#x4F4F;&#x90A3;&#x79EF;&#x6781;&#xFF0C;&#x90FD;&#x7EB7;&#x7EB7;&#x63D0;&#x524D;&#x5F00;&#x59CB;&#x4E86;&#x627E;&#x5DE5;&#x4F5C;&#x7684;&#x8BA1;&#x5212;&#xFF0C;&#x800C;&#x6211;&#x5728;&#x8FD9;&#x4EF6;&#x4E8B;&#x4E2D;&#xFF0C;&#x542C;&#x4E86;&#x592A;&#x591A;&#x7684;&#x95F2;&#x8A00;&#x95F2;&#x8BED;&#xFF0C;&#x4E5F;&#x770B;&#x5230;&#x516C;&#x53F8;&#x5728;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x6240;&#x4F5C;&#x6240;&#x4E3A;&#xFF0C;&#x5BFC;&#x81F4;&#x5FC3;&#x6001;&#x4E5F;&#x6709;&#x4E9B;&#x5931;&#x8861;&#xFF0C;&#x4E5F;&#x62B1;&#x6028;&#x8FC7;&#xFF0C;&#x5931;&#x671B;&#x8FC7;&#x3002;&#x53EF;&#x662F;&#x56DE;&#x8FC7;&#x5934;&#x6765;&#x60F3;&#x60F3;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x65F6;&#x77E5;&#x9053;&#x5E74;&#x5E95;&#x6CA1;&#x6709;&#x5956;&#x91D1;&#xFF0C;&#x8FD8;&#x4F1A;&#x6765;&#x8FD9;&#x91CC;&#x5417;&#xFF0C;&#x6211;&#x60F3;&#x6211;&#x7684;&#x9009;&#x62E9;&#x8FD8;&#x662F;&#x4F1A;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x672A;&#x77E5;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x662F;&#x60F3;&#x53BB;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#x3002;&#x65B0;&#x52A0;&#x5761;&#x4E5F;&#x6CA1;&#x6709;&#x8BA9;&#x5931;&#x671B;&#xFF0C;&#x9664;&#x4E86;&#x5DE5;&#x4F5C;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x8FD8;&#x5B66;&#x5230;&#x4E86;&#x5305;&#x5BB9;&#xFF0C;&#x5B66;&#x5230;&#x4E86;&#x597D;&#x7684;&#x793E;&#x4F1A;&#x57FA;&#x7840;&#x662F;&#x591A;&#x4E48;&#x91CD;&#x8981;&#xFF0C;&#x5927;&#x5BB6;&#x624D;&#x80FD;&#x4E95;&#x4E95;&#x6709;&#x6761;&#xFF0C;&#x5949;&#x516C;&#x5B88;&#x6CD5;&#x3002;&#x6CA1;&#x6709;&#x5956;&#x91D1;&#x4E0D;&#x662F;&#x4E0D;&#x80FD;&#x6D3B;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x53EA;&#x4E3A;&#x4E86;&#x773C;&#x524D;&#x8FD9;&#x70B9;&#x5C0F;&#x94B1;&#x4E0D;&#x662F;&#x5417;&#xFF0C;&#x4EE5;&#x540E;&#x7684;&#x8DEF;&#x8FD8;&#x957F;&#x7740;&#x5462;&#x3002;&#x5728;&#x5DE5;&#x4F5C;&#x4E0A;&#x4E5F;&#x5B66;&#x4E60;&#x5230;&#x4E0D;&#x5C11;&#xFF0C;&#x81EA;&#x5DF1;&#x4ECE;&#x4E00;&#x4E2A;&#x505A;&#x4E8B;&#x60C5;&#x90FD;&#x6709;&#x4E9B;&#x5C0F;&#x80C6;&#x602F;&#x7684;&#x9886;&#x5BFC;&#xFF0C;&#x73B0;&#x5728;&#x4E5F;&#x80FD;&#x591F;&#x6709;&#x6761;&#x4E0D;&#x7A33;&#x7684;&#x5E26;&#x9886;&#x5927;&#x5BB6;&#x8FDB;&#x6B65;&#xFF0C;&#x4ECE;&#x800C;&#x5F97;&#x5230;&#x5927;&#x5BB6;&#x7684;&#x8BA4;&#x53EF;&#xFF0C;&#x8FD9;&#x662F;&#x91D1;&#x94B1;&#x4E70;&#x4E0D;&#x5230;&#x7684;&#xFF0C;&#x5F53;&#x7136;&#x8FD8;&#x8981;&#x4E0D;&#x65AD;&#x8FDB;&#x6B65;&#x3002;&#x522B;&#x4EBA;&#x7684;&#x60C5;&#x7EEA;&#x4E0D;&#x80FD;&#x5F71;&#x54CD;&#x4E86;&#x81EA;&#x5DF1;&#xFF0C;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x90FD;&#x8981;&#x505A;&#x597D;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6536;&#x62FE;&#x597D;&#x5FC3;&#x60C5;&#xFF0C;&#x91CD;&#x65B0;&#x4E0A;&#x8DEF;&#x624D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x3002;&#x51B5;&#x4E14;&#x56FD;&#x5185;&#x72B6;&#x51B5;&#x4E5F;&#x4E0D;&#x592A;&#x597D;&#xFF0C;&#x542C;&#x5230;&#x592A;&#x591A;&#x7684;&#x4F01;&#x4E1A;&#x5012;&#x95ED;&#xFF0C;&#x53D1;&#x4E0D;&#x51FA;&#x6765;&#x5DE5;&#x8D44;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x4E0A;&#x5348;&#x89E3;bug,&#x4E0B;&#x5348;&#x88AB;&#x901A;&#x77E5;&#x88C1;&#x5458;&#x7684;&#xFF0C;&#x8DDF;&#x8FD9;&#x4E2A;&#x4E00;&#x6BD4;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x975E;&#x5E38;&#x597D;&#x4E86;&#xFF0C;&#x81F3;&#x4E8E;&#x66F4;&#x597D;&#x7684;&#x4F01;&#x4E1A;&#xFF0C;&#x4EE5;&#x540E;&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x53BB;&#x7684;&#x3002;&#x5BB6;&#x91CC;&#x4EBA;&#x662F;&#x4F1A;&#x7406;&#x89E3;&#x7684;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x8FD8;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x5FC3;&#x6001;&#x8981;&#x597D;&#xFF0C;&#x4E0D;&#x7BA1;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x81EA;&#x5DF1;&#x4E0D;&#x80FD;&#x8BA9;&#x81EA;&#x5DF1;&#x5931;&#x671B;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x522B;&#x4EBA;&#x7684;&#x773C;&#x5149;&#xFF0C;&#x4EBA;&#x751F;&#x7684;&#x8D77;&#x8D77;&#x843D;&#x843D;&#x4E0D;&#x5FC5;&#x592A;&#x5728;&#x610F;&#x3002;</p>
<p>&#x53EA;&#x9700;&#x8981;&#x8BB0;&#x4F4F;&#xFF0C;&#x4EFB;&#x4F55;&#x4E8B;&#x90FD;&#x4F1A;&#x8FC7;&#x53BB;&#x7684;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x6210;&#x4E3A;&#x6700;&#x597D;&#x7684;&#x81EA;&#x5DF1;&#xFF0C;&#x4E0D;&#x8981;&#x6210;&#x4E3A;&#x6700;&#x8BA8;&#x538C;&#x7684;&#x81EA;&#x5DF1;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2018/07/12/人生总有一些不期而遇/" rel="next" title="人生总有一些期而遇">
                <i class="fa fa-chevron-left"></i> 人生总有一些期而遇
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2021/11/23/最近的怪圈/" rel="prev" title="永远别让自己陷入怪圈">
                永远别让自己陷入怪圈 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2018/12/22/工作中的负能量/"
           data-title="工作中的负能量" data-url="http://stareme.wang/2018/12/22/工作中的负能量/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel sidebar-panel-active">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/uploads/me.png"
               alt="stareme" />
          <p class="site-author-name" itemprop="name">stareme</p>
          <p class="site-description motion-element" itemprop="description">敢问路在何方</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">16</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/wangbin0802" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/1646304090/profile?topnav=1&wvr=6" target="_blank" title="Weibo">
                  
                    <i class="fa fa-fw fa-weibo"></i>
                  
                  Weibo
                </a>
              </span>
            
          
        </div>

        
        

        
        

        


      </section>

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2021</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">stareme</span>
</div>


<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>


        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.1.0"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"staremewang"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  








  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
      search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();
    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';
      $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = $( "entry", xmlResponse ).map(function() {
            return {
              title: $( "title", this ).text(),
              content: $("content",this).text(),
              url: $( "url" , this).text()
            };
          }).get();
          var $input = document.getElementById(search_id);
          var $resultContent = document.getElementById(content_id);
          $input.addEventListener('input', function(){
            var matchcounts = 0;
            var str='<ul class=\"search-result-list\">';
            var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
            $resultContent.innerHTML = "";
            if (this.value.trim().length > 1) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var content_index = [];
                var data_title = data.title.trim().toLowerCase();
                var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                var data_url = decodeURIComponent(data.url);
                var index_title = -1;
                var index_content = -1;
                var first_occur = -1;
                // only match artiles with not empty titles and contents
                if(data_title != '') {
                  keywords.forEach(function(keyword, i) {
                    index_title = data_title.indexOf(keyword);
                    index_content = data_content.indexOf(keyword);
                    if( index_title >= 0 || index_content >= 0 ){
                      isMatch = true;
                      if (i == 0) {
                        first_occur = index_content;
                      }
                    }

                  });
                }
                // show search results
                if (isMatch) {
                  matchcounts += 1;
                  str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                  var content = data.content.trim().replace(/<[^>]+>/g,"");
                  if (first_occur >= 0) {
                    // cut out 100 characters
                    var start = first_occur - 20;
                    var end = first_occur + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if(start == 0){
                      end = 50;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    var match_content = content.substring(start, end);
                    // highlight all keywords
                    keywords.forEach(function(keyword){
                      var regS = new RegExp(keyword, "gi");
                      match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                    });

                    str += "<p class=\"search-result\">" + match_content +"...</p>"
                  }
                  str += "</li>";
                }
              })};
            str += "</ul>";
            if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
            if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
            $resultContent.innerHTML = str;
          });
          proceedsearch();
        }
      });}

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>


  

  

  

  


</body>
</html>
