<!doctype html>



  


<html class="theme-next pisces use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="2017.2.13&amp;#x53F7;&amp;#x62D6;&amp;#x7740;&amp;#x91CD;&amp;#x91CD;&amp;#x7684;&amp;#x884C;&amp;#x674E;&amp;#xFF0C;&amp;#x5728;&amp;#x6D66;&amp;#x4E1C;&amp;#x56FD;&amp;#x9645;&amp;#x673A;&amp;#x573A;&amp;#x770B;&amp;#x7740;&amp;#x8001;&amp;#x5A46;&amp;#x542B;&amp;#x6CEA;&amp;#x544A;&amp;#x522B">
<meta property="og:type" content="article">
<meta property="og:title" content="在新加坡怎么样">
<meta property="og:url" content="http://stareme.wang/2017/02/16/刚来新加坡/index.html">
<meta property="og:site_name" content="做另一面的自己">
<meta property="og:description" content="2017.2.13&amp;#x53F7;&amp;#x62D6;&amp;#x7740;&amp;#x91CD;&amp;#x91CD;&amp;#x7684;&amp;#x884C;&amp;#x674E;&amp;#xFF0C;&amp;#x5728;&amp;#x6D66;&amp;#x4E1C;&amp;#x56FD;&amp;#x9645;&amp;#x673A;&amp;#x573A;&amp;#x770B;&amp;#x7740;&amp;#x8001;&amp;#x5A46;&amp;#x542B;&amp;#x6CEA;&amp;#x544A;&amp;#x522B">
<meta property="og:image" content="http://ojxhdwqig.bkt.clouddn.com/WechatIMG8.jpeg">
<meta property="og:image" content="http://ojxhdwqig.bkt.clouddn.com/WechatIMG6.jpeg">
<meta property="og:image" content="http://ojxhdwqig.bkt.clouddn.com/WechatIMG7.jpeg">
<meta property="og:image" content="http://ojxhdwqig.bkt.clouddn.com/WechatIMG2.jpeg">
<meta property="og:image" content="http://ojxhdwqig.bkt.clouddn.com/WechatIMG3.jpeg">
<meta property="og:updated_time" content="2017-02-16T14:03:13.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="在新加坡怎么样">
<meta name="twitter:description" content="2017.2.13&amp;#x53F7;&amp;#x62D6;&amp;#x7740;&amp;#x91CD;&amp;#x91CD;&amp;#x7684;&amp;#x884C;&amp;#x674E;&amp;#xFF0C;&amp;#x5728;&amp;#x6D66;&amp;#x4E1C;&amp;#x56FD;&amp;#x9645;&amp;#x673A;&amp;#x573A;&amp;#x770B;&amp;#x7740;&amp;#x8001;&amp;#x5A46;&amp;#x542B;&amp;#x6CEA;&amp;#x544A;&amp;#x522B">
<meta name="twitter:image" content="http://ojxhdwqig.bkt.clouddn.com/WechatIMG8.jpeg">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://stareme.wang/2017/02/16/刚来新加坡/"/>





  <title> 在新加坡怎么样 | 做另一面的自己 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?1b404ff8751a05c0c72a0484de9977f5";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">做另一面的自己</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup">
 <span class="search-icon fa fa-search"></span>
 <input type="text" id="local-search-input">
 <div id="local-search-result"></div>
 <span class="popup-btn-close">close</span>
</div>


    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://stareme.wang/2017/02/16/刚来新加坡/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="stareme">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/uploads/me.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="做另一面的自己">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="做另一面的自己" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                在新加坡怎么样
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-02-16T22:02:45+08:00">
                2017-02-16
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
              <span class="post-meta-divider">|</span>
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/新加坡/" itemprop="url" rel="index">
                    <span itemprop="name">新加坡</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <a href="/2017/02/16/刚来新加坡/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2017/02/16/刚来新加坡/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>2017.2.13&#x53F7;&#x62D6;&#x7740;&#x91CD;&#x91CD;&#x7684;&#x884C;&#x674E;&#xFF0C;&#x5728;&#x6D66;&#x4E1C;&#x56FD;&#x9645;&#x673A;&#x573A;&#x770B;&#x7740;&#x8001;&#x5A46;&#x542B;&#x6CEA;&#x544A;&#x522B;&#xFF0C;&#x5FC3;&#x4E2D;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x820D;&#xFF0C;&#x79BB;&#x884C;&#x524D;&#x7684;&#x524D;&#x4E24;&#x5929;&#x4E5F;&#x548C;&#x4E0A;&#x6D77;&#x7684;&#x670B;&#x53CB;&#x4EEC;&#x4F9D;&#x6B21;&#x4F5C;&#x4E86;&#x544A;&#x522B;&#x3002;&#x6765;&#x4E4B;&#x524D;&#x4E00;&#x4E24;&#x4E2A;&#x6708;&#x8FD8;&#x662F;&#x633A;&#x5174;&#x594B;&#xFF0C;&#x6BD5;&#x7ADF;&#x6709;&#x673A;&#x4F1A;&#x51FA;&#x56FD;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x56FD;&#x5916;&#x53EF;&#x4EE5;&#x5446;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E0D;&#x9519;&#x7684;&#x4F53;&#x9A8C;&#xFF0C;&#x4E0D;&#x662F;&#x4EBA;&#x4EBA;&#x90FD;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x662F;&#x6765;&#x4E86;&#x8FD9;&#x8FB9;&#x3002;&#x4F46;&#x662F;&#x4E34;&#x884C;&#x524D;&#x67E5;&#x4E86;&#x4E0B;&#x65B0;&#x52A0;&#x5761;&#x7684;&#x6D88;&#x8D39;&#x6C34;&#x5E73;&#xFF0C;&#x4E16;&#x754C;&#x7B2C;&#x4E00;&#xFF0C;&#x60F3;&#x60F3;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x8D44;&#xFF0C;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x5C31;&#x6CA1;&#x8FD9;&#x4E48;&#x9AD8;&#x4E86;&#xFF0C;&#x5F88;&#x5BB3;&#x6015;&#x81EA;&#x5DF1;&#x8D5A;&#x4E0D;&#x5230;&#x94B1;&#xFF0C;&#x53CD;&#x800C;&#x865A;&#x5EA6;&#x4E86;&#x65F6;&#x5149;&#xFF0C;&#x800C;&#x4E14;&#x627E;&#x4E86;&#x5F88;&#x4E45;&#x7684;&#x9152;&#x5E97;&#x90FD;&#x8FD9;&#x4E48;&#x8D35;&#xFF0C;&#x9152;&#x5E97;&#x4E5F;&#x6CA1;&#x627E;&#x597D;&#xFF0C;&#x66F4;&#x52A0;&#x65AD;&#x5B9A;&#x8FD9;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x4EBA;&#x80FD;&#x6D88;&#x8D39;&#x7684;&#x8D77;&#x7684;&#x5730;&#x65B9;&#xFF1B;&#x60F3;&#x5230;&#x6D77;&#x5173;&#x68C0;&#x67E5;&#xFF0C;&#x4F1A;&#x4E0D;&#x4F1A;&#x5165;&#x4E0D;&#x4E86;&#x5173;&#xFF0C;&#x88AB;&#x5173;&#x8D77;&#x6765;&#xFF0C;&#x5230;&#x4E86;&#x8FD9;&#x8FB9;&#x8981;&#x5728;&#x98DE;&#x673A;&#x573A;&#x8FC7;&#x591C;&#x7B49;&#x7B49;&#x3002;&#x60F3;&#x6765;&#x60F3;&#x53BB;&#xFF0C;&#x8D8A;&#x53D1;&#x89C9;&#x5F97;&#x4E0D;&#x77E5;&#x9053;&#x4F55;&#x53BB;&#x4F55;&#xFF0C;&#x4E8E;&#x662F;&#x63D0;&#x524D;&#x4E00;&#x5929;&#x6C42;&#x52A9;&#x4E86;&#x63A8;&#x8350;&#x53BB;&#x8FD9;&#x4E2A;&#x516C;&#x53F8;&#x7684;&#x4E00;&#x4E2A;&#x670B;&#x53CB;&#xFF0C;&#x672C;&#x6765;&#x662F;&#x4E0D;&#x60F3;&#x6253;&#x6270;&#x4EBA;&#x5BB6;&#x7684;&#xFF0C;&#x6BD5;&#x7ADF;&#x4E4B;&#x524D;&#x4E5F;&#x4E0D;&#x662F;&#x5F88;&#x719F;&#x3002;&#x4F46;&#x662F;&#x4ED6;&#x4E00;&#x542C;&#x6211;&#x8981;&#x6765;&#xFF0C;&#x70ED;&#x60C5;&#x8D85;&#x51FA;&#x4E86;&#x6211;&#x7684;&#x60F3;&#x50CF;&#xFF0C;&#x53C8;&#x662F;&#x5306;&#x5FD9;&#x5E2E;&#x6211;&#x627E;&#x623F;&#x5B50;&#xFF0C;&#x665A;&#x4E0A;&#x53C8;&#x8981;&#x6765;&#x98DE;&#x673A;&#x573A;&#x63A5;&#x6211;&#xFF0C;&#x4E00;&#x542C;&#x5230;&#x8FD9;&#x611F;&#x89C9;&#x4E00;&#x80A1;&#x6696;&#x6D41;&#x6D8C;&#x4E0A;&#x5FC3;&#x5934;&#xFF0C;&#x771F;&#x6B63;&#x611F;&#x89C9;&#x5230;&#x51FA;&#x95E8;&#x9760;&#x670B;&#x53CB;&#x7684;&#x91CD;&#x8981;&#x6027;&#x3002;&#x4E8E;&#x662F;&#x4E4B;&#x524D;&#x7684;&#x5BB3;&#x6015;&#x548C;&#x6050;&#x60E7;&#x5C31;&#x6D88;&#x5931;&#x4E86;&#xFF0C;&#x60F3;&#x4E86;&#x4E0B;&#x4E4B;&#x524D;&#x7684;&#x6D88;&#x8D39;&#x95EE;&#x9898;&#xFF0C;&#x6765;&#x8FD9;&#x8FB9;&#x53EF;&#x4EE5;&#x4F53;&#x9A8C;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x5C11;&#x8D5A;&#x70B9;&#x53C8;&#x6709;&#x4F55;&#x70E6;&#x5462;&#x3002;&#x4E8E;&#x662F;&#x5C31;&#x8FD9;&#x6837;&#x7B2C;&#x4E8C;&#x5929;2&#xFF1A;40&#x98DE;&#x673A;&#x8D77;&#x98DE;&#x4E86;&#xFF0C;&#x98DE;&#x5411;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x56FD;&#x5EA6;&#xFF0C;&#x65B0;&#x52A0;&#x5761;&#x3002;</p>
<p>&#x5728;&#x98DE;&#x673A;&#x4E0A;&#xFF0C;&#x4E00;&#x5207;&#x6B63;&#x5E38;&#xFF0C;&#x4E2D;&#x9014;&#x6709;&#x70B9;&#x997F;&#xFF0C;&#x53EB;&#x4E86;&#x4EFD;&#x5364;&#x8089;&#x996D;&#xFF0C;40&#x5757;&#xFF0C;&#x6709;&#x70B9;&#x5FC3;&#x75DB;&#xFF0C;&#x4F46;&#x60F3;&#x7740;&#x6BD5;&#x7ADF;&#x51FA;&#x56FD;&#x554A;&#xFF0C;&#x4E0D;&#x80FD;&#x592A;&#x5BD2;&#x60E8;&#x4E86;&#xFF0C;&#x53D1;&#x73B0;&#x65C1;&#x8FB9;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x90E8;&#x5206;&#x8001;&#x4EBA;&#x53BB;&#x5761;&#x56FD;&#x65C5;&#x6E38;&#x7684;&#x56E2;&#xFF0C;&#x679C;&#x7136;&#x65B0;&#x52A0;&#x5761;&#x662F;&#x4E2A;&#x65C5;&#x6E38;&#x7684;&#x597D;&#x5730;&#x65B9;&#x3002;&#x98DE;&#x673A;&#x63D0;&#x524D;&#x4E00;&#x4E2A;&#x5C0F;&#x65F6;&#x5230;&#x8FBE;&#xFF0C;&#x4E8E;&#x662F;&#x548C;&#x670B;&#x53CB;&#x4E00;&#x8FB9;&#x5FAE;&#x4FE1;&#x4E00;&#x8FB9;&#x5165;&#x5173;&#x3002;&#x5E26;&#x7740;EP&#x7684;&#x4FE1;&#x4EF6;&#x4EE5;&#x4E3A;&#x80FD;&#x8FDB;&#x53BB;&#x4E86;&#xFF0C;&#x6CA1;&#x60F3;&#x88AB;&#x53EB;&#x7740;&#x53BB;&#x586B;&#x4E86;&#x4EFD;&#x5165;&#x5173;&#x7533;&#x8BF7;&#x8868;&#xFF0C;&#x8FD8;&#x88AB;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x6D77;&#x5173;&#x4EBA;&#x5458;&#x4E00;&#x987F;&#x95EE;&#x8BDD;&#xFF0C;&#x8BF4;&#x662F;&#x4E0D;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x6765;&#x65B0;&#x52A0;&#x5761;&#x7B49;&#x7B49;&#xFF0C;&#x65C1;&#x8FB9;&#x6709;&#x597D;&#x591A;&#x5176;&#x5B83;&#x56FD;&#x5BB6;&#x7684;&#x4EBA;&#xFF0C;&#x611F;&#x89C9;&#x8FD8;&#x662F;&#x633A;&#x5BB3;&#x6015;&#x7684;&#x3002;&#x4E0D;&#x8FC7;&#x6CA1;&#x6709;&#x60F3;&#x50CF;&#x7684;&#x90A3;&#x4E48;&#x4E25;&#xFF0C;&#x4E1C;&#x897F;&#x4E0D;&#x68C0;&#x67E5;&#xFF0C;&#x53EF;&#x601C;&#x4E86;&#x6211;&#x7237;&#x7237;&#x5976;&#x5976;&#x7ED9;&#x6211;&#x5907;&#x597D;&#x7684;&#x6768;&#x6885;&#x5E72;&#xFF0C;&#x674E;&#x5B50;&#x5E72;&#x4E86;&#xFF0C;&#x6709;&#x5F15;&#x8D77;&#x540E;&#x6094;&#x3002;&#x8FD8;&#x597D;&#x4E00;&#x5207;&#x987A;&#x5229;&#xFF0C;&#x5165;&#x5B8C;&#x5173;&#xFF0C;&#x53D6;&#x5B8C;&#x884C;&#x674E;&#x4E4B;&#x540E;&#xFF0C;&#x670B;&#x53CB;&#x4E5F;&#x6765;&#x63A5;&#x5230;&#x4E86;&#x6211;&#xFF0C;&#x4ED6;&#x5E26;&#x7740;&#x53BB;&#x5750;&#x5730;&#x94C1;&#x5F80;&#x4F4F;&#x7684;&#x5730;&#x65B9;&#x8D76;&#xFF0C;&#x4E00;&#x8FB9;&#x4ECB;&#x7ECD;&#x7740;&#x65B0;&#x52A0;&#x5761;&#x548C;&#x6211;&#x6765;&#x5230;&#x8FD9;&#x8FB9;&#x4E4B;&#x540E;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x8FD8;&#x966A;&#x4E86;&#x6211;&#x529E;&#x4E86;&#x4E00;&#x5F20;&#x516C;&#x4EA4;&#x5361;&#xFF0C;&#x6709;&#x82F1;&#x8BED;&#xFF0C;&#x679C;&#x7136;&#x5761;&#x56FD;&#x8981;&#x8BB2;&#x82F1;&#x8BED;&#xFF0C;&#x4E0D;&#x7136;&#x5904;&#x5904;&#x78B0;&#x58C1;&#x3002;&#x5230;&#x4E86;&#x4F4F;&#x7684;&#x5730;&#x65B9;&#x624D;&#x77E5;&#x9053;&#x4EBA;&#x5BB6;&#x90FD;&#x63D0;&#x524D;&#x628A;&#x94B1;&#x7ED9;&#x4E86;&#x623F;&#x4E1C;&#xFF0C;$750,&#x4E00;&#x7B14;&#x4E0D;&#x5C0F;&#x7684;&#x6570;&#x76EE;&#x3002;&#x60F3;&#x60F3;&#x4EBA;&#x5BB6;&#x771F;&#x597D;&#xFF0C;&#x8FD9;&#x4E48;&#x76F8;&#x4FE1;&#x522B;&#x4EBA;&#xFF0C;&#x81EA;&#x5DF1;&#x4E5F;&#x6C42;&#x5FC5;&#x80FD;&#x505A;&#x5230;&#x3002;&#x8FD9;&#x4E2A;&#x670B;&#x53CB;&#x5982;&#x679C;&#x4EBA;&#x5BB6;&#x4E0D;&#x5ACC;&#x5F03;&#xFF0C;&#x5F97;&#x4EA4;&#x3002;&#x4E8E;&#x662F;&#x628A;&#x94B1;&#x8FD8;&#x7ED9;&#x4EBA;&#x5BB6;&#xFF0C;&#x8FD8;&#x5151;&#x6362;&#x4E86;250&#x5757;&#xFF0C;1000&#x5757;&#x7ED9;&#x4EBA;&#x5BB6;&#x53BB;&#x5B58;&#x4E86;&#x3002;&#x540E;&#x9762;&#x4ED6;&#x5C31;&#x56DE;&#x5BB6;&#x4E86;&#x3002;&#x53D1;&#x73B0;&#x8FD9;&#x8FB9;&#x662F;&#x590F;&#x5929;&#xFF0C;&#x548C;&#x5BB6;&#x91CC;&#x5F62;&#x6210;&#x9C9C;&#x660E;&#x7684;&#x53CD;&#x5DEE;&#x3002;&#x6211;&#x4E5F;&#x5B89;&#x5FC3;&#x7684;&#x7761;&#x4E0B;&#x4E86;&#x3002;&#x8981;&#x662F;&#x6CA1;&#x6709;&#x4ED6;&#xFF0C;&#x771F;&#x4E0D;&#x77E5;&#x9053;&#x90A3;&#x4E00;&#x665A;&#x4E0A;&#x8981;&#x600E;&#x4E48;&#x5EA6;&#x8FC7;&#xFF0C;&#x623F;&#x5B50;&#x8981;&#x600E;&#x4E48;&#x624D;&#x80FD;&#x627E;&#x5230;&#x3002;&#x7136;&#x540E;&#x53BB;&#x516C;&#x53F8;&#x53C8;&#x662F;&#x591A;&#x4E48;&#x7684;&#x8D39;&#x52B2;&#x3002;&#x53EA;&#x80FD;&#x8BF4;&#x597D;&#x4EBA;&#x6709;&#x597D;&#x62A5;&#xFF0C;&#x4EE5;&#x540E;&#x8981;&#x50CF;&#x4ED6;&#x5B66;&#x4E60;&#x3002;<br><img src="http://ojxhdwqig.bkt.clouddn.com/WechatIMG8.jpeg" alt=""></p>
<p>&#x8EAB;&#x4E0A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5C31;&#x662F;mac&#x7535;&#x8111;&#x548C;&#x90A3;3000&#x7684;&#x73B0;&#x91D1;&#xFF0C;&#x7B7E;&#x8BC1;&#xFF0C;&#x7B7E;&#x8BC1;&#x4FE1;&#x4EF6;&#x7B49;&#x7B49;&#x554A;&#xFF0C;&#x4E8E;&#x662F;&#x5305;&#x4E00;&#x76F4;&#x80CC;&#x7740;&#x3002;&#x7B2C;&#x4E8C;&#x5929;&#x5C31;&#x4E70;&#x5404;&#x79CD;&#x65E5;&#x7528;&#x54C1;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x53BB;&#x8D85;&#x5E02;&#x901B;&#x4E86;&#x901B;&#xFF0C;&#x6CA1;&#x6709;&#x9884;&#x671F;&#x7684;&#x6D88;&#x8D39;&#x90A3;&#x4E48;&#x8D35;&#xFF0C;&#x603B;&#x5171;&#x4E70;&#x4E0B;&#x6765;&#x4E0D;&#x5230;50&#xFF0C;&#x7EC8;&#x4E8E;&#x9A8C;&#x8BC1;&#x4E86;&#x4E0D;&#x7BA1;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#x90FD;&#x6709;&#x4E00;&#x5343;&#x79CD;&#x6D3B;&#x6CD5;&#xFF0C;&#x770B;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x4E8E;&#x662F;&#x53C8;&#x5426;&#x5B9A;&#x4E4B;&#x524D;&#x81EA;&#x5DF1;&#x65E0;&#x77E5;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x4F4F;&#x7684;&#x95EE;&#x9898;&#x7B97;&#x662F;&#x6682;&#x65F6;&#x89E3;&#x51B3;&#x4E86;&#xFF0C;&#x5230;&#x4E86;&#x5403;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x65E9;&#x4E0A;&#x4E0B;&#x53BB;&#x4E00;&#x770B;&#x90FD;9&#x70B9;&#x591A;&#x4E86;&#xFF0C;&#x600E;&#x4E48;&#x8FD8;&#x662F;&#x8FD9;&#x4E48;&#x591A;&#x4EBA;&#x5728;&#x5403;&#x65E9;&#x70B9;&#xFF0C;&#x800C;&#x4E14;&#x4E00;&#x5230;&#x4E0B;&#x9762;&#x53D1;&#x73B0;&#x4EC0;&#x4E48;&#x4EBA;&#x90FD;&#x6709;&#xFF0C;&#x5370;&#x5EA6;&#x7684;&#xFF0C;&#x672C;&#x5730;&#x7684;&#xFF0C;&#x4E2D;&#x56FD;&#x7684;&#xFF0C;&#x9A6C;&#x6765;&#xFF0C;&#x7F8E;&#x56FD;&#x7684;&#xFF0C;&#x8BF4;&#x7684;&#x8BDD;&#x57FA;&#x672C;&#x90FD;&#x542C;&#x4E0D;&#x61C2;&#xFF0C;&#x4E8E;&#x662F;&#x6709;&#x70B9;&#x5BB3;&#x6015;&#xFF0C;&#x672C;&#x8EAB;&#x4E0D;&#x559C;&#x6B22;&#x5728;&#x964C;&#x751F;&#x7684;&#x73AF;&#x5883;&#x5446;&#x7740;&#xFF0C;&#x4E8E;&#x662F;&#x627E;&#x554A;&#x627E;&#xFF0C;&#x53D1;&#x73B0;&#x8FD9;&#x8FB9;&#x7684;&#x98DF;&#x7269;&#x505A;&#x7684;&#x8BA9;&#x4EBA;&#x6CA1;&#x80C3;&#x53E3;&#x554A;&#xFF0C;&#x90FD;&#x9ECF;&#x7CCA;&#x7CCA;&#x7684;&#xFF0C;&#x4E8E;&#x662F;&#x627E;&#x4E86;&#x5BB6;&#x5E7F;&#x4E1C;&#x80A0;&#x7C89;&#x52A0;&#x4E00;&#x7897;&#x7A00;&#x996D;4.5&#xFF0C;&#x8FD8;&#x86EE;&#x8D35;&#x7684;&#xFF0C;&#x5403;&#x80A0;&#x7C89;&#x7684;&#x7B2C;&#x4E00;&#x53E3;&#x5C31;&#x60F3;&#x5410;&#x4E86;&#xFF0C;&#x600E;&#x4E48;&#x4F1A;&#x6709;&#x8FD9;&#x4E48;&#x96BE;&#x5403;&#x7684;&#x98DF;&#x7269;&#xFF0C;&#x8FD9;&#x662F;&#x52A0;&#x4E86;&#x4EC0;&#x4E48;&#x9999;&#x6599;&#xFF0C;&#x4E8E;&#x662F;&#x518D;&#x4E5F;&#x4E0D;&#x6562;&#x76F8;&#x4FE1;&#x6240;&#x6709;&#x540D;&#x5B57;&#x662F;&#x4E2D;&#x56FD;&#x7684;&#x996D;&#x4E86;&#xFF0C;&#x8FD8;&#x662F;&#x5FCD;&#x7740;&#x5403;&#x4E86;&#x51E0;&#x53E3;&#x3002;&#x4E8E;&#x662F;&#x540E;&#x9762;&#x7684;&#x6BCF;&#x9910;&#x90FD;&#x627E;&#x7C73;&#x996D;&#x5403;&#xFF0C;&#x8FD9;&#x8FB9;&#x7C73;&#x996D;&#x7ADF;&#x7136;&#x4E5F;&#x6709;&#x4E00;&#x822C;&#x7279;&#x6B8A;&#x7684;&#x9999;&#x5473;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5F97;&#x5403;&#x554A;&#xFF0C;&#x4E0D;&#x7136;&#x771F;&#x6CA1;&#x4EC0;&#x4E48;&#x53EF;&#x4EE5;&#x5403;&#x7684;&#x4E86;&#x3002;&#x4E0A;&#x73ED;&#x516C;&#x53F8;&#x98DF;&#x5802;&#x7684;&#x996D;&#x4E0D;&#x9519;&#xFF0C;&#x4EF7;&#x683C;&#x4E5F;&#x516C;&#x9053;&#x3002;&#x4E8E;&#x662F;&#x6162;&#x6162;&#x7684;&#x5C31;&#x7B97;&#x5165;&#x4E61;&#x968F;&#x4FD7;&#x4E86;&#x3002;&#x4E0A;&#x73ED;&#x73AF;&#x5883;&#x8FD8;&#x4E0D;&#x9519;&#xFF0C;&#x90FD;&#x662F;&#x4E2D;&#x56FD;&#x4EBA;&#xFF0C;&#x6CA1;&#x6709;&#x8BED;&#x8A00;&#x969C;&#x788D;&#xFF0C;&#x800C;&#x4E14;&#x521A;&#x53BB;&#x914D;&#x7684;&#x8FD8;&#x662F;macbookpro&#xFF0C;&#x597D;&#x597D;&#x5E72;&#x8FD8;&#x6709;&#x80A1;&#x7968;&#x548C;&#x5956;&#x91D1;&#x62FF;&#xFF0C;&#x8001;&#x677F;&#x975E;&#x5E38;open&#xFF0C;&#x6709;&#x4E00;&#x8BF4;&#x4E00;&#xFF0C;&#x4E0D;&#x4F1A;&#x5BF9;&#x5458;&#x5DE5;&#x9690;&#x85CF;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x9886;&#x5BFC;&#x7684;&#x8C08;&#x8BDD;&#x8DDF;&#x6211;&#x4EEC;&#x8BF4;&#x7684;&#x5C31;&#x662F;&#x5728;&#x516C;&#x53F8;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E24;&#x4EF6;&#x4E8B;&#x4E00;&#x662F;&#x94B1;&#x7ED9;&#x7684;&#x591A;&#x4E0D;&#x591A;&#xFF0C;&#x4E8C;&#x662F;&#x8FC7;&#x7684;&#x5F00;&#x4E0D;&#x5F00;&#x5FC3;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x90FD;&#x8FBE;&#x4E0D;&#x5230;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8D70;&#x4E86;&#x3002;&#x8BF4;&#x7684;&#x5F88;&#x5BF9;&#xFF0C;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#x4E0D;&#x5BB9;&#x6613;&#xFF0C;&#x8FD8;&#x4E50;&#x4E8E;&#x5206;&#x4EAB;&#x7ED9;&#x5458;&#x5DE5;&#xFF0C;&#x633A;&#x611F;&#x52A8;&#x7684;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x597D;&#x597D;&#x5E72;&#x62A5;&#x7B54;&#x516C;&#x53F8;&#x3002;<br><img src="http://ojxhdwqig.bkt.clouddn.com/WechatIMG6.jpeg" alt=""><br><img src="http://ojxhdwqig.bkt.clouddn.com/WechatIMG7.jpeg" alt=""><br><img src="http://ojxhdwqig.bkt.clouddn.com/WechatIMG2.jpeg" alt=""><br><img src="http://ojxhdwqig.bkt.clouddn.com/WechatIMG3.jpeg" alt=""></p>
<p>&#x4E4B;&#x524D;&#x5BB6;&#x91CC;&#x4EBA;&#x8FD8;&#x662F;&#x6709;&#x70B9;&#x62C5;&#x5FC3;&#x6211;&#x7684;&#x5B89;&#x5168;&#xFF0C;&#x6015;&#x88AB;&#x5173;&#x5728;&#x8FD9;&#x8FB9;&#xFF0C;&#x6BD5;&#x7ADF;&#x8001;&#x5BB6;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x5BB3;&#x6015;&#x7684;&#x6B63;&#x5E38;&#x7684;&#x3002;&#x4E8E;&#x662F;&#x5728;&#x670B;&#x53CB;&#x7684;&#x5E2E;&#x52A9;&#x4E0B;&#x529E;&#x4E86;&#x7535;&#x8BDD;&#x5361;&#xFF0C;&#x7ACB;&#x9A6C;&#x6253;&#x4E86;&#x7535;&#x8BDD;&#x7ED9;&#x5BB6;&#x91CC;&#x4EBA;&#xFF0C;&#x8BF4;&#x4E00;&#x8DEF;&#x7684;&#x7ECF;&#x8FC7;&#x548C;&#x611F;&#x53D7;&#xFF0C;&#x89C1;&#x4E86;&#x597D;&#x591A;&#x6CA1;&#x6709;&#x89C1;&#x8FC7;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FDB;&#x7684;&#x662F;&#x6B63;&#x89C4;&#x516C;&#x53F8;&#x6CA1;&#x6709;&#x88AB;&#x8D29;&#x5356;&#xFF0C;&#x8FD9;&#x6837;&#x7238;&#x7238;&#x5976;&#x5976;&#x5C31;&#x653E;&#x5FC3;&#x4E86;&#xFF0C;&#x6211;&#x4E5F;&#x5C31;&#x653E;&#x5FC3;&#x4E86;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/01/17/Android hook初学/" rel="next" title="Android Hook 技术">
                <i class="fa fa-chevron-left"></i> Android Hook 技术
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/03/16/2017-me/" rel="prev" title="2017年目标">
                2017年目标 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2017/02/16/刚来新加坡/"
           data-title="在新加坡怎么样" data-url="http://stareme.wang/2017/02/16/刚来新加坡/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel sidebar-panel-active">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/uploads/me.png"
               alt="stareme" />
          <p class="site-author-name" itemprop="name">stareme</p>
          <p class="site-description motion-element" itemprop="description">敢问路在何方</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">12</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/wangbin0802" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/1646304090/profile?topnav=1&wvr=6" target="_blank" title="Weibo">
                  
                    <i class="fa fa-fw fa-weibo"></i>
                  
                  Weibo
                </a>
              </span>
            
          
        </div>

        
        

        
        

        


      </section>

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">stareme</span>
</div>


<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>


        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.1.0"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"staremewang"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  








  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
      search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();
    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';
      $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = $( "entry", xmlResponse ).map(function() {
            return {
              title: $( "title", this ).text(),
              content: $("content",this).text(),
              url: $( "url" , this).text()
            };
          }).get();
          var $input = document.getElementById(search_id);
          var $resultContent = document.getElementById(content_id);
          $input.addEventListener('input', function(){
            var matchcounts = 0;
            var str='<ul class=\"search-result-list\">';
            var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
            $resultContent.innerHTML = "";
            if (this.value.trim().length > 1) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var content_index = [];
                var data_title = data.title.trim().toLowerCase();
                var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                var data_url = decodeURIComponent(data.url);
                var index_title = -1;
                var index_content = -1;
                var first_occur = -1;
                // only match artiles with not empty titles and contents
                if(data_title != '') {
                  keywords.forEach(function(keyword, i) {
                    index_title = data_title.indexOf(keyword);
                    index_content = data_content.indexOf(keyword);
                    if( index_title >= 0 || index_content >= 0 ){
                      isMatch = true;
                      if (i == 0) {
                        first_occur = index_content;
                      }
                    }

                  });
                }
                // show search results
                if (isMatch) {
                  matchcounts += 1;
                  str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                  var content = data.content.trim().replace(/<[^>]+>/g,"");
                  if (first_occur >= 0) {
                    // cut out 100 characters
                    var start = first_occur - 20;
                    var end = first_occur + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if(start == 0){
                      end = 50;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    var match_content = content.substring(start, end);
                    // highlight all keywords
                    keywords.forEach(function(keyword){
                      var regS = new RegExp(keyword, "gi");
                      match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                    });

                    str += "<p class=\"search-result\">" + match_content +"...</p>"
                  }
                  str += "</li>";
                }
              })};
            str += "</ul>";
            if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
            if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
            $resultContent.innerHTML = str;
          });
          proceedsearch();
        }
      });}

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>


  

  

  

  


</body>
</html>
