<!doctype html>



  


<html class="theme-next pisces use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.0" />






<meta name="description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x662F;2017&amp;#x5E74;8&amp;#x6708;28&amp;#x53F7;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E00;&amp;#x5E74;&amp;#x7684;&amp;#x60C5;&amp;#x4EBA;&amp;#x8282;&amp;#xFF0C;&amp;#x548C;&amp;#x5F80;&amp;#x5E38;&amp;#x4E00;&amp;#x6837;&amp;#xFF0C;&amp;#x5404;&amp;#x79CD;&amp;#x79C0;&amp;">
<meta property="og:type" content="article">
<meta property="og:title" content="当身边的人离你而去">
<meta property="og:url" content="http://stareme.wang/2017/08/28/当亲人离你而去/index.html">
<meta property="og:site_name" content="做另一面的自己">
<meta property="og:description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x662F;2017&amp;#x5E74;8&amp;#x6708;28&amp;#x53F7;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E00;&amp;#x5E74;&amp;#x7684;&amp;#x60C5;&amp;#x4EBA;&amp;#x8282;&amp;#xFF0C;&amp;#x548C;&amp;#x5F80;&amp;#x5E38;&amp;#x4E00;&amp;#x6837;&amp;#xFF0C;&amp;#x5404;&amp;#x79CD;&amp;#x79C0;&amp;">
<meta property="og:image" content="http://ojxhdwqig.bkt.clouddn.com/%E5%AE%B6%E4%BA%BAIMG_2904.JPG">
<meta property="og:image" content="http://ojxhdwqig.bkt.clouddn.com/%E5%AE%B6%E4%BA%BAIMG_2464.JPG">
<meta property="og:image" content="http://ojxhdwqig.bkt.clouddn.com/friendsIMG_20160609_152501.jpg">
<meta property="og:image" content="http://ojxhdwqig.bkt.clouddn.com/friendsIMG_20160609_140528.jpg">
<meta property="og:updated_time" content="2017-08-28T15:28:19.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="当身边的人离你而去">
<meta name="twitter:description" content="&amp;#x4ECA;&amp;#x5929;&amp;#x662F;2017&amp;#x5E74;8&amp;#x6708;28&amp;#x53F7;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E00;&amp;#x5E74;&amp;#x7684;&amp;#x60C5;&amp;#x4EBA;&amp;#x8282;&amp;#xFF0C;&amp;#x548C;&amp;#x5F80;&amp;#x5E38;&amp;#x4E00;&amp;#x6837;&amp;#xFF0C;&amp;#x5404;&amp;#x79CD;&amp;#x79C0;&amp;">
<meta name="twitter:image" content="http://ojxhdwqig.bkt.clouddn.com/%E5%AE%B6%E4%BA%BAIMG_2904.JPG">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://stareme.wang/2017/08/28/当亲人离你而去/"/>





  <title> 当身边的人离你而去 | 做另一面的自己 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?1b404ff8751a05c0c72a0484de9977f5";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">做另一面的自己</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle"></p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup">
 <span class="search-icon fa fa-search"></span>
 <input type="text" id="local-search-input">
 <div id="local-search-result"></div>
 <span class="popup-btn-close">close</span>
</div>


    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
  <link itemprop="mainEntityOfPage" href="http://stareme.wang/2017/08/28/当亲人离你而去/">

  <span style="display:none" itemprop="author" itemscope itemtype="http://schema.org/Person">
    <meta itemprop="name" content="stareme">
    <meta itemprop="description" content="">
    <meta itemprop="image" content="/uploads/me.png">
  </span>

  <span style="display:none" itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
    <meta itemprop="name" content="做另一面的自己">
    <span style="display:none" itemprop="logo" itemscope itemtype="http://schema.org/ImageObject">
      <img style="display:none;" itemprop="url image" alt="做另一面的自己" src="">
    </span>
  </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                当身边的人离你而去
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              <span class="post-meta-item-text">发表于</span>
              <time title="Post created" itemprop="dateCreated datePublished" datetime="2017-08-28T23:23:49+08:00">
                2017-08-28
              </time>
            

            

            
          </span>

          
            <span class="post-category" >
              <span class="post-meta-divider">|</span>
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="http://schema.org/Thing">
                  <a href="/categories/新加坡/" itemprop="url" rel="index">
                    <span itemprop="name">新加坡</span>
                  </a>
                </span>

                
                
              
            </span>
          

          
            
              <span class="post-comments-count">
                <span class="post-meta-divider">|</span>
                <a href="/2017/08/28/当亲人离你而去/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2017/08/28/当亲人离你而去/" itemprop="commentCount"></span>
                </a>
              </span>
            
          

          

          
          

          

          

        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x4ECA;&#x5929;&#x662F;2017&#x5E74;8&#x6708;28&#x53F7;&#xFF0C;&#x8FD9;&#x4E00;&#x5E74;&#x7684;&#x60C5;&#x4EBA;&#x8282;&#xFF0C;&#x548C;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#xFF0C;&#x5404;&#x79CD;&#x79C0;&#x6069;&#x7231;&#xFF0C;&#x4E00;&#x4E0D;&#x5C0F;&#x5FC3;&#x5C31;&#x8981;&#x88AB;&#x4E00;&#x6CE2;&#x6D12;&#x72D7;&#x7CAE;&#x7684;&#x8282;&#x594F;&#x3002;&#x8D8A;&#x662F;&#x8FD9;&#x79CD;&#x65F6;&#x5019;&#xFF0C;&#x5FC3;&#x91CC;&#x603B;&#x662F;&#x9690;&#x9690;&#x7EA6;&#x7EA6;&#x6709;&#x4E00;&#x4E9B;&#x4F24;&#x60B2;&#x3002;&#x4E3B;&#x8981;&#x662F;&#x6700;&#x8FD1;&#x4E24;&#x5E74;&#x8EAB;&#x8FB9;&#x7684;&#x4EB2;&#x4EBA;&#x4E0D;&#x77E5;&#x4E3A;&#x4F55;&#x603B;&#x662F;&#x5728;&#x6211;&#x89E6;&#x4E0D;&#x53CA;&#x9632;&#x7684;&#x65F6;&#x5019;&#x79BB;&#x6211;&#x800C;&#x53BB;&#x3002;</p>
<p>&#x6211;&#x592A;&#x516C;&#xFF0C;&#x738B;&#x5409;&#x5F6C;&#xFF0C;&#x751F;&#x4E8E;&#x4E00;&#x4E2A;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#x5E74;&#x4EE3;&#xFF0C;&#x6253;&#x4ECE;&#x8BB0;&#x4E8B;&#x8D77;&#xFF0C;&#x4ED6;&#x5C31;&#x9000;&#x4F11;&#x4E86;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD8;&#x80FD;&#x9886;&#x5DE5;&#x8D44;&#xFF0C;&#x5728;&#x4E61;&#x4E0B;&#x662F;&#x5F88;&#x591A;&#x540C;&#x9F84;&#x8001;&#x5934;&#x8001;&#x592A;&#x592A;&#x7FA1;&#x6155;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x4E0D;&#x8BBA;&#x522E;&#x98CE;&#x4E0B;&#x96E8;&#xFF0C;&#x6BCF;&#x5929;&#x4ED6;&#x90FD;&#x8981;&#x53BB;&#x8336;&#x574A;&#x91CC;&#x559D;&#x8336;&#x5520;&#x55D1;&#x6253;&#x724C;&#xFF0C;&#x4ECE;&#x4E0D;&#x95F4;&#x65AD;&#xFF0C;&#x5C0F;&#x65F6;&#x5019;&#x5728;&#x6211;&#x8BFB;&#x4E66;&#x4E4B;&#x524D;&#xFF0C;&#x6BCF;&#x5929;&#x4E5F;&#x662F;&#x8DDF;&#x7740;&#x4ED6;&#x53BB;&#x559D;&#x8336;&#xFF0C;&#x7ED9;&#x6211;&#x7684;&#x7AE5;&#x5E74;&#x589E;&#x6DFB;&#x4E86;&#x4E0D;&#x5C11;&#x4E50;&#x8DA3;&#xFF0C;&#x4E5F;&#x8DDF;&#x8001;&#x4EBA;&#x6709;&#x4E86;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x4EB2;&#x5BC6;&#x611F;&#x3002;&#x4ED6;&#x662F;&#x4E00;&#x4E2A;&#x8033;&#x6735;&#x7279;&#x522B;&#x80CC;&#x7684;&#x4EBA;&#xFF0C;&#x8033;&#x6735;&#x987A;&#x98CE;&#x7684;&#x65F6;&#x5019;&#x5F88;&#x654F;&#x611F;&#xFF0C;&#x4E0D;&#x987A;&#x98CE;&#x7684;&#x65F6;&#x5019;&#x5230;&#x4ED6;&#x8033;&#x6735;&#x8FB9;&#x5927;&#x58F0;&#x8BF4;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x542C;&#x5230;&#xFF0C;&#x6BCF;&#x6B21;&#x4ED6;&#x89C1;&#x5230;&#x964C;&#x751F;&#x4EBA;&#x7ED9;&#x4ED6;&#x793A;&#x610F;&#xFF0C;&#x4ED6;&#x90FD;&#x4F1A;&#x5148;&#x8BF4;&#x201C;&#x6211;&#x8033;&#x6735;&#x542C;&#x4E0D;&#x6E05;&#xFF0C;&#x4E0D;&#x8981;&#x89C1;&#x602A;&#x201D;&#xFF0C;&#x4E61;&#x91CC;&#x4EBA;&#x90FD;&#x6E05;&#x695A;&#x4ED6;&#xFF0C;&#x6240;&#x4EE5;&#x4EA4;&#x6D41;&#x4E5F;&#x4E0D;&#x5B58;&#x5728;&#x5927;&#x95EE;&#x9898;&#x3002;&#x4ED6;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x56FA;&#x6267;&#x7684;&#x4EBA;&#xFF0C;&#x81EA;&#x5DF1;&#x8BA4;&#x5B9A;&#x7684;&#x4E8B;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x4E5F;&#x4E0D;&#x60F3;&#x53BB;&#x6539;&#x53D8;&#xFF0C;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x5C0F;&#x65F6;&#x5019;&#x53EA;&#x8981;&#x4E00;&#x53D7;&#x5230;&#x6B3A;&#x8D1F;&#xFF0C;&#x4ED6;&#x5C31;&#x4E0D;&#x7BA1;&#x4E0D;&#x987E;&#x7684;&#x633A;&#x8EAB;&#x800C;&#x51FA;&#xFF0C;&#x5BF9;&#x6211;&#x7684;&#x8981;&#x6C42;&#x53EA;&#x8981;&#x80FD;&#x505A;&#x5230;&#x7684;&#x4ED6;&#x90FD;&#x4F1A;&#x7B54;&#x5E94;&#x6211;&#x3002;&#x5C31;&#x8FD9;&#x6837;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x4ED6;&#x8D8A;&#x6765;&#x8D8A;&#x8001;&#xFF0C;&#x6211;&#x8D8A;&#x957F;&#x8D8A;&#x5927;&#xFF0C;&#x6211;&#x5341;&#x516B;&#x5C81;&#x4E0A;&#x4E86;&#x5927;&#x5B66;&#x5F00;&#x59CB;&#xFF0C;&#x56DE;&#x5BB6;&#x7684;&#x65F6;&#x95F4;&#x5C31;&#x7279;&#x522B;&#x5C11;&#xFF0C;&#x5927;&#x5B66;&#x6BCF;&#x5230;&#x653E;&#x5047;&#xFF0C;&#x6211;&#x592A;&#x516C;&#x5C31;&#x901A;&#x8FC7;&#x6211;&#x5F1F;&#x95EE;&#x6211;&#x600E;&#x4E48;&#x8FD8;&#x4E0D;&#x56DE;&#x6765;&#x3002;&#x73B0;&#x5728;&#x7EC8;&#x4E8E;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x540E;&#x9762;&#x51E0;&#x5E74;&#xFF0C;&#x6211;&#x5DE5;&#x4F5C;&#x5728;&#x4E0A;&#x6D77;&#x7684;&#x65F6;&#x5019;&#x6211;&#x592A;&#x516C;&#x77E5;&#x9053;&#x6211;&#x8981;&#x56DE;&#x6765;&#xFF0C;&#x7ECF;&#x5E38;&#x5728;&#x719F;&#x6089;&#x7684;&#x5730;&#x65B9;&#x7B49;&#x5F85;&#x7740;&#x6211;&#x56DE;&#x6765;&#x3002;<br><img src="http://ojxhdwqig.bkt.clouddn.com/%E5%AE%B6%E4%BA%BAIMG_2904.JPG" alt=""></p>
<p>&#x6211;&#x4E5F;&#x53EA;&#x80FD;&#x5C3D;&#x91CF;&#x5728;&#x653E;&#x5047;&#x7684;&#x65F6;&#x5019;&#x56DE;&#x53BB;&#x770B;&#x4ED6;&#xFF0C;&#x522B;&#x4EBA;&#x653E;&#x5047;&#x90FD;&#x53BB;&#x65C5;&#x6E38;&#xFF0C;&#x800C;&#x6211;&#x662F;&#x5BB6;&#x91CC;&#x6709;&#x671F;&#x5F85;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x5FC5;&#x987B;&#x56DE;&#x5BB6;&#xFF0C;&#x8FD8;&#x597D;&#x5973;&#x670B;&#x53CB;&#x6CA1;&#x6709;&#x591A;&#x5C11;&#x610F;&#x89C1;&#xFF0C;&#x96BE;&#x4E3A;&#x4ED6;&#x4E86;&#x3002;&#x5DE5;&#x4F5C;&#x4E86;&#x51E0;&#x5E74;&#xFF0C;&#x6211;&#x592A;&#x516C;&#x8EAB;&#x4F53;&#x4E00;&#x76F4;&#x5F88;&#x597D;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x4E00;&#x76F4;&#x5728;&#x5916;&#x9762;&#x5B89;&#x5FC3;&#x5DE5;&#x4F5C;&#x7684;&#x57FA;&#x7840;&#x3002;&#x53EF;&#x662F;&#x4E0A;&#x5929;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x7684;&#x65E0;&#x60C5;&#xFF0C;&#x76F4;&#x5230;2015&#x5E74;&#xFF0C;&#x6709;&#x6B21;&#x56DE;&#x5BB6;&#x5446;&#x4E86;&#x51E0;&#x5929;&#x8D70;&#x7684;&#x65F6;&#x5019;&#x6211;&#x592A;&#x516C;&#x7A81;&#x7136;&#x5BF9;&#x6211;&#x8BF4;&#x201C;&#x8FC7;&#x5E74;&#x56DE;&#x6765;&#x5C31;&#x89C1;&#x4E0D;&#x5230;&#x592A;&#x516C;&#x4E86;&#x201D;&#x5F53;&#x65F6;&#x6211;&#x5185;&#x5FC3;&#x4E00;&#x6014;&#xFF0C;&#x60F3;&#x54ED;&#xFF0C;&#x4F46;&#x662F;&#x60F3;&#x5230;&#x6211;&#x592A;&#x516C;&#x5BF9;&#x81EA;&#x5DF1;&#x8FD9;&#x4E48;&#x6CA1;&#x4FE1;&#x5FC3;&#xFF0C;&#x5C31;&#x5B89;&#x6170;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x7136;&#x540E;&#x544A;&#x522B;&#x4E86;&#xFF0C;&#x53EF;&#x662F;&#x8C01;&#x80FD;&#x60F3;&#x5230;&#x8FD9;&#x6B21;&#x544A;&#x522B;&#x7ADF;&#x7136;&#x4F1A;&#x662F;&#x6C38;&#x522B;&#x2026;..&#x65F6;&#x95F4;&#x53D1;&#x751F;&#x5728;&#x90A3;&#x5E74;&#x5C0F;&#x5E74;&#x591C;&#x7684;&#x524D;&#x4E00;&#x4E2A;&#x665A;&#x4E0A;&#xFF0C;&#x4F60;&#x8D70;&#x4E86;&#xFF0C;&#x8D70;&#x7684;&#x90A3;&#x4E48;&#x5B89;&#x8BE6;&#xFF0C;&#x542C;&#x5230;&#x90A3;&#x4E2A;&#x6D88;&#x606F;&#xFF0C;&#x6211;&#x7B80;&#x76F4;&#x611F;&#x89C9;&#x5929;&#x90FD;&#x8981;&#x584C;&#x4E86;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x8FD9;&#x6837;&#xFF0C;&#x9A6C;&#x4E0A;&#x5C31;&#x8981;&#x8FC7;&#x5E74;&#xFF0C;&#x5C31;&#x80FD;&#x76F8;&#x89C1;&#x4E86;&#xFF0C;&#x53EF;&#x662F;&#x600E;&#x4E48;&#x4F1A;&#x8FD9;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x77E5;&#x9053;&#x4F1A;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x5C31;&#x4E0D;&#x5E94;&#x8BE5;&#x51FA;&#x53BB;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x5C31;&#x5E94;&#x8BE5;&#x7559;&#x5728;&#x8EAB;&#x966A;&#x7740;&#x4F60;&#x8D70;&#x5B8C;&#x8FD9;&#x6700;&#x540E;&#x7684;&#x4E00;&#x7A0B;&#x3002;&#x4F60;&#x7684;&#x65E0;&#x79C1;&#x5949;&#x732E;&#x6210;&#x5C31;&#x4E86;&#x4ECA;&#x5929;&#x7684;&#x6211;&#xFF0C;&#x6211;&#x5982;&#x613F;&#x8D70;&#x51FA;&#x56FD;&#x95E8;&#xFF0C;&#x53EF;&#x662F;&#x5374;&#x518D;&#x4E5F;&#x89C1;&#x4E0D;&#x5230;&#x4F60;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x662F;&#x4F60;&#x4E00;&#x76F4;&#x9ED8;&#x9ED8;&#x7684;&#x5B88;&#x62A4;&#x7740;&#x6211;&#xFF0C;&#x4F60;&#x6C38;&#x8FDC;&#x662F;&#x6211;&#x6700;&#x656C;&#x7231;&#x7684;&#x4EBA;&#x3002;<br><img src="http://ojxhdwqig.bkt.clouddn.com/%E5%AE%B6%E4%BA%BAIMG_2464.JPG" alt=""></p>
<p>&#x5BCC;&#x54E5;&#xFF0C;2012&#x5E74;&#x521A;&#x51FA;&#x6765;&#x5B9E;&#x4E60;&#x7684;&#x65F6;&#x5019;&#x5728;&#x4E0A;&#x6D77;&#x8BA4;&#x8BC6;&#x7684;&#xFF0C;&#x4E0D;&#x77E5;&#x600E;&#x4E48;&#x7684;&#x5C31;&#x6210;&#x4E3A;&#x4E86;&#x65E0;&#x8BDD;&#x4E0D;&#x8C08;&#x7684;&#x597D;&#x670B;&#x53CB;&#xFF0C;&#x5728;&#x5979;&#x9762;&#x524D;&#x8BF4;&#x4EC0;&#x4E48;&#x8BDD;&#xFF0C;&#x505A;&#x4EC0;&#x4E48;&#x4E8B;&#x90FD;&#x4E0D;&#x7528;&#x4F2A;&#x88C5;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4E5F;&#x4ECE;&#x6765;&#x4E0D;&#x4F2A;&#x88C5;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x559C;&#x6B22;&#x8DDF;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x76F8;&#x5904;&#x3002;&#x4ECE;&#x6B66;&#x6C49;&#x53BB;&#x4E0A;&#x6D77;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#x670B;&#x53CB;&#xFF0C;&#x90FD;&#x662F;&#x4ED6;&#x4E00;&#x76F4;&#x966A;&#x7740;&#x6211;&#xFF0C;&#x540E;&#x9762;&#x6211;&#x8FDB;&#x4E86;&#x4E8C;&#x4E09;&#x56DB;&#x4E94;&#x4E5F;&#x662F;&#x4ED6;&#x65E0;&#x610F;&#x63A8;&#x8350;&#xFF0C;&#x4ED6;&#x8FDB;&#x4E86;&#x9694;&#x58C1;&#x7684;TCL,&#x6211;&#x4EEC;&#x5468;&#x672B;&#x6709;&#x65F6;&#x95F4;&#x5C31;&#x4F1A;&#x4E00;&#x8D77;&#x53BB;&#x73A9;&#xFF0C;&#x5728;&#x4E0A;&#x6D77;&#x6362;&#x4E86;&#x51E0;&#x6B21;&#x623F;&#x5B50;&#x90FD;&#x662F;&#x6211;&#x5E2E;&#x4ED6;&#x642C;&#xFF0C;&#x4ED6;&#x5E2E;&#x6211;&#x642C;&#x3002;2016&#x5E74;&#x6211;&#x4EEC;&#x8FD8;&#x7ECF;&#x5E38;&#x4E00;&#x8D77;&#x6CE1;&#x6FA1;&#xFF0C;&#x4ED6;&#x4E5F;&#x5728;&#x897F;&#x5B89;&#x4E70;&#x4E86;&#x623F;&#x5B50;&#xFF0C;&#x51C6;&#x5907;&#x5B58;&#x70B9;&#x94B1;&#x5C31;&#x56DE;&#x5BB6;&#x5B89;&#x4EAB;&#x665A;&#x5E74;&#x7684;&#xFF0C;&#x7545;&#x60F3;&#x672A;&#x6765;&#x3002;&#x6211;&#x4ECA;&#x5E74;&#x8FC7;&#x5B8C;&#x5E74;&#x5306;&#x5306;&#x6765;&#x4E86;&#x65B0;&#x52A0;&#x5761;&#xFF0C;&#x90FD;&#x6CA1;&#x6709;&#x8DDF;&#x4ED6;&#x6765;&#x7684;&#x53CA;&#x9053;&#x522B;&#xFF0C;&#x672C;&#x4E3A;&#x6253;&#x7B97;&#x6211;&#x5728;&#x8FD9;&#x8FB9;&#x7A33;&#x5B9A;&#x4E00;&#x70B9;&#x5C31;&#x63A8;&#x8350;&#x4ED6;&#x6765;&#x8FD9;&#x8FB9;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x53C8;&#x80FD;&#x5728;&#x4E00;&#x8D77;&#x73A9;&#x800D;&#x3002;&#x53EF;&#x662F;&#x5929;&#x65E0;&#x773C;&#xFF0C;&#x4ED6;&#x88AB;&#x67E5;&#x51FA;&#x80C3;&#x51FA;&#x8840;&#xFF0C;&#x4F4F;&#x9662;&#x4F4F;&#x7740;&#x5C31;&#x518D;&#x4E5F;&#x6CA1;&#x8054;&#x7CFB;&#x6211;&#x4E86;&#xFF0C;&#x6211;&#x591A;&#x4E48;&#x5E0C;&#x671B;&#x8FD9;&#x4E0D;&#x662F;&#x771F;&#x7684;&#xFF0C;&#x6709;&#x4E00;&#x5929;&#x4F60;&#x4F1A;&#x5728;&#x5FAE;&#x4FE1;&#x4E0A;&#x7ED9;&#x6211;&#x8BF4;&#x4F60;&#x5F88;&#x597D;&#x3002;<br><img src="http://ojxhdwqig.bkt.clouddn.com/friendsIMG_20160609_152501.jpg" alt=""><br><img src="http://ojxhdwqig.bkt.clouddn.com/friendsIMG_20160609_140528.jpg" alt=""></p>
<p>&#x6211;&#x59D1;&#x7237;&#x7237;&#x524D;&#x6BB5;&#x65F6;&#x95F4;&#x56E0;&#x4E3A;&#x764C;&#x75C7;&#x79BB;&#x5F00;&#x4E86;&#x6211;&#x4EEC;&#xFF0C;&#x4ED6;&#x90A3;&#x6DF1;&#x523B;&#x7684;&#x7B11;&#x5BB9;&#x5370;&#x5728;&#x4E86;&#x6211;&#x7684;&#x8111;&#x6D77;&#x91CC;&#x3002;</p>
<p>&#x611F;&#x89C9;&#x751F;&#x547D;&#x7684;&#x65E0;&#x5E38;&#xFF0C;&#x5728;&#x751F;&#x547D;&#x9762;&#x524D;&#xFF0C;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x90FD;&#x4E0D;&#x503C;&#x4E00;&#x63D0;&#x3002;&#x968F;&#x7740;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x6700;&#x5BB3;&#x6015;&#x7684;&#x4E8B;&#x5C31;&#x662F;&#x4EB2;&#x4EBA;&#x7684;&#x79BB;&#x53BB;&#xFF0C;&#x4E00;&#x5B9A;&#x73CD;&#x60DC;&#x548C;&#x4EB2;&#x4EBA;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x65F6;&#x5149;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>


    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/03/16/2017-me/" rel="next" title="2017年目标">
                <i class="fa fa-chevron-left"></i> 2017年目标
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2018/03/01/时而忧伤/" rel="prev" title="有时候会有一些莫明的忧伤">
                有时候会有一些莫明的忧伤 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2017/08/28/当亲人离你而去/"
           data-title="当身边的人离你而去" data-url="http://stareme.wang/2017/08/28/当亲人离你而去/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel sidebar-panel-active">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/uploads/me.png"
               alt="stareme" />
          <p class="site-author-name" itemprop="name">stareme</p>
          <p class="site-description motion-element" itemprop="description">敢问路在何方</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">15</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/wangbin0802" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/1646304090/profile?topnav=1&wvr=6" target="_blank" title="Weibo">
                  
                    <i class="fa fa-fw fa-weibo"></i>
                  
                  Weibo
                </a>
              </span>
            
          
        </div>

        
        

        
        

        


      </section>

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">stareme</span>
</div>


<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>


        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.1.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.1.0"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.0"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.0"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.0"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"staremewang"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    
    <script src="/lib/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  








  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
      search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();
    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';
      $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = $( "entry", xmlResponse ).map(function() {
            return {
              title: $( "title", this ).text(),
              content: $("content",this).text(),
              url: $( "url" , this).text()
            };
          }).get();
          var $input = document.getElementById(search_id);
          var $resultContent = document.getElementById(content_id);
          $input.addEventListener('input', function(){
            var matchcounts = 0;
            var str='<ul class=\"search-result-list\">';
            var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
            $resultContent.innerHTML = "";
            if (this.value.trim().length > 1) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var content_index = [];
                var data_title = data.title.trim().toLowerCase();
                var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                var data_url = decodeURIComponent(data.url);
                var index_title = -1;
                var index_content = -1;
                var first_occur = -1;
                // only match artiles with not empty titles and contents
                if(data_title != '') {
                  keywords.forEach(function(keyword, i) {
                    index_title = data_title.indexOf(keyword);
                    index_content = data_content.indexOf(keyword);
                    if( index_title >= 0 || index_content >= 0 ){
                      isMatch = true;
                      if (i == 0) {
                        first_occur = index_content;
                      }
                    }

                  });
                }
                // show search results
                if (isMatch) {
                  matchcounts += 1;
                  str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                  var content = data.content.trim().replace(/<[^>]+>/g,"");
                  if (first_occur >= 0) {
                    // cut out 100 characters
                    var start = first_occur - 20;
                    var end = first_occur + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if(start == 0){
                      end = 50;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    var match_content = content.substring(start, end);
                    // highlight all keywords
                    keywords.forEach(function(keyword){
                      var regS = new RegExp(keyword, "gi");
                      match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                    });

                    str += "<p class=\"search-result\">" + match_content +"...</p>"
                  }
                  str += "</li>";
                }
              })};
            str += "</ul>";
            if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
            if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
            $resultContent.innerHTML = str;
          });
          proceedsearch();
        }
      });}

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>


  

  

  

  


</body>
</html>
